{
  "completeRevs": [
    [
      {
        "asin": "B000FA64PA",
        "title": "Saboteur: Star Wars Legends (Darth Maul) (Short Story) (Star Wars: Darth Maul Book 1)",
        "reviewTime": "10 11, 2013",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Darth Maul",
        "overall": 5,
        "reviewText": "Darth Maul working under cloak of darkness committing sabotage now that is a story worth reading many times over.  Great story."
      },
      {
        "asin": "B000FA64PA",
        "title": "Saboteur: Star Wars Legends (Darth Maul) (Short Story) (Star Wars: Darth Maul Book 1)",
        "reviewTime": "02 13, 2011",
        "reviewerID": "AQZH7YTWQPOBE",
        "reviewerName": "Enjolras",
        "summary": "Not bad, not exceptional",
        "overall": 4,
        "reviewText": "This is a short story focused on Darth Maul's role in helping the Trade Federation gain a mining colony. It's not bad, but it's also nothing exceptional. It's fairly short so we don't really get to see any characters develop. The few events that do happen seem to go by quickly, including what should have been major battles. The story is included in the novelShadow Hunter (Star Wars: Darth Maul), which is worth reading, so don't bother to buy this one separately."
      },
      {
        "asin": "B000FA64PA",
        "title": "Saboteur: Star Wars Legends (Darth Maul) (Short Story) (Star Wars: Darth Maul Book 1)",
        "reviewTime": "01 27, 2014",
        "reviewerID": "A1ZT7WV0ZUA0OJ",
        "reviewerName": "Mike",
        "summary": "Audio and book",
        "overall": 5,
        "reviewText": "I think I have this one in both book and audio. It is a good story either way. good ol' Maul."
      },
      {
        "asin": "B000FA64PA",
        "title": "Saboteur: Star Wars Legends (Darth Maul) (Short Story) (Star Wars: Darth Maul Book 1)",
        "reviewTime": "09 17, 2011",
        "reviewerID": "A2ZFR72PT054YS",
        "reviewerName": "monkeyluis",
        "summary": "Darth Maul...the brother I never had.",
        "overall": 4,
        "reviewText": "Title has nothing to do with the story.  I did enjoy it though.  Good short story about Darth Maul setting up two corporations against each other.  All in the end to help Darth Sidious' rise to power.  Won't take you long to read & it's cheap.  Go for it."
      },
      {
        "asin": "B000FA64PA",
        "title": "Saboteur: Star Wars Legends (Darth Maul) (Short Story) (Star Wars: Darth Maul Book 1)",
        "reviewTime": "12 31, 2013",
        "reviewerID": "A2QK1U70OJ74P",
        "reviewerName": "Sharon Deem",
        "summary": "Not bad; it is well written",
        "overall": 3,
        "reviewText": "Well written. Interesting to see Sideous (through Maul) maneuvering events to fit his plan. We see human nature at work. But no good guys to root for. Even Rurit is a helpless pawn."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "03 15, 2012",
        "reviewerID": "A3SZMGJMV0G16C",
        "reviewerName": "Andrew Pruette \"Rancors Love to Read",
        "summary": "Han and Leia reunited and Barabel Jedi introduced",
        "overall": 3,
        "reviewText": "Troy Denning's novella Recovery was originally published in e-book form and is a short tale set after the events of Kathy Tyers' Balance Point. Han and Leia Solo's relationship was fractured early in the Yuuzhan Vong invasion by the death of someone in the family, and the books prior to Recovery, notably the Agents of Chaos duology, spent time exploring Han's journey to reclaim himself from his demons and Leia's efforts to be patient with the process.  Ms. Tyers reunited the couple in Balance Point as the battle for Duros commenced, but it is in this short story that they truly begin the emotional healing process.We start on Corellia with a battle in a hospital and an appearance from Han's rogue cousin Thracken Sal-Solo. It's good to touch base on what Sal-Solo has been up to since he fired the Centerpoint weapon earlier in the New Jedi Order. Mr. Denning uses this story to introduce a group of his preferred characters, a tight-knit group of saurian Barabel Jedi. Here they are accompanied by an entertainingly non-conventional, salt-addicted Arcona Jedi as well as a human Jedi, Master Eelysa, known for her lengthy and complicated solo missions. The Barabel come into full play in Mr. Denning's own Star by Star and are memorable characters: it's welcome, if certainly not essential, to have their background more fully fleshed out here.In fact, the Jedi provide the most entertaining aspect of Recovery. The Solo reactions to the explicitly non-human worldview of the Barabel are genuinely funny, especially as they struggle to comprehend Barabel humor. Mr. Denning handles the evolution of their relationship and concurrent healing capably enough, although no aspect of this jumps out at me as especially memorable. The final two chapters take the story on a race to Coruscant to stop a potentially disastrous Senate vote. This portion feels rushed, as if it was constrained by the limitations of being a short e-book, but it brings events to a satisfying close nevertheless.Certainly not an essential read, Recovery does flesh out aspects of the New Jedi Order and it worth a look to anyone reading that part of the saga, especially if you are a fan of Mr. Denning's later novels and want to get a bit more insight into the origin of a couple of his preferred Jedi characters."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "05 12, 2013",
        "reviewerID": "A3H8PE1UFK04JZ",
        "reviewerName": "Caleb Watts",
        "summary": "Possibly Important",
        "overall": 5,
        "reviewText": "I am not for sure on how much of a difference the short story has on the overall series (I haven't read on yet), but I would recommend that anyone buy it to help them understand the whole series better.P.S.- The series is one of the best of all the Star Wars series."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "01 2, 2014",
        "reviewerID": "A2EN84QHDRZLP2",
        "reviewerName": "Carl craft",
        "summary": "Another read",
        "overall": 5,
        "reviewText": "I really enjoyed the book. Had the normal back against the wall moments. It even had laugh out loud moments."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "10 29, 2013",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Recovery",
        "overall": 5,
        "reviewText": "Great read enjoyed every minute of it .  I think it answers some questions that are out there about this series."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "04 16, 2009",
        "reviewerID": "A38Z3Q6DTDIH9J",
        "reviewerName": "Jimmy J. Shaw \"oldbent1",
        "summary": "Star Wars: The New Jedi Order: Recovery",
        "overall": 3,
        "reviewText": "Another well written eBook by Troy Denning, but why is it put where it is? Why not a part of Balance Point? It is well written and belongs in the new Jedi Order. I just don't think it should stand alone. It is fun and fast to read on my Kindle, but not even in paperback????"
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "01 27, 2014",
        "reviewerID": "A1ZT7WV0ZUA0OJ",
        "reviewerName": "Mike",
        "summary": "my collection",
        "overall": 5,
        "reviewText": "This one promises to be another good book. I have been reading through the series and have not gotten this far yet."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "07 20, 2012",
        "reviewerID": "A22CW0ZHY3NJH8",
        "reviewerName": "Noname",
        "summary": "Not a necessary read, but I liked it",
        "overall": 4,
        "reviewText": "I have a version of \"Star by Star\" that does not include the novella \"Recovery,\" so I downloaded this book onto my Fire.  \"Recovery\" tells of Leia's recovery after she was nearly killed in \"Balance Point.\"  If it was meant to tell the story of the healing of Han and Leia's relationship, it surely failed.  There was far too much action to attempt much more than a few brief moments or reconciliation.  They have a deeper understanding of each other but not much time to work on it.Is it a necessary read?  Not really.  I could have skipped it (I actually did) and not miss much.  It felt like the extraneous part of a book that had been edited out, like in the DVD's, where it's billed as the extras.  People pay to see those extras.  I did.  It was worth it, but probably not to everyone."
      },
      {
        "asin": "B000FA64PK",
        "title": "Recovery: Star Wars Legends (The New Jedi Order) (Short Story) (Star Wars: The New Jedi Order)",
        "reviewTime": "12 31, 2013",
        "reviewerID": "A2QK1U70OJ74P",
        "reviewerName": "Sharon Deem",
        "summary": "Fits right into New Jedi Order timeline",
        "overall": 5,
        "reviewText": "Excellent! Very well written story, very exciting with LOTS of action. The bad guys trying to kill Leia and Han. Viki Shesh is introduced."
      },
      {
        "asin": "B000FA64QO",
        "title": "Ylesia: Star Wars Legends (The New Jedi Order) (Star Wars: The New Jedi Order)",
        "reviewTime": "03 15, 2012",
        "reviewerID": "A3SZMGJMV0G16C",
        "reviewerName": "Andrew Pruette \"Rancors Love to Read",
        "summary": "Minor New Jedi Order side story",
        "overall": 2,
        "reviewText": "With Ylesia, a novella originally published in e-book form, Walter Jon Williams gets an opportunity to insert further story into his novel Destiny's Way. The events of Ylesia take place midway through that book, so this is a good read to tackle immediately after finishing Destiny's Way. The novella follows a New Republic mission to the titular planet, which is serving as the capital of the traitorous Peace Brigade and houses their attempt at a Senate. The Peace Brigade promote capitulation to the Yuuzhan Vong and have served as a human counterpoint to the efforts of the Jedi and the more heroic members of the New Republic throughout the New Jedi Order. They are a logical part of the story but not one I've found terribly interesting, as we rarely get anything told from their point-of-view, making them rather cardboard as adversaries.Yleisa brings back Thracken Sal-Solo in an entertaining plotline which sees him forcibly installed as the President of the Peace Brigade. This doesn't fit well with Sal-Solo's plans to better his own galactic situation but he displays a knack for adaption and survival not unlike that of his famous cousin Han Solo. Ylesia itself, a major source of the drug spice in the Star Wars galaxy, will be familiar to readers of A. C. Crispin's Han Solo Trilogy, and it's nice to see it return.For the most part Yleisa doesn't advance the story of Destiny's Way much: primarily, it delivers some closure to the Peace Brigade subplot. Sal-Solo was the most memorable aspect, as some of the space battle and ground assault material following the New Republic's invasion of the system felt like material I've read an awful lot of times before.  Ylesia is a solid enough little story but I would only recommend it to someone going through the entire New Jedi Order and wanting a little more."
      },
      {
        "asin": "B000FA64QO",
        "title": "Ylesia: Star Wars Legends (The New Jedi Order) (Star Wars: The New Jedi Order)",
        "reviewTime": "02 4, 2014",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Ylesia",
        "overall": 5,
        "reviewText": "Great book couldn't put it down.  The story expands events in the new Jedi order series.  Good writer in Walter Jon Williams."
      },
      {
        "asin": "B000FA64QO",
        "title": "Ylesia: Star Wars Legends (The New Jedi Order) (Star Wars: The New Jedi Order)",
        "reviewTime": "05 17, 2011",
        "reviewerID": "AQZH7YTWQPOBE",
        "reviewerName": "Enjolras",
        "summary": "A Thrackan story",
        "overall": 4,
        "reviewText": "Most of the New Jedi Order books focus on the Solo kids, to the extent that some are viewed as \"Jacen books\" or \"Jania books.\" The novella Ylesia is if anything a book starring Thrackan Sal-Solo. Thrackan is forcibly recruited by the Yuuzhan Vong to become president of the Peace Brigade Republic. However, the New Republic forces also choose to attack Ylesia. There's nothing new or terribly exciting in the novel, but it's a nice side story. It's written in a similar style asDestiny's Way (Star Wars: The New Jedi Order, Book 14), which isn't surprising as they're both by the same author. This short story actually takes place during the novel, so I'd recommend reading the novel first so Ylesia doesn't spoil any surprises."
      },
      {
        "asin": "B000FA64QO",
        "title": "Ylesia: Star Wars Legends (The New Jedi Order) (Star Wars: The New Jedi Order)",
        "reviewTime": "01 27, 2014",
        "reviewerID": "A1ZT7WV0ZUA0OJ",
        "reviewerName": "Mike",
        "summary": "my e- collection",
        "overall": 5,
        "reviewText": "I was hoping to find this one in book form. The story looks like it will be good when I get that far in the series."
      },
      {
        "asin": "B000FA64QO",
        "title": "Ylesia: Star Wars Legends (The New Jedi Order) (Star Wars: The New Jedi Order)",
        "reviewTime": "08 7, 2012",
        "reviewerID": "A22CW0ZHY3NJH8",
        "reviewerName": "Noname",
        "summary": "One huge chapter",
        "overall": 3,
        "reviewText": "The events of \"Ylesia\" take place during \"Destiny's Way.\"  If you've read \"Destiny's Way,\" you will see it mentioned in passing.Jaina and Jacen go to Ylesia to fight the Peace Brigade to show them that it's not good to align themselves with the enemy.  From there, it is page after page of battle scenes.  It is endless.  One huge chapter.  It's like the chapter that was cut out for good reason.\"Ylesia\" doesn't advance \"Destiny's Way\" or \"The New Jedi Order\" in any way that I could tell.  We don't learn anything new.  There is no insight.  If I had skipped it, I wouldn't have missed anything.If you don't mind reading in PDF, \"Ylesia\" is available free from Del Rey.  If you Google, you'll see it linked to the Wayback machine and it's still there."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "02 15, 2014",
        "reviewerID": "A3AZH0OO0GUAI3",
        "reviewerName": "Amazon Customer",
        "summary": "An interesting short story.",
        "overall": 5,
        "reviewText": "Really shouldn't have Han Solo on the cover as he doesn't come into the story.This story is all about Chewbacca and his family.I won't give anything away, but it is a nice, if short, read."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "08 25, 2008",
        "reviewerID": "A3SZMGJMV0G16C",
        "reviewerName": "Andrew Pruette \"Rancors Love to Read",
        "summary": "Short story featuring everyone's favorite Wookiee",
        "overall": 3,
        "reviewText": "Originally published as an e-book coinciding with the release of the novel Tatooine Ghost, Troy Denning's A Forest Apart is a short story following Chewbacca, his wife Mallatobuck, and his son Lumpy on a adventure into the bowels of Coruscant. Malla and Lumpy are visiting Chewie at his Coruscant apartment when a break-in at the next-door Solo place turns out to have more serious ramifications. The Wookiees follow the burglars and end up unearthing an Imperial plot set in place by an old tool of the villainous Ysanne Isard.There's a lot of action in a short space but not much time for meaningful character development. Lumpy is a pre-teen striving to find his place in the world, and Chewbacca's perpetual absence in his life may have left a gaping hole as far as having a father figure to look up to. There's not enough pages to explore this theme with much depth, and in the end the issue is dropped, since on a practical level Lumpy can't live with his father chasing all over the galaxy anyway. The theme of the impact a Wookiee Life Debt has on the Wookiee holding it and on his/her family is an interesting one that could be explored in more detail with a longer story.Unlike many novels which handle Chewie's communications by having him grunt and then having a nearby character paraphrase what he said, Denning makes the wise choice of letting the Wookiees speak as normal characters and simply puts brackets to indicate they are actually using their native tongue. It's always enjoyable seeing Chewbacca in action, and even though this story doesn't really add anything significant to the larger saga, it's an entertaining diversion."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "04 1, 2013",
        "reviewerID": "A3H8PE1UFK04JZ",
        "reviewerName": "Caleb Watts",
        "summary": "Great",
        "overall": 4,
        "reviewText": "This book was a good idea. I have always wanted to read more about Chewbaccas son Lumpy. Though I do wish he would have added more to the ending. I would recommend this book to anyone who loves Star Wars and Chewbacca."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 2, 2014",
        "reviewerID": "A2EN84QHDRZLP2",
        "reviewerName": "Carl craft",
        "summary": "Another read",
        "overall": 5,
        "reviewText": "Great short story. It gives a little more insight into the walking carpet we all love, this time as a father"
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "10 11, 2013",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Love It",
        "overall": 5,
        "reviewText": "I love anything with Chewbacca in it.  Him and his family is just a bonus.  Kind of nice to see him having problems with his son."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "04 16, 2009",
        "reviewerID": "A38Z3Q6DTDIH9J",
        "reviewerName": "Jimmy J. Shaw \"oldbent1",
        "summary": "Star Wars: A Forest Apart",
        "overall": 5,
        "reviewText": "A great little chapter to read on my Kindle, but not necessarily worth the price. It would have been a nice addition to The Courtship of Princess Leia or an add on to Tatooine Ghost. I liked it, but when it doesn't even rate being published as a paperback; an avid Star Wars fan you will need to be to download and read this eBook."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 27, 2014",
        "reviewerID": "A1ZT7WV0ZUA0OJ",
        "reviewerName": "Mike",
        "summary": "my collection",
        "overall": 5,
        "reviewText": "I love the stories with Chewie in them! this e-book is no exception. great character introductions and wonderful story line."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 14, 2012",
        "reviewerID": "A3D58M29K2HWMV",
        "reviewerName": "P. Thompson \"romancewriter",
        "summary": "Enjoyable But...",
        "overall": 4,
        "reviewText": "I'm not really sure where it actually fits into the overall story line.This story involves only Chewie and his wife and son.  The other characters are only mentioned in passing.  It was enjoyable and well written but I was glad it was very short and didn't keep me from the main story for very long."
      },
      {
        "asin": "B000FBFMVG",
        "title": "A Forest Apart: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "04 7, 2013",
        "reviewerID": "A12LKEM543ILBK",
        "reviewerName": "zombie phreak",
        "summary": "A Good Quick Read",
        "overall": 3,
        "reviewText": "I really do enjoy Troy Denning's work, I want everyone who reads this review to know this.  I loved Star by Star and I very much enjoyed Tattooine Ghost.  This book \"A Forest Apart\" wasn't on par with his other works.  It wasn't without it's charm, but it had things in it that I didn't like.The story itself is pretty simple.  It's a coming of age story for Chewbacca's son, and instead of coming of age on Kashyyyk, he is growing up on Coruscant.  It's not horrible, and we find out that Lumpy is an avid gamer and enjoys playing video games and that he idolizes his father.***SPOILERS***  ***SPOILERS***  ***SPOILERS***First of all, why is Han Solo on the cover?  He's not even IN this story other than a few mentions of his name.  Why not have Chewbacca and Lumpy instead of Han and Chewie?  Also, I HATE books where Chewbacca's grunts and growls are translated.  Like in the Black Fleet Trilogy, he had his speech translated and it was just stupid.  I feel that he works much better as a strong silent type who speaks through his actions rather than his words.  I mean imagine in characters like Jason Vorhees, Michael Meyers, Silent Bob, or Sphynx (from Gone in 60 Seconds), all just started having lengthy conversations throughout their movies?  They lose some of what makes those characters awesome.  Sometimes an author can say very much by having a character say very little.My only other problem with the book is when Chewie and Malla have the droid \"IT\" in their blaster sights, his back is to them and he doesn't see them.  Why don't they just shoot him?  Instead they send Lumpy out as a \"distraction.\"  Yet he doesn't really do anything worth mentioning to distract IT and his minions.  He walks out on the observation deck where they are hiding, opens the window and drops down to the level where IT and his minions are loading nerve gas onto transport ships.  I mean that's not much of a distraction, besides the point of a distraction is to get someone's attention away from one spot so you can do something while they are not looking.  Well, IT wasn't looking in your direction to begin with, so why bother?  They could have just taken up positions on the observation deck and shot him.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***Okay so this story wasn't really bad other than a few minor details I didn't like.  I did like seeing that even in a galaxy far far away that we have sons who want to be like their fathers and get into trouble when they do rebellious things.  This story reminded me of what a good writer Troy Denning is and it reminded me to add his other works to my wishlist.Check this one out!"
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "09 24, 2010",
        "reviewerID": "A3SZMGJMV0G16C",
        "reviewerName": "Andrew Pruette \"Rancors Love to Read",
        "summary": "Enjoyable Imperial slice-of-life story",
        "overall": 3,
        "reviewText": "Timothy Zahn's Fool's Bargain is a short story originally published in e-book form and set before the events of his novel Survivor's Quest. This tale covers an assignment Aurek Company of the Imperial 501st receives on the embattled planet Kariek. The focus is on the four troopers who comprise Aurek-Seven and in particular their leader Twister. This is the same squad that plays a part in Survivor's Quest, minus one personnel change which is detailed in this story. There aren't many Expanded Universe stories that take the Imperial point of view, so this is a welcome perspective here. By this stage in the galaxy's history, years after the Battle of Endor, certain elements of the Empire have developed a more enlightened perspective of the universe around them. These troopers are honorable soldiers fighting for a government they believe in, one that no longer ruthlessly oppresses subject populations but rather plays more of a protector role.The Empire of the films is notably a human-centric organization. Zahn opens the door to alien Imperials in this story with the introduction of Su-mil, an Eickarie and a Kariek native swept up in a civil war. There is a clever bit of deception on Su-mils part involving the Eickarie concept of a lie (they term a lie \"left-handed,\" vs. a truth which is \"right-handed\" - this must be awkward for the native left-handed Eickaries!). By fighting together, Twister sees a potentially valuable ally in Su-mil and we get a perspective of how a stormtrooper unit might be something a soldier would actually aspire to join, rather than simply being cannon fodder for Rebel heroes.All in all, Fool's Bargain is an enjoyable vignette of Imperial life that expands a bit on characters from Survivor's Quest and also provides an interesting preview of the Imperial perspective Zahn went on to explore more thoroughly in his novel Allegiance. It can be purchased in electronic form and is also available in the paperback version ofSurvivor's Quest (Star Wars)."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "02 25, 2014",
        "reviewerID": "AIG0I95Q2H1GF",
        "reviewerName": "Anita",
        "summary": "A Short Story",
        "overall": 3,
        "reviewText": "Not too bad, an intro-short-story for some bigger upcoming novel. It's timothy Zahn, what did you expect from the master of Science Fiction."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "04 1, 2013",
        "reviewerID": "A3H8PE1UFK04JZ",
        "reviewerName": "Caleb Watts",
        "summary": "Great",
        "overall": 5,
        "reviewText": "I absolutely love this book. Though it is short it was written by Zahn. Any Star Wars fan knows this book is a good one. I would recommend this book to anyone who loves Star Wars."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "10 11, 2013",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Stormtroopers",
        "overall": 5,
        "reviewText": "What can I say Stormtroopers.  A story with troopers is as awesome as a story with any Sith lord.  AWESOME!!!!!!"
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "09 24, 2010",
        "reviewerID": "AQZH7YTWQPOBE",
        "reviewerName": "Enjolras",
        "summary": "Too short, not enough story",
        "overall": 2,
        "reviewText": "For whatever reason, Star Wars short stories are a bit of a hit or miss. The \"Tales of...\" are great in that they explain background characters. However,Fool's Bargaindidn't really fit the bill. It's a short story about a relatively minor and unmemorable character from Timothy Zahn'sSurvivor's Quest (Star Wars). The story itself is basically about stormtroopers storming a fortress with some mysterious Warlord. Unlike most of Zahn's other work, this is mostly a book of action, not intricate plot development. In fact, the story ends with an exciting twist, but doesn't develop it. I feel like this short story would have been better had it been about a character we all know and love, or included a really interesting plot twist. Also, just to note, this same story is included in the paperback copy ofSurvivor's Quest (Star Wars), so there's no need to buy the separate Kindle version."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "04 16, 2009",
        "reviewerID": "A38Z3Q6DTDIH9J",
        "reviewerName": "Jimmy J. Shaw \"oldbent1",
        "summary": "Star Wars: Fool's Bargain",
        "overall": 3,
        "reviewText": "As an ebook it reads very well on my Kindle, but it really doesn't seem to belong where it is. Maybe at the end of The Dark Nest Trilogy or Legacy of the Force, but it just seems not to have a place it belongs in the Star Wars universe. At least not to me."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "05 14, 2012",
        "reviewerID": "A2OIGPPBTR65MR",
        "reviewerName": "para",
        "summary": "Enjoyable, if unremarkable, stormtrooper tale.",
        "overall": 3,
        "reviewText": "** Note: this story appears as a bonus in the paperback edition of Survivor's Quest. **Fool's Bargain is a short story featuring the stormtroopers of Aurek-Four, a unit of the Imperial 501st Legion of the Empire of the Hand.  It takes place shortly before the events of Survivor's Quest, but is probably best read after.The Empire of the Hand is involved in a war to rid the native Eickarie people of their latest warlord, but the 501st curious orders are very specific - take the warlord alive.  This story is tightly focused, with a couple of characters firmly at the center.  There's good detail here but for some reason it doesn't feel as well developed as other short stories I've read by Zahn.  Also,  those who look for big names in their Star Wars stories will want to give this a pass.  A couple of minor characters from Survivor's Quest show up in largely supporting roles, but there are no movie characters nor beloved favorites here.But despite these caveats Fool's Bargain is a good short story that gives further glimpse of Zahn's take on stormtroopers, which he touched on in Survivor's Quest, and would continue to explore in later novels (Allegiance and Choices of One)."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "01 17, 2013",
        "reviewerID": "A1YEPFLLH42OU1",
        "reviewerName": "Yu-jin &amp; Tracy Chia \"Yu-Jin Chia",
        "summary": "An average short story",
        "overall": 2,
        "reviewText": "I admit it, I snapped this up the moment I saw it on new releases, because I tend to do that with anything written by Timothy Zahn. He is, in my opinion, one of the best contemporary sci-fi authors where it comes to world building, intricate plot, and edge-of-seat action. His Thrawn and Conqueror's trilogies were incredible, Quadrail and Cobra were very unique and engaging, and even his one-off novels like Icarus Hunt and Outbound Flight are excellent. So I figured this would be too.First off, when I hit the end my jaw dropped and I literally said aloud \"Huh? That's it?!\" I then spent several minutes looking to see if it picked up somewhere else. It is a really short story, barely longer than some of the ones that appear in the 'Tales' Star Wars series (and those books have several of them!). It's also, I must say, a lot less interesting than most of them and probably the single weakest plot I've seen Zahn write. It's not terrible, but it really isn't that great either- there's no twists and at the end you're left wondering where the other half of the story is. The novella revolves around a force of Stormtroopers who are only somewhat memorable (as is the case with most such white-armored shock troops) and though there is quite a bit of action, it kind of reads like a (short) movie or videogame script.Overall, not worth paying for. In fact, it should really be free if you ask me."
      },
      {
        "asin": "B000FC1BN8",
        "title": "Fool's Bargain: Star Wars Legends (Novella) (Star Wars - Legends)",
        "reviewTime": "05 17, 2013",
        "reviewerID": "A12LKEM543ILBK",
        "reviewerName": "zombie phreak",
        "summary": "Excellent!",
        "overall": 5,
        "reviewText": "I love Timothy Zahn's work!  He does what no other writer, not even George Lucas himself can do.  He takes the rank and file Storm Troopers and gives them personalities, talents, skills and makes them multi-dimensional characters that people can get invested in.Where most writers show the Storm Troopers as faceless cannon fodder who can't hit anything with their blasters, Zahn shows them as competent sharpshooting elite commandos who can think on their feet and adapt to any situation as well as follow orders.***SPOILERS***  ***SPOILERS***  ***SPOILERS***So the story is a pretty basic one.  There is an alien warlord who is ruling a planet with an iron fist, and the Empire decides it is time to go and free the plant of his rule, so they dispatch the 501st Legion a.k.a. Vader's Fist to take him down.There is something I do wonder about though, this takes place after Vader is dead, and after Thrawn's rule has ended.  So why does the 501st Legion keep calling themselves \"Vader's Fist?\"  Vader's not around anymore?  Do they keep the name just for the sake of nostalgia?  It's not really a major gripe, just something that makes me scratch my head.Our main characters are three Storm Troopers who all have different skills and specialties.  They infiltrate the warlord's fortress and meet up with some of the local freedom fighters and strike a deal with them.  If the troopers help them free their imprisoned comrades, they will help the troopers get inside and take out the warlord's troops and bring him to justice.The troopers agree and they infiltrate the stronghold together.  Later it seems the rebels have betrayed the Storm Troopers, but it turns out it is just a very elaborate ruse and the rebels were always on the side of the troopers and the prisoners are freed and the warlord is captured by the Empire and brought to justice.Later the head of the rebels is offered a position in the 501st Legion, which is awesome!  It really helps to enforce the fact that the Empire has learned that just having humans in their military doesn't help, it's a hindrance and it was the main reason the Rebel Alliance was able to defeat them.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***Zahn gives us action, gun fights, intrigue and a little bit of politics as well in this story.  Any fan of Star Wars or Zahn's writing will enjoy this book very much!"
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "03 15, 2012",
        "reviewerID": "A3SZMGJMV0G16C",
        "reviewerName": "Andrew Pruette \"Rancors Love to Read",
        "summary": "Worthwhile addition to the New Jedi Order",
        "overall": 4,
        "reviewText": "Karen Traviss was noted during her time as a Star Wars author for her fascination with the Mandalorian culture along with her disdain for the Jedi. These traits fueled several exceptional stories in the Republic Commando novels but also started to become a bit of a distraction over time, especially as her stories became increasingly drenched in Mandalorian worship. It's an interesting choice to have her author a short story (originally an e-book) for the New Jedi Order, as beyond a nod in the final volume, Mandalorians are conspicuously absent. This story is very much like her full length Star Wars novels: Mandalorian focused, chapters starting with intriguing italicized quotes from various in-universe sources, and a very cinematic way of staging scenes and cutting between them.So it turns out the choice was a good one: having Ms. Traviss bring her sensibilities to the New Jedi Order provides a sorely-needed shift from the overall tone of the nineteen novels. It's fascinating how she juxtaposes Boba Fett and his allies against the Yuuzhan Vong, two cultures both comfortable with violence as a means to an end but diametrically opposed as to the means. This story is set chronologically before Vector Prime, meaning it could be a reader's first introduction to the Yuuzhan Vong culture, and overall I would say that's neither worse nor better than first encountering them via Vector Prime. It's just different, as Vector Prime shows the Vong through the lens of the Jedi and here we meet them through the alternate viewpoint of Mandalorian mercenaries.This story brings us up-to-date on an older Boba Fett, one still living the mercenary life while also having responsibilities as the Mandalore, the leader of his people. It's an interesting dynamic how Fett feels a sense of duty to this role while simultaneously keeping it at arm's length. The sequences where Fett and a companion walk through a Vong vessel and encounter the extra-galactic invaders for the first time is superb, as we see their disgusted reactions to the bloody Vong culture firsthand. The ending of the story leaves the Mandalorians as true anti-heroes, secretly doing the right thing while being openly despised for their seemingly traitorous actions. I would have liked to see this thread interwoven throughout the New Jedi Order, but alas, A Practical Man was penned late in the game.Despite any misgivings I developed over time with Ms. Traviss' tendency to elevate the Mandalorians and demonize the Jedi in her writing, there is no denying that she was an exceptional Star Wars author. Her stories are distinct, hard-edged, and propel along much like the films themselves, even when they get heavy on dialogue vs. action. Boba Fett: A Practical Man is a distinct entity in the New Jedi Order and well worth a read: even better, it could be read by someone interested in Fett and his people without having to go further in the nineteen books that follow."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 2, 2014",
        "reviewerID": "A2EN84QHDRZLP2",
        "reviewerName": "Carl craft",
        "summary": "Another reader",
        "overall": 5,
        "reviewText": "Good read. I enjoyed the look into another side of Boba fett. I suggest is as a gate way to the next set"
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "10 11, 2013",
        "reviewerID": "A1UG4Q4D3OAH3A",
        "reviewerName": "dsa",
        "summary": "Fetts the man",
        "overall": 5,
        "reviewText": "Boba Fett sort of gets screwed, but turns it around when he starts screwing over the Yuzahn Vong.  Very Cool."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "06 4, 2011",
        "reviewerID": "AQZH7YTWQPOBE",
        "reviewerName": "Enjolras",
        "summary": "A fun story",
        "overall": 4,
        "reviewText": "It's nice to see an author go back and visit the New Jedi Order era. This time, Karen Traviss combines fan favorite Boba Fett and NJO favorite Nom Anor to show the Mandalorians' role in the Yuuzhan Vong war. Traviss does a pretty good job fitting both into their characters. Boba Fett is appropriately cynical, but at the same time also concerned about the Mandalorians. Traviss doesn't yet go so far as to make Boba Fett one of the good guys. It's an interesting character transformation. We also get to see Nom Anor's private thoughts and a bit more insight into his time as infiltrator.Even for a short story, it seemed a bit too short and ends rather abruptly. I would have liked to have seen  bit more, or at least learn what the Mandalorians did after the first few weeks of the invasion. It's tough to be satisfied with this after reading Unifying Force, where Han sees Boba Fett fighting alongside Alliance troops. Hopefully that story will be written one day."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "04 16, 2009",
        "reviewerID": "A38Z3Q6DTDIH9J",
        "reviewerName": "Jimmy J. Shaw \"oldbent1",
        "summary": "Star Wars: Bobba Fett: A Practical Man",
        "overall": 4,
        "reviewText": "This is an ebook and is a good read, but why not just include with one of the new Jedi Order books as a supplement??? It is fun to read it on my Kindle, but still the same it could have been added to several of the New Jedi Order series............."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 18, 2012",
        "reviewerID": "A2TYXDDR7U35HO",
        "reviewerName": "Kurt Joseph Pankau",
        "summary": "Overwhelmed by Stupidness",
        "overall": 1,
        "reviewText": "I got about two pages into this before giving up. The style is clunky, the internal monolog doesn't gel with the character we know, and the story starts at the end of a chase scene that probably would have been really interesting if the author had bothered to write it."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "06 11, 2013",
        "reviewerID": "A3ANJVTVKPRIKM",
        "reviewerName": "Michael W. Gray",
        "summary": "good but to short",
        "overall": 4,
        "reviewText": "Tis is a good short story but I was hoping for more I'm not a big fan of the yuzan vong war series but this was good anyway more would have been better"
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "01 27, 2014",
        "reviewerID": "A1ZT7WV0ZUA0OJ",
        "reviewerName": "Mike",
        "summary": "my collection",
        "overall": 5,
        "reviewText": "I haven't gotten time to read this one yet. I intend to read it soon though. Looks like a good book."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "08 13, 2009",
        "reviewerID": "A1J75JJ0Q2OEJN",
        "reviewerName": "Raven A. Wind",
        "summary": "A Good Reason Not to Miss Traviss' Star Wars Books",
        "overall": 1,
        "reviewText": "Sigh... What can I say? This is more of Karen Traviss' mary-sue adventures of Boba Fett and the almighty, infallible, infinitely over-detailed and completely boring Mandalorians, who bear a strong resemblance to Scottish Highlanders in an average B-grade romance novel.It's stuff like this that makes me glad she has decided to stop writing Star Wars.As usual, Traviss throws out established canon to match her ideas and fit her story. This book is pointless, as the whole premise is flawed, based on a non-canon idea, and will be zapped out of existence once the T-Canon episodes of Clone Wars (which trump the C-Canon (soon to be S-Canon or N-Canon) ideas in Traviss' books.)Traviss has managed to take one of the coolest characters in the Star Wars universe and turn him into one of the most annoying, uninteresting, boring, obnoxious, mary-sue characters ever written. She took the quiet cool of Boba Fett, and turned him into a character who just Wouldn't Shut Up. She took Mandalorians and turned them from an elusive, lost, dying race of people who were cooler for having been scattered across the galaxy, into a clan of dancing, singing, Mando'a speaking, boastful morons whose place in canon is now a convoluted mess.And don't get me started on how plodding and over-detailed her writing is. If you want to know every tiny, minuscule, stupid thing about a character, just turn to Traviss' books. You're lucky if she doesn't tell you how, when, and where Boba acquired his underwear, and what they're made of.Suffice it to say, I'm not a fan of Traviss' work. I consider her Star Wars books to be a notch below Barbara Hambly's disastrous efforts. Read this only if you're a huge fan of Traviss, or a huge fan of Non-Canon Star Wars books... Because this one can't stand up to scrutiny."
      },
      {
        "asin": "B000JMKNQ0",
        "title": "Boba Fett: A Practical Man: Star Wars Legends (Short Story) (Star Wars - Legends)",
        "reviewTime": "05 18, 2013",
        "reviewerID": "A12LKEM543ILBK",
        "reviewerName": "zombie phreak",
        "summary": "Terrific!!!",
        "overall": 5,
        "reviewText": "Let me start this review off by saying that no one, and I mean NO ONE can write for Boba Fett as well as Karen Traviss can.  When I saw this book on Amazon I was delighted and I was even more excited when I found out that she wrote it!***SPOILERS***  ***SPOILERS***  ***SPOILERS***I knew from the Star Wars comics that the Mandalorians were involved in the Vong War during their invasion and that they fought alongside them against the New Republic.  But this e-book really helped fill in the gaps that the comics and the novels left.  I knew they weren't just in it for the credits!The visuals that Karen Travis paints with her story were just amazing!  Having Boba Fett walking through the depths of one of the Vong's ships was great!  I could almost smell the slime oozing from the walls and hear the squishing of his boots as he walked across the pulsing floor.  Also, having him compare being in the ship to being back inside the Sarlaac pit was very cool as well.During the book, the Mandalorians are faced with a moral dilemma.  They have signed up with the Vong, thinking they are just an army that wants to wreck a few worlds and they'll get some quick cash off of it.  But it turns out it's an entire invasion armada and they want to destroy the entire galaxy!  Boba Fett and the Mandalorians have already taken the job so they are honor bound to stand by their word and fight alongside the Vong against the New Republic.  However in doing so, Fett adds on that the Vong have to leave his home planet of Mandalore alone.  They agree and of course they are lying to him.  But this gives Boba Fett the time he needs to mobilize his people for war.  And when you have the entire population of the Mandalorian home world gunning for you, you might just want to reconsider your course of action!While fighting alongside the Vong, Boba Fett manages to sneak information to the New Republic about the Vong, their plans, their technology and their biology.  Eventually the New Republic wises up and realizes that the Mandos are double agents and they send a Jedi Master to parley with Boba Fett.  He tells the Jedi to keep this under wraps and to keep fighting against the Mandalorians as if they are the true enemy in order to keep up the ruse so they can continue to slip the New Republic information about the invaders.  The Jedi Master asks what Fett wants in return.  He only asks for one thing, that the Republic knows that a Mandalorian warrior died to save a Jedi Master.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***This book was awesome!  Karen Traviss continued to do what she did best in the Star Wars universe, writing for Boba Fett and the Mandalorians.  It really is too bad that she and the rest of the Star Wars writers had a falling out due to creative differences and that she is no longer writing for Star Wars.  I would have loved to read more of her work in a Star Wars setting."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "12 5, 2013",
        "reviewerID": "A24EF8B5KZXOSW",
        "reviewerName": "Amazon Customer",
        "summary": "I prefer the paper copy",
        "overall": 3,
        "reviewText": "It was the same content as the paper version but I prefer the paper copy. The kindle is great for a novel or long narrative material but not for a magazine filled with short articles, quips, jokes, etc.  In the paper copy it is much easier to leaf thorough and read what you are in the mood for at the moment."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "02 2, 2011",
        "reviewerID": "AX3GWKHTWUZI6",
        "reviewerName": "Annette",
        "summary": "Excellent Magazine!",
        "overall": 5,
        "reviewText": "I subscribed to the Reader's Digest for my Kindle 2.  I didn't turn on my wireless between the 1st and 5th of the month, therefore, I didn't receive my first issue.  I canceled my subscription noting the reason being I didn't receive my first issue due to the fact that I didn't know I had to have my wireless on during the first 5 days of the month.  My fault for not reading more of the info about subscriptions.  Anyway, a couple of days later I received a refund of $1.49 on my credit card without even requesting it!  I re-subscribed to Reader's Digest and set my cell phone calendar alarm to remind me to turn my wireless on for my Kindle on the first day of the month so I'll get my copy from now on. I got my copy this month. Hope this gives enough information to those who want to subscribe but aren't sure what to do after subscribing. Happy reading!"
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "04 28, 2014",
        "reviewerID": "A0328927TA7ECTIKNP3G",
        "reviewerName": "Darlene",
        "summary": "Very good.",
        "overall": 4,
        "reviewText": "I enjoyed the reader's digest very much. If I could figure out how to get it on my Kinkle I would"
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "02 26, 2008",
        "reviewerID": "ABXANRX4GPYRZ",
        "reviewerName": "hdtravel",
        "summary": "A Magazine Classic for Kindle",
        "overall": 5,
        "reviewText": "This magazine has been around for years and now you can read it on your cool, new, chic Kindle.Very nice ! No pesky ads !!Way to go Amazon and Reader's Digest !Thank You !Highly recommended !"
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "01 6, 2013",
        "reviewerID": "A369CD103RXLLT",
        "reviewerName": "James Barden",
        "summary": "not a fan",
        "overall": 2,
        "reviewText": "This wasn' the best reader digest that I have read so far there are some that I do like and some I don't."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "08 6, 2008",
        "reviewerID": "A3GRN6J64F2C3X",
        "reviewerName": "Joseph P. Menta, Jr.",
        "summary": "Engaging material, with graphics that stand out",
        "overall": 4,
        "reviewText": "Can't say I've subscribed yet, but I have picked up an occasional issue of Reader's Digest on the Kindle.  It's a good mix of light feature pieces (an entertaining profile of actor Pierce Brosnan was a good read) and long, detailed investigative articles (good one on the airline industry in the same issue).  You also get actual captioned cartoons (a rarity on the Kindle!) and other fun elements.You also get another bonus.  If there's one criticism I have of Kindle blogs and magazines, it's visual sameness.  The New York Times looks like Newsweek which looks like The Philadelphia Inquirer, etc.  But Reader's Digest on the Kindle looks like, well... Reader's Digest.  You get the sharp, catchy graphics of the print edition (with the headline and sub-headlines of a story often embedded within the main photo just like in the regular magazine), and other pieces of visual flair- like the cartoons mentioned earlier- carried over from the magazine, too.  I guess it's a small point (as content is really the most important thing), but it's nice seeing a Kindle magazine that looks truly different from other Kindle magazines.  With luck this will be the beginning of a trend.But, yeah, give an issue a shot.  Even if you usually read weightier fare on your Kindle, you may just find the content and visual flair of Reader's Digest on the Kindle to be an occasional refreshing change.Note: Amazon frequently updates the presentation and functionality of Kindle blogs and periodicals, so as this review gets older, it may no longer accurately describe the current version of this product."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "06 10, 2009",
        "reviewerID": "A38WDDU0G8PG4G",
        "reviewerName": "Lawrence and/or Christine Dol \"Software Monkey",
        "summary": "Always Good",
        "overall": 4,
        "reviewText": "I've always like the Reader's Digest for a good blend of writing from humor to drama, having subscribed to the print version a number of times off and on over the years.  The actual content quality has always remained consistently high for this publication.It does seem the print version has become overloaded with ads, but that was less of a problem than the annoying cardboard insert/tear-out ads that make the thing physically difficult to read.The Kindle version is a very much improved experience over the print version, with the same high quality writing, of course.  A bonus is that the linked navigation makes it really easy to find an article for the mood I'm in at a given moment."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "12 7, 2007",
        "reviewerID": "AY54QSGO3KWEM",
        "reviewerName": "Legalsea",
        "summary": "Yeah, no Ads!",
        "overall": 4,
        "reviewText": "I'm well old enough to remember when the Reader's Digest did not have advertising (it began accepting ads in the 1970s). I quit buying Reader's Digest because it seemed to contain nothing but advertising, and was difficult to find articles. The Kindle edition of Reader's Digest solves that problem nicely. No ads. Just the articles and regular features."
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "11 29, 2010",
        "reviewerID": "A3ILO637M9PLDP",
        "reviewerName": "Mary A. \"Grammy of 5",
        "summary": "Ugh!",
        "overall": 2,
        "reviewText": "I've read Readers Digest for years and love it. Thought getting it on my Kindle would be great.Not so much! Compare the Kindle version as plain white rice to a full course meal. Wasn't hardly anything I liked about it. I think the table of contents should be laid out differently. Didn't like it at all. Listed the main component and you had to click and click to find what you want to read. Would have been much better to show the main catagory then physically print the subtitles underneath it as links. That way you could actually quickly \"see\" the article you'd like to read.  I thought the content was poor at best. Seemed like there wasn't much to the \"magazine\". Short articles and not very interestng articles. Loss of the picture content and short anedotes between the stories left me feeling very disappointed. I think Readers Digest needs to do much better. Especially since there are a lot of magazines going out of business due to the evolution of the internet and applications such as ereaders. The only think I did like about the e-version  was the absence of those pesky ads. I'm glad I only bought the single current issue. Come on RD....you can do much better!"
      },
      {
        "asin": "B000PIT0RG",
        "title": "Reader's Digest",
        "reviewTime": "12 30, 2010",
        "reviewerID": "AYR9IPMLD93HI",
        "reviewerName": "Robin",
        "summary": "Simply Fabulous!",
        "overall": 5,
        "reviewText": "I am a new Kindle user and downloaded my first issue of Reader's digest and was simply delighted with it!  I read it from cover to cover over a few days time which I have never done in the hard copy of the magazine.  I love that there are no ads and found it easy to navigate between the articles and features.  Thanks Kindle and Reader's digest!Its a few months later and I am updating that I still LOVE this magazine in Kindle format. I have seen a few people complain about not getting their back issues but I have no trouble at all with it. I had been off for a few weeks and when I returned I went to my Manage my Kindle on Amazon and there was a down arrow where I could select which issue I wanted to download so I selected both I had not read and voila! Both are on my Kindle now for me to read.  No problems at all.  Enjoy the magazine!"
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "01 16, 2013",
        "reviewerID": "APK52HQX128K4",
        "reviewerName": "Amazon Customer",
        "summary": "Mail Order Husband",
        "overall": 4,
        "reviewText": "It was very interesting how Lauri Robinson put that twist in this story.  It keeps you inteerst to the very end, and makes you wonder how it is going to turn how,  I recommend to book to be read, I think anyone would enjoy reading this."
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "01 9, 2011",
        "reviewerID": "AY35FZ3MNN5JA",
        "reviewerName": "Anne Couch",
        "summary": "Mail Order Husband",
        "overall": 1,
        "reviewText": "Great story line....but that is all!  Penny our heroine is BI POLAR !  Could have done a whole lot better.  Characters needed developement not candy land."
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "02 4, 2014",
        "reviewerID": "A3IPSB7PA7UL9V",
        "reviewerName": "barbara wilson",
        "summary": "Joliet dream or reality",
        "overall": 5,
        "reviewText": "No one ever heard of a marriage by proxy, yet That's what Penny and Chace had. is he weeknight in shining armour if is he a figment of her imagination. Through trials and tribulations, they find that this truly is his second nod chance and he does need to stay, but does she truly want him to or will she for e him to return to Philadelphia?"
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "06 15, 2014",
        "reviewerID": "A1W2M3YH0966UZ",
        "reviewerName": "karen dietz",
        "summary": "Mail Order Husbands - wouldn't it be nice ?",
        "overall": 5,
        "reviewText": "Maybe, maybe not .  Mail  Order Husband is a story well played out in the reader's mind.  Written well.  Transports us readers back in time, drawing us in as their story unfolds.  I love a book that draws  the reader  into the story from the first chapter."
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "04 5, 2014",
        "reviewerID": "AAATLN9UJSA3G",
        "reviewerName": "Midnight Attic Reader",
        "summary": "Mail Order Husband",
        "overall": 4,
        "reviewText": "Since her father's death, Penny's been plagued by troubles on the ranch and sinister characters have been lurking about, and though she doesn't like the idea much, she feels she has no choice but to send for a mail order husband, dreaming of a knight in shining armor coming to right all her problems, despite her professed pessimism regarding the scheme. Penny and Jace were such engaging characters, making great equal partners when it was called for, but also falling easily into the more traditional roles of meek woman and strong, protective man at other times, and it was fascinating to see the movement back and forth between the two. The mistaken assumptions on both sides throughout the story became frustrating and by the end it was heartbreaking to see the characters following through with noble actions that neither of them wanted. I'm glad it all worked out in the end, but I wish things could have been resolved a bit sooner. The humorous bits sprinkled throughout the story were great!"
      },
      {
        "asin": "B0010YXO6M",
        "title": "Mail Order Husband",
        "reviewTime": "01 18, 2014",
        "reviewerID": "A2JGUWT5LHEV2X",
        "reviewerName": "S. M. Giltrap",
        "summary": "Mail Order Husband",
        "overall": 4,
        "reviewText": "A Great read. The Husband to be is a special person who is anyone's dream of a hero to be tied in marriage to."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "12 6, 2012",
        "reviewerID": "A19OJ7L2JSE60F",
        "reviewerName": "Amazon Customer",
        "summary": "Typical old west romance",
        "overall": 3,
        "reviewText": "This one seemed a lot like ye other Jillian Hart novel.  Marriage in name only, hiding true feelings, broody wounded man. Lots of scenes where the sun catches their beauty.  I enjoyed the book Homespun Bride, with Thad, more."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "05 17, 2012",
        "reviewerID": "A3LGIK3UBNUSR7",
        "reviewerName": "Bernadette",
        "summary": "No Heated Bedroom Scenes",
        "overall": 4,
        "reviewText": "This book was more spiritual than any of Ms Hart's books that I have read. I had always wondered why they called her work spiritual when so many of her books gave a smattering of sex. This one didn't.This book was not one of high adventure, but one of two fractured souls learning to love again. It was well worth the read, but don't expect any hot bedroom scenes. This is just a good love story."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "09 2, 2011",
        "reviewerID": "A27FCSPUEKFW1X",
        "reviewerName": "BobbieJ Stiles",
        "summary": "Great Book",
        "overall": 5,
        "reviewText": "This book is in a series of books by the author.  I enjoy all of her books and I am always looking for more stories that she has written.  I highly recommend this and her other books."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "08 31, 2013",
        "reviewerID": "A293Y2VDEK3Z98",
        "reviewerName": "Cynthia Lanette Burger",
        "summary": "High Country Bride",
        "overall": 4,
        "reviewText": "This is such a great story. I was so happy to find this book after reading \"Homespur Bride\". I'm glad Jillian Hart wrote both these books, and didn't stop with just the first story. I look forward to reading more book by this wonderful writer, Thank You Jillian Hart."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "07 8, 2013",
        "reviewerID": "A3GPLYSDLSTP10",
        "reviewerName": "farmgirl13",
        "summary": "High country bride",
        "overall": 5,
        "reviewText": "Excellent book, couldn't put it down. Now I got to find another Jillian Hart book. I read another one of her books and it also was an excellent book."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "12 28, 2013",
        "reviewerID": "A1GQOV7SE71TB0",
        "reviewerName": "jeanbean",
        "summary": "High Country Bride",
        "overall": 5,
        "reviewText": "Aiden McKaslin, a widow, and Joanna Nelson with two children to raise by herself lived different lives trying to get by.  Aiden could not forget his dead wife and Joanna just tried to keep a roof over her childrens heads by doing the right things. Love was hard earned and was a struggle until an almost tragic event. Good read."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "03 16, 2013",
        "reviewerID": "A3Q1KLWRFQ59JM",
        "reviewerName": "Jim",
        "summary": "Almost Erotic Western",
        "overall": 3,
        "reviewText": "Way too much sex for me. Started out great. Got me interested, then came the rolling in the hay with explicit descriptions. Not for me."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "05 5, 2014",
        "reviewerID": "A1PSJD6LZQ50Z1",
        "reviewerName": "kate476",
        "summary": "From homeless to husband",
        "overall": 3,
        "reviewText": "A little ho hum.  Joanna is a great heroine who really needs a break.  Aiden is her break.  He is a super nice guy but the I can never love again because I buried my heart with my first wife has been done to death.  He comes from a dream family with the exception of one brother who i assume will crop up in another book.  They're all kindness and light.  The good people from the church however are all mean and backstabbing.  Could someone explain to me why in all these Christian books the church goers are gossipy hags who have fun hurting peoples feelings.  Anyway it is nicely written and has some real charm going for it.  But don't expect originality."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "02 23, 2013",
        "reviewerID": "A2H5ZOAWHTOVRJ",
        "reviewerName": "NinerFan",
        "summary": "Loved it!!",
        "overall": 5,
        "reviewText": "This is a fantastic story.  Aidan and Joanna were wonderful characters.  This is a must read.  I probably would read it again some time."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "07 4, 2013",
        "reviewerID": "A3SQEP4RZ3669X",
        "reviewerName": "Unknown",
        "summary": "Heart warming",
        "overall": 5,
        "reviewText": "Good story showing the enduring quality of love despite loss, heartbreak and stubornness to let new love into your heart after loss."
      },
      {
        "asin": "B001BM2ZFO",
        "title": "High Country Bride",
        "reviewTime": "05 11, 2014",
        "reviewerID": "A2VD5H1TUFNSX6",
        "reviewerName": "Yorkiegirl",
        "summary": "High Country Bride",
        "overall": 5,
        "reviewText": "This is one of Jillian Harts better books in my opinion. It was a clean well written story that I enjoyed every bit of. The characters were strong and likable. I can not figure out why Ms. Hart feels compelled to write some of her stories filled with sexual description and others without. All of her stories are very interesting, why, then, does she feel she has to throw in the sex stuff that really, in my opinion, adds nothing to the story, in fact ruins it. Case in point, this book."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "12 28, 2012",
        "reviewerID": "A3F32VDCU1JFZT",
        "reviewerName": "Angela Wilmoth \"Romance Book Lover",
        "summary": "Wonderful",
        "overall": 5,
        "reviewText": "Waiting for Baby is a wonderful book. Once I started reading I couldn't put it down. The reality of how families from split homes is so realistic. The author protrayed early last labor is on the money as well. I highly suggest this book."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "12 29, 2012",
        "reviewerID": "A2M1QYOWLBGRHT",
        "reviewerName": "Jenny",
        "summary": "I loved this book",
        "overall": 5,
        "reviewText": "I really loved this book, once I started reading it, I could not put it down.  It was a really great story."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "03 6, 2014",
        "reviewerID": "A2JVQ0QSQRK8RC",
        "reviewerName": "Karin Hurt",
        "summary": "This book should come with a warning:",
        "overall": 5,
        "reviewText": "If you are pregnant don't read this.\"I adored Jake who has spent his entire life on Bear Creek Ranch and is now running it. Did I like Lilly? Not so much. Jake and Lilly had had a relationship which included sex, but after a while Jake broke if off in order to protect his three daughters who lived with his ex wife. Lilly found herself pregnant and having given birth to two stillborn babies and one severely handicapped one who also died, feared this child would be born having the same problems began to turn into a depressing drama queen.Don't get me wrong it is a wonderful book with a great message by a talented writer I just discovered, and I loved reading it. Just like I said...if you are pregnant pick another story."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "12 8, 2010",
        "reviewerID": "A2X227JUB8VTIT",
        "reviewerName": "LuckyMe",
        "summary": "Wonderful Read",
        "overall": 4,
        "reviewText": "I really enjoyed this book.  I thought it would be the standard -woman gets pregnant and the father has to convince her to marry but she keeps saying no.  This time I understood her reasoning.  Considering her past, it made perfect sense for Lilly to be cautious about giving in to her feelings and to trust and feel hope again. This one makes you think.  Everything is not always black and white.  Very good read."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "05 17, 2013",
        "reviewerID": "A1G3XQ9MCU9KXU",
        "reviewerName": "Maegan",
        "summary": "Good book",
        "overall": 3,
        "reviewText": "So normally when I read romance novels I get mad at the female lead for being too passive. In this book I actually got annoyed with how stubborn she was being and felt bad for Jake who I felt she was kind of jerking around a bit at times. It was a good book though. I had already read a previous book with some of the same characters and I liked it as well. Mcdavid is definitely an author I'll keep an eye on in the future."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "10 5, 2012",
        "reviewerID": "A2C5MTWH3HE1YJ",
        "reviewerName": "Nana B",
        "summary": "Great series - Book 2",
        "overall": 5,
        "reviewText": "This is book 2 of this super love story series set in the mountains of Arizona.  This author is fantastic and I am enjoying reading more of her books.  You will not be able to put them down once you get started."
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "08 1, 2013",
        "reviewerID": "A5GSSJBGEPDR5",
        "reviewerName": "Nichole K",
        "summary": "Addictive",
        "overall": 5,
        "reviewText": "I couldn't put this book down. The rise and fall of the story line captured me.....so much so that I finished the book in less than 3 days. Can't wait for the next one by this author.....such a great writer.If I were a movie producer this book would be one of the top choices to make into a blockbuster hit.Nichols"
      },
      {
        "asin": "B002B9MH7C",
        "title": "Waiting for Baby (Baby To Be)",
        "reviewTime": "10 14, 2013",
        "reviewerID": "A2C8S6EB6MKYAX",
        "reviewerName": "Paula",
        "summary": "Very emotional story",
        "overall": 4,
        "reviewText": "This was a very emotional, and touching story. Lilly in her first marriage, had a miscarriage, a stillborn. Her last pregnancy she had her son, which was born with birth defects. He didn't live long. Her husband couldn't stand to look or hold his own son. It tore Lilly's heart apart. She loved her son with her heart and soul. After the funeral, she received divorce papers. She now works for an adult daycare.  She loves her job, and knows she is helping other families. Lilly and jack were dating, but Jack broke it off. The two still cared for each other. When they found out Lilly was pregnant, Jack stepped up to the plate. Lilly was scared, and Jack gave her his strength, and comfort. This is a book I think all should read. It was really moving.Sample from chapter 7 - His goal was to take the necessary steps to help his daughters adjust to a blended family and to make sure Lilly's decision to marry him was well thought out and deliberate. That it was a decision she'd never regret. And if he had to woo her one dinner date, one yoga class, one shopping spree at a time, he'd do it gladly.Sample from chapter 8 - \"The baby could have so many things wrong, it would never be able to leave home and might need machines to stay alive.\" \"That sucks.\" Yes, it did. \"I have to go, sweetie.\" Lilly patted Miranda's shoulder. \"Please don't tell anyone about the baby until I say you can. Okay?\" \"My mother doesn't tell people about me, either.\" \"I can't believe that,\" Lilly said vehemently, although admittedly, she didn't know Miranda's mother. Her sister always brought her to the center. \"Sometimes, when she thinks I'm not around, she says she only has one daughter.\" \"Oh, Miranda.\" Lilly could have cried. The young woman crewed up her face into an angry scowl. \"I bet if you had a kid like me, you'd be the same way.\" Lilly pulled Miranda into a fierce hug. \"If I had a daughter like you, I'd be so happy and s proud, I'd tell everybody I met about my beautiful girl, and how much I loved her."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "03 5, 2012",
        "reviewerID": "A1JFAVCFID95WC",
        "reviewerName": "angela longstaffe",
        "summary": "life is not always fair",
        "overall": 5,
        "reviewText": "InHomeward Hearts (Topaz Historical Romances), we find two lost souls and their very different ways of dealing what life dished up for them. Our hero was wrongly accused of having killed his unfaithful wife. He was convicted on circumstantial evidence and the word of a man he had trusted. A deathbed confession of said man gets our hero released from prison after five years.  While anyone wrongfully send to prison would react with anger and distrust, a younger person lashes out differently than an older more mature person and the author skillfully shows us the anger of a young man of having lost five years of his live and the distrust of pretty much anyone he meets.  Of course there is more to the story; a bounty hunter is searching for our hero, forcing him to hide, doing different jobs and then to flee again. He grimly accepts that he will for the rest of his life be a drifter.Our heroine is not your typical petit little lady but a tall, competent woman. Her mother had died years ago, at which point her father, the blacksmith of a small town, turns to whiskey, leaving her to fend for their survival in a dying town.  Now he is dead too, leaving her with a mortgage on her home and no way of paying it. She advertises for a blacksmith, offering room and board as she is unable to pay. The whole town pities her but does nothing to help and only gossips about her.Our hero does not make the best impression when the first meet and their different personalities continue to clash. The hero is angry and distrustful and she tries to make the best of what life is offering her which includes a slimy suitor.Bit by bit, day by day, hero and heroine learn to trust and depend on each other. However, doom in form of the bounty hunter arrives in town. The night before, the heroine was able to pay her mortgage and now is dreaming of more than making the best of it. They also during that night finally shared intimacy (beautifully written, for a change I did not skim the s*x scenes) and the heroine hopes that the hero now will stay. He knows he loves her but feels he is not good enough for her and also, he can't give her a stable home as he feels, he needs to look over his shoulder for the rest of his life.They part bitterly, the heroine shouting the one insult she knows hurts him most. Retreating back into her super competent personality, she pays him what they agreed, half of what was left after the pays of the mortgage and gives him what she believes a worthless mining claim. She gives it to him because deep down, she does not want him to leave even after the hurtful scene and the claim is only 10 miles away from the town up the mountain. The hero knows he really should go much further but can't bring himself to go further.Thus is the situation when the bounty hunter arrives. He goes and sees the heroine and she believes she manages to send him in the wrong direction and heads out herself to warn our hero.  She has now realized that whatever comes, she does not want to live without him and he also accepts that she is strong enough to share his life. Due to her stubbornness, the meeting between hero and his nemesis takes part. And here the hero does the growing, against her wishes, he confronts his demons and because it is a romance it has a HEA.I enjoyed the books so much, I immediately bought the sequel,Desperate Hearts, which is story of the bounty hunter and it promises to let the reader know how hero and heroine of this books are faring."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "12 4, 2011",
        "reviewerID": "A2A41ZRVMO8WG2",
        "reviewerName": "Book lover",
        "summary": "Very interesting!",
        "overall": 5,
        "reviewText": "Chloe Maitland is a very hard working young woman who tries desperately to save the house she inherited from her father from foreclosure. Except for the mortgage on the house, her father left her a smithy behind the house but Chloe can't work the shop by herself, neither can she find a blacksmith in the small town she has been living all her life, which is past the gold fever and in a desolate economic condition. Chloe advertised in a local paper for a blacksmith but nobody showed up since she can't offer anything else besides board and lodging.  Every day that passes increases her despair until one day a stranger arrives in her yard and breaks down  with a heat stroke - he read the add and applies for the position but right now he isn't in any position to help Chloe. Anyway, she patches him up and although she doesn't really want to hire him she sees no way out and Travis McGuire starts working for her. However, the coexistence between Travis and Chloe is anything but peaceful: she's strong-minded and bullheaded, he's insulting and relentless and the sparks fly!What a wonderful story! The plot started out a bit slow but was then elaborated into a beautiful love story that offered successful as well as entertaining twists and turns.Chloe was a wonderful heroine. Life sure wasn't nice to her and she tried to shield herself from further pain by raising an emotional wall around herself.  However, when she finally finds love she is willing to begin a new life even if this new start would offer her even less than she had until now in terms of belongings and securities.Travis was a very complex character who also suffered a lot during his life.  It was very interesting to observe that his initial \"disliking\" of Chloe's appearance and attitude changed into love and that he would have sacrificed his life for Chloe's safety. Absolutely adorable!By the way: there was a villain who was interesting  personality and somewhere a bounty hunter was involved and played a major role in the development of the plot.An absolutely recommendable book about real love and second chances in life!"
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "07 11, 2010",
        "reviewerID": "A24K04C8EDYYSN",
        "reviewerName": "Christina R.",
        "summary": "Great Western With A Strong Heroine",
        "overall": 5,
        "reviewText": "I love Historicals especially American ones.  In this one the heroine , Chloe, is a strong woman who must find a way to save her home.  She is outspoken, somewhat plain in apprearance, and hardworking.  I love all heroines who fit that description.This book was well written and the interaction between Chloe and Travis was terrific.  I would highly recommend this book.  But if you are buying the Kindle version be forewarned that it has a few formatting errors and misspelled words.  Not enough to bother me. but some people don't want any."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "09 6, 2010",
        "reviewerID": "AVQ85JKRT6WEG",
        "reviewerName": "Common Sense Colorado",
        "summary": "Another winner!",
        "overall": 5,
        "reviewText": "This is the second book by Harrington that I've read and I loved it just as much as the first one. Again, her characters are complex and interesting and her descriptions of the place and time really make you feel like you were there.I can't wait to read all of her other books too!"
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "09 22, 2012",
        "reviewerID": "A2I21GHJIS0YXJ",
        "reviewerName": "Irisrose",
        "summary": "Great characters",
        "overall": 4,
        "reviewText": "I'm just plowing through Alexis Harrington's books within a day or two. She writes with wonderful detail. This was a big improvement from The Irish Bride. Fantanstic development of Chloe and Travis and their relationship. But for the two villains, this would have been a 5 star story.It was clear from the introduction of Evan that there was something seriously wrong with him - I'm not certain how Chloe managed to be so blind to it having known him for months in the nosy, tongue-wagging town she lived in. That was just weird.Travis's nemesis, Jace, a bounty hunter, has been tracking him like a blood hound. Their confrontation ends up with a nice, tidy bow around it.Still, this is a worthy read and I would recommend it. Now on to \"A Taste of Heaven\"."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "11 24, 2010",
        "reviewerID": "A1XCSAX4BRT89Y",
        "reviewerName": "L. Burns \"Girl with the German Shepherd Tattoo",
        "summary": "A disillusioned ex-con and a lonely spinster - does it get any better than that? -- 4.5 stars",
        "overall": 4,
        "reviewText": "When Chloe Maitland's father dies he leaves her nothing but a heavily mortgaged home and the deed to a worthless mine. With no family to turn to Chloe is forced to make ends meet by taking in laundry, but her only hope of saving her home is to hire someone to get her father's old blacksmith business up and running. She can only offer room and board as payment and is about to give up hope in finding a candidate when a tall, slim, battered stranger makes his way into her front yard and promptly passes out.Travis McGuire has spent the last 5 years in prison and is being relentlessly hounded by a ruthless bounty hunter. With few other options he's willing to accept Chloe's offer of work, but his first impressions of her are not flattering. At first glance she appears to be middle-aged and worn; a spinster with a sharp tongue and rigid disposition.Both Chloe and Travis are people who are used to solitary lives and bitter disappointments. At 28 Chloe feels that her chance at love and passion was lost along with her youth and good looks. Travis's memories of heartbreak and betrayal by his faithless young wife haunt him day and night. There's no instant attraction, but somehow the two sense something, some kinship, that draws them to each other. Slowly and warily the two form a relationship, but romance is a bit of a minefield for these two guarded personalities.I suspected that I'd like this because it contains two of my favorite romance themes: People who have given up on finding love and a hero who has hit rock-bottom and is struggling to rebuild his life. I must say that the story exceeded my expectations. These two characters are vividly drawn and fully fleshed out - warts and all. You get a real sense of how hard Chloe's life was; how few options were open to her. Travis is a true tortured hero; a lost soul in need of redemption. The relationship plays out in a believable way and the author allows the sexual tension to build until the reader is just as anxious as the characters for that first physical contact. Very well done; very satisfying.Finally, while I know this is in no way the author's fault, the kindle version of this book is an absolute nightmare. There are major formatting problems with blank pages and awkward spacing, spelling errors galore and erratic punctuation. It's the e-book equivalent of reading a paperback with food stains and water damage. Too bad, because this is an excellent book. If you're stuck with the e-book version then I'd encourage you to try to overlook the shoddy presentation - it's worth the effort.No strong language and some fairly mild sexual content."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "09 8, 2012",
        "reviewerID": "A3QVW8NFY4C4I1",
        "reviewerName": "TBreakiron",
        "summary": "A very good western setting romance",
        "overall": 5,
        "reviewText": "Bought this book because I was a little intrigued by the premise and the price was very reasonable for a Kindle book.  Chloe was struggling to keep her house going and was need of a blacksmith.  Travis showed up after a long and difficult journey and promptly passes out.  Chloe reluctantly takes the man in and gives him shelter.  While not entirely trusting of Travis, she does give him the job.  Meanwhile she continues to live her life and try to hold on to her independence even though there is a gentleman or two would like to make her their wife.  In the meantime both Chloe and Travis' feelings for each other continue to grow.  Will they eventually accept what's growing between them and what happens when Travis' past catches up with him?  If you are a fan of romance novels in general this was an enjoyable book."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "01 10, 2011",
        "reviewerID": "ACQYIC13JXAOI",
        "reviewerName": "Tooncesmom",
        "summary": "Wonderful story. I guarantee you'll love it!",
        "overall": 5,
        "reviewText": "I'm still finding myself captivated by Ms. Harrington's stories and fine characterization. Homeward hearts is the fourth book I've read by her and I was as intrigued as with the other three.Homeward hearts is set in the Oregon of the mid-1890s. Since the town of Prineville is mentioned, I assume the dying mining town is set near there in the high desert. The story opens with a desperate Chloe Maitland seeking a man who can run her deceased father's blacksmith shop so she can pay the mortgage owed on her home. She can only offer room and board, and she hasn't found any takers. That is, until Travis McGuire staggers onto her property and collapses in her yard. With the aid of the town's doctor, Chloe gets the man inside and tended to, but he's not in shape to go anywhere, so she finds herself stuck with a very attractive but very ill patient.Travis is on the run from a bounty hunter, and he doesn't take to the sharp-tongued plain woman who seems curious about things he doesn't care to reveal. He's rude and outspoken, and Chloe wants him gone as soon as possible, however, after a tenuous week, she realizes she needs the help he can provide. Thus begins their fragile relationship, one not appreciated by the local schoolmaster who has designs on Chloe and her house.To tell more would give away this wonderful story which must be read and savored. Both Chloe and Travis carry heavy burdens, and how they work them out is the delight of this absorbing read. Each character is well-drawn and the dialogue just sparkles. Overcoming her mistrust of Travis is part of Chloe's growth process, while beginning to see her as a desirable woman is part of Travis's.I sat down to begin this book yesterday afternoon and finished it well after midnight. It was THAT good.Do yourself a favor and purchase this Kindle edition for the very attractive price of just $2.99.  You'll thank me for the tip."
      },
      {
        "asin": "B00318DBIG",
        "title": "Homeward Hearts",
        "reviewTime": "12 17, 2012",
        "reviewerID": "A32M93IJ6UY2R8",
        "reviewerName": "Trish",
        "summary": "Great  Read",
        "overall": 5,
        "reviewText": "I loved this western romance. Travis, who spent 5 years in prison for a crime he didn't commit, was a sweet and tender hero and Chloe was so tough but so giving. Evan, on the other hand, was a really sick puppy. I saw that coming when had his first \"headache.\"I do love this author and am about to reach the end of her  books :(...She needs to write faster.I do recommend this book to anyone who likes western romance. You won't be disappointed."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "01 6, 2013",
        "reviewerID": "A3IW7IOGFCEZ61",
        "reviewerName": "akhawk",
        "summary": "Very interesting book",
        "overall": 5,
        "reviewText": "Once you start reading, it's hard to put down.  I've enjoyed every one of the Alexis harringtomn books. Hope she continues with her writing. The book was nice and fun to read."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "03 5, 2012",
        "reviewerID": "A1JFAVCFID95WC",
        "reviewerName": "angela longstaffe",
        "summary": "Life's purpose, not always as it seems",
        "overall": 5,
        "reviewText": "Desperate Hearts, is the sequel toHomeward Hearts (Topaz Historical Romances), I loved the first book and on the author's website, it promises to catch up with the hero and heroine from the first book. And it did, just in the same way as Sabrina Jeffries links her books. We meet the hero and heroine and get a glimpse of their new life and the hope to see a former close friendship which was broken to become a close and deep friendship again.InDesperate Hearts, the hero is the bounty hunter who was after the hero ofHomeward Hearts (Topaz Historical Romances). At the end of the first book, our current hero knows he has made a mistake and sets out to rectify this mistake.He is not your average 6 foot something hero, he is small in size, 5.6\". Because of his size, he was picked on by other children as well as by someone he should have been able to depend on. He first picks up a \"wanted\" poster, I believe only to receive the money and with that independence from his tormentor. However, he is so good at it, people began to fear him and show him the respect he had craved as a child. When his sister is murdered, he believes the word of his stepfather that her husband and his best friend is the murderer. When a deathbed confession of the stepfather recants his original testimony and his brother-in-law and former friend is released from prison, he set out to catch him; we are never sure what he intended to do when he caught up with him as in this book, he states, he clearly prefers to hand villains over to the law. After the confrontation and now believing his former brother-in-law, he sets out to find the killer. The two years, he followed his brother-in-law and the year, he was searching for the real murderer, have been the only his focus in life. He is feared and constantly challenged by those who want to best him.The heroine catches up with our hero when he is confronting his sister's murderer. She is dresses as a lad and there are some bullies making fun of her. The hero who had expected to feel some kind of victory feeling, steps in. The heroine explains to him that she wants to hire him to help her gain her inheritance back which was stolen from. He really does not want to do it but she mentions a name, apparently the foreman on her ranch, who had been a friend of the hero. The person who stole her ranch also killed that friend.He finally agrees but makes it clear it will be done his way or not at all and that he will first go to see his friend to give him the news about his late wife's murderer. The hero is certain that the lad has not told him the full truth and waits for the other shoe to drop. While heading to the small town where our hero believes his former brother-in-law is, they are ambushed in a store and the lad is injured. Now, our hero knows that that Kyle is actually Kyla. While he is not amused, he grudgingly respects her.  When they arrive at his brother-in-law's home, where he wants the heroine to recuperate, they find it abandoned. Now the hero is forced to become close to the heroine by taking care of her. He does not want anyone to know that he is a she, as he has heard that her enemies are looking for her and for some reason also for him. Due to a nosy neighbor, they have to leave sooner than the hero wants; he wanted her to be in better shape.As they get to know each other better, he learns the reason why she is so good in her disguise as a lad.  He begins to admire her more and more but can't admit to himself that he loves her. He never knew a happy home life and feels it is way too late for him to think about one. It does not stop him of dreaming of one. The heroine, who has good reason to not trust men in general, slowly but surely falls in love with the hero and she hopes, she can make him stay once they have dealt with their enemies.It takes another near death experience of the heroine for the hero to take a job offer which would let him stay, one he had told her previously, was not for him.Again, the s*x scene were beautifully written, not shy, not flowery or clinical, just beautiful."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "06 13, 2011",
        "reviewerID": "A347Q760L12Y7V",
        "reviewerName": "Bettetoo",
        "summary": "Kindle killed it",
        "overall": 3,
        "reviewText": "The story is strong, moving and beautifully written.  It's an improbable (to start) love story between bounty hunter Jace Rankin and ranch owner Kyla Springer Bailey.  Kyla has lost posession of her ranch, and her innocence, to her step brother Tom Hardesty. He has a thing for brutal rape as is demonstrated more than once in the book. He is a member of the corrupt Vigilance Union.Kyla travels to find help disguised as Kyle, a snot nosed teenage boy with less than no manners. The constant changes from Kyla to Kyle are well written and realistic, as is her use of the Kyle persona whenever she feels threatened.The love scenes are touchingly real.  The adventure and danger are thrilling.My problem was that I bought the book on Kindle.  It was soooo badly transcribed to kindle format that it was hard to follow.  At one point Jace was kissing Kyle instead of Kyla!  Give me a break!  Buy the book.  Don't buy it on Kindle until they fix the mess the publisher made of it."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "02 16, 2013",
        "reviewerID": "A2PHUP1WN3IZPC",
        "reviewerName": "Disorderly Words",
        "summary": "Desperately flawed Kindle edition",
        "overall": 2,
        "reviewText": "I hate to give a book a low rating based on technological flaws instead of story, but in this case I believe that's the only reasonable way to handle the situation.First, let me say the story would be an enjoyable read were the Kindle edition not rife with technical errors. By the end, I was gritting my teeth and forcing myself to finish because of an attachment to the characters and their plight. That's the good news.Many other reviewers have commented upon the same thing that drove me batty: Missing words, sometimes entire phrases or partial paragraphs, caused frequent reading stumbles. The problem grew worse the further I read, until by the end, every page -- and sometimes every paragraph on every page -- resembled Swiss cheese.Normally, I excuse minor formatting errors in ebooks. Mistakes happen. Often, the publisher (or the author, if the book is self-published) discovers the problem and issues a corrected version as soon as possible. More than two years after its release, the desperately flawed Kindle version remains unfixed, and the glitches are anything but minor. Why? To me, such an oversight indicates, at best, a lack of attention to the market; at worst a callous disrespect for readers.I enjoy Alexis Harrington's work, but my disappointment with the completely fixable flaws in the Kindle edition was so severe I do not foresee investing in her future ebook endeavors."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "04 4, 2014",
        "reviewerID": "A73IK4VT0XZS6",
        "reviewerName": "Dorothy",
        "summary": "Love the era of the book...",
        "overall": 4,
        "reviewText": "Keeping her ranch was utmost in Kyla's heart and mind. However, her ruthless stepbrother made life miserable for her and took personal liberties that made her life fearful. She sought the help of a Bounty Hunter,Jace,who managed to bring peace to the town and countryside where Kyla lived. It was a long arduous journey filled with death and destruction that brought Kyla back home and introduced Jace to the ranchers.  This is one of my favorite authors and I re-read her books often. However, the editing is poor.  I find mistakes once in awhile in kindle books and move on; in this book it was disturbing as there were many errors.  Ms. Harrington is a wonderful storyteller and since this book has been on kindle for quite some time, I would like to see her correct this book."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "03 14, 2013",
        "reviewerID": "A11I6F72APCZEN",
        "reviewerName": "Hiding-out-with-my-Kindle",
        "summary": "Good romance - Enjoyed despite Kindle problems",
        "overall": 4,
        "reviewText": "I see the Kindle version is currently unavailable. I guess they pulled it to fix it (had occasional missing words, etc.). Oh, well. I was able to enjoy the story anyway. I'm an Alexis Harrington fan and I like most anything she writes. Desperate Hearts was no exception.I thought this book, all in all, was very well written. I liked the story, the leads, and the supporting characters, too. The danger/stakes seemed real, and nothing about the plot or the writing particularly pulled me out. In fact, the love scene in the shack really got to me for some reason. I rarely re-read a scene, but that one, I did. Like four times! LOL The only thing about DH that bugged me a little was the hero's change of heart/choice at the end. It seemed a little too easy and the ending felt a little rushed. But it didn't ruin the overall experience for me. I'm still glad I read the book.Good historical romance. 4 1/2 stars."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "11 3, 2012",
        "reviewerID": "A2I21GHJIS0YXJ",
        "reviewerName": "Irisrose",
        "summary": "Another enjoyable read",
        "overall": 4,
        "reviewText": "With her gift of rendering detailed characters and emotions, this is another good read by Alexis Harrington. Emotions, conflict and romance are at the forefront. A little predictable at times and my Kindle version had some jarring grammatical errors. Errors in grammer or spelling don't ruin the story in any way for me. I would recommend all of her books."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "09 2, 2010",
        "reviewerID": "A3HHXRELK8BHQG",
        "reviewerName": "Ridley",
        "summary": "Entertaining But Average",
        "overall": 3,
        "reviewText": "Jace Rankin may be short, but he's nothing to mess with, as the man who was just hauled out of the saloon by the undertaker knows now. He's a famous bounty hunter in Oregon in the 1890s who, when he shot the man in the saloon, just finished a years long quest to avenge his sister's murder and is now trying to figure out what to do next. When the snotty-nosed farm boy he just rescued from a gang of bullies offers him money to kill a man who forced him off his ranch, he reluctantly agrees to bring the man to justice, but not to kill him outright. But, first he needs to tell his sister's widower the news.Kyla \"Kyle\" Springer Bailey has been riding the trails and sleeping on the ground for the past month while trying to find Jace. She wants revenge on the man who killed her husband and took her ranch, amongst other crimes, and she's not so keen on the detour Jace wants to take. But she realizes she's out of options, so she hides behind her boy persona as best she can and tries to keep pace. When a confrontation along the way gets her shot and Jace discovers that Kyle's a Kyla, she has to come clean about the *whole* reason she needs this scoundrel dead and hope he'll still help her.The book has its share of touching moments and slow-blooming romance. Kyla, we find out, has good reason to fear men and hide behind a boy's persona. Watching Jace slowly pull her out of that shell and help her conquer her fears was endearing. Her pain was real and deeply-rooted and didn't just disappear in the face of his sexiness. Neither did his understandable aversion to marriage magically disappear after a round of nookie. Why would a man who's drifted from town to town for his entire adult life - a man who's killed his fair share of men along the way - feel he'd make a good husband or father? They're both the walking wounded and in a unique position to help each other, they just need time to realize it.However, while it was packed to bursting with my favorite themes - Old West setting, a heroine passing as male, a morally ambiguous hero, wounded souls, road romance, the kitchen sink - there was a certain...distance in the writing that kept me from getting carried away. Both characters were distinct and fully-formed and I couldn't point to any glaring instances of bland telling or anything, I just never felt really invested. I enjoyed it quite a bit, as it was an exciting trip, but I was watching them from far away. I definitely wasn't on the run alongside them. Add on a hasty and too tidy ending, and the book left me feeling a bit less than completely satisfied.I enjoyed the book, but I can't say it was above average. I'd still read another book by the author.Note: I read the re-released ebook version and noticed there were a lot of formatting errors and missing words. I had to mentally edit as I read for some sentences to make sense. It wasn't too too bad, but it was a little distracting."
      },
      {
        "asin": "B0033UV8HI",
        "title": "Desperate Hearts",
        "reviewTime": "02 21, 2013",
        "reviewerID": "A32M93IJ6UY2R8",
        "reviewerName": "Trish",
        "summary": "Awesome..",
        "overall": 5,
        "reviewText": "LOL.. I loved when Jace found out that Kyle was actually Kayla. Great scene. Wonderful book. I've read all this author's books and loved every one of them. She has such a great way with words and storylines. HOWEVER, she will have to write a little faster. Can't wait for her next 100 books."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "12 23, 2011",
        "reviewerID": "A170IYJVHHWSIQ",
        "reviewerName": "Cindy Wain \"Cindy",
        "summary": "Score for Harrington!",
        "overall": 4,
        "reviewText": "A Light For My Love was a wonderful romance from Alexis Harrington.  I have enjoyed all her books.  This wasn't my handsdown favorite, but it was good.  I read other reviews saying that it was slow and the heroine, China was annoying.  She was a little hard on Jake, but she did have a valid reason to be.  The adoration Jake has for China is intence.  The chemistry is wonderful.  Things I wish had been explored more:  China's brother Quinn, Mr. Williams, and Susan (I don't want to be a spoiler, so I will not give any further detail).  Those characters I feel got cut short.  Overall, I really do think it's worth the time to read.  I have to give a shout out to her best \"Harper's Bride\".  I can reread that over and over!"
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "03 11, 2011",
        "reviewerID": "AVQ85JKRT6WEG",
        "reviewerName": "Common Sense Colorado",
        "summary": "Wonderful characters",
        "overall": 5,
        "reviewText": "Like all of Alexis Harrington's books, this ones is full of wonderful characters and vivid descriptions. A Light For My Love takes place on the west coast during a time of sailing ships where shanghais are common. Harrington does a great job of making the reader understand the period and the events of the time. I think this is the first book I've ever read regarding this subject, it was an added bonus to learn about a part of history I didn't know before.Also like her other Kindle books though, the formatting leaves a bit to be desired. She needs to do more thorough proofreading after the OCR. This one isn't as bad as some of her others."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "11 27, 2013",
        "reviewerID": "A11I6F72APCZEN",
        "reviewerName": "Hiding-out-with-my-Kindle",
        "summary": "Not her best work",
        "overall": 3,
        "reviewText": "This is one of my least-favorite books by Harrington. It wasn't bad--even Harrington's 'bad' would be better that most authors' 'good'--but A Light For My Love didn't grab me and hold my attention the way her other stories have. I suspected it was one of her earlier works, and I was right. Still, Homeward Hearts, released before this, was quite good.The writing is professional and rich, and the characters are well drawn. The problem I had with A Light For My Love was the fact that the plot seemed to drag in places and the heroine was irritating at times. I got as frustrated with her as did Jake.There is also a scene in which the heroine has information about something, but chooses to wait and look at a confirming characteristic at a later time. (Sorry. I know that's vague...trying not to be a spoiler.) I didn't buy it. In her place, I would have looked at it as quickly as I could. The author should have had Jake leave out that piece of information and then have China discover it later, on her own. The detail in question would have been self-explanatory, and it would have ramped up the emotion in one of the final scenes.Bottom line, this story is in need of some tweaks and a good trim. It wasn't a bad book; I did finish it and I mostly liked it. But if this is your first sample of Alexis Harrington, you should pick something else and try her work again. 3 1/2 stars."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "02 29, 2012",
        "reviewerID": "A3U41P3MHAEXYU",
        "reviewerName": "L. Sims \"Linda",
        "summary": "A WONDERFUL ROMANCE",
        "overall": 5,
        "reviewText": "China had a fairly privileged and spoilt upbringing, her Father was away a lot as he was a sea Captain. Her older brother insisted on being best friends with Jake, a rough lad from the poorer side of town. Then when she was eighteen her brother decided that he was going to follow Jake and go to sea. No amount of pleading from her would change his mind, she blamed Jake for this. In China's mind Jake's influence on her brother was strong.Eight years later China's fortunes have radically altered her Father has died penniless, so China has been forced to take in boarders and sell furniture and pieces of her mothers jewellery. Then Jake suddenly returns, only this time he is a sea captain and owner of his own ship. To her horror her aunt who also lives with her has rented a room to Jake, China wants to return his money, but her aunt has already used it to pay the outstanding bill with the grocer. Now China is forced to suffer Jake's presence in her house, and just because he is tall blond with green eyes and a pleasure to look at does not mean that she has forgotten that he is a kown womaniser. But most of all she will never forgive him for taking her brother away.This is another excellent novel from this author, the characters are so believeable and well drawn. I loved Jake he is a very honourable man and not really guilty of half the things that China accuses him of. China is so blinded by her prejudice against Jake, especially about her brother, it takes her time to see the real man. The secondary characters added an extra dimension and flavour to the story. The detail of the period in history is excellent. I have read a few books by this author, and  her writing is well paced and balanced, and her research for whatever period in history she writes about is second to none IMO. A highly recommended read."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "06 30, 2014",
        "reviewerID": "A1RWP4F3GGD43F",
        "reviewerName": "sallygulf",
        "summary": "Heartwarming and fun !",
        "overall": 5,
        "reviewText": "Beautiful story - Alexis Harrington always has a very interesting plot with unexpected results."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "12 26, 2012",
        "reviewerID": "A32M93IJ6UY2R8",
        "reviewerName": "Trish",
        "summary": "Loved it!!",
        "overall": 5,
        "reviewText": "With the holidays and all it took me a while to read this, but it wasn't from lack of interest. I just loved Jake and after China realized money wasn't everything and that she loved Jake she was pretty special. Aunt Gert and Cap added a lot to the story but Susan was a little whacked but interesting.Over all it was a great story and I enjoyed every minute of.On another note: The poster who gave this book 1 star leaves a little bit to be desired. She posted it in July of 1999 and has not posted ANYTHING else. Off hand, I'd say she really didn't read the book and that has to make a body wonder WHY she posted it at all.  I'm just sayin'.Whenever I see a lot of 4 and 5 stars and one or two with 1 star I go directly to the bad reviews to see what they have to say. If it's only a few words I immediately ignore that post."
      },
      {
        "asin": "B00368B6QU",
        "title": "A Light For My Love",
        "reviewTime": "07 17, 2012",
        "reviewerID": "A26WPSB3TPPTEL",
        "reviewerName": "Valerie R. Macaluso",
        "summary": "A Light For My Love",
        "overall": 5,
        "reviewText": "This book gets you from the beginning.  The author brings in so many dimensions from that time period.  I love learning a bit of history with my romance.  It has subplots which keep you going. Great read."
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "09 6, 2012",
        "reviewerID": "A3IW7IOGFCEZ61",
        "reviewerName": "akhawk",
        "summary": "Montana Born and Bred",
        "overall": 5,
        "reviewText": "Loved it. Excellent. I enjoyed every minute of the book. Hope you have more books by this author....I'm sure that you must have MORE?"
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "05 1, 2013",
        "reviewerID": "A3LGIK3UBNUSR7",
        "reviewerName": "Bernadette",
        "summary": "Where's the Heart?",
        "overall": 3,
        "reviewText": "I have enjoyed Ms Harrington's work in the past and read almost everything she has written, but this book I found lacking in the warmth she had in her previous books.The baby did nothing but squal all the time, and the romance was trite. There was sex, but the passion was missing.I wish she'd get her groove back."
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "06 13, 2011",
        "reviewerID": "A347Q760L12Y7V",
        "reviewerName": "Bettetoo",
        "summary": "Another good Alexis Harrington",
        "overall": 5,
        "reviewText": "Unlike some reviewers, I don't think you want the whole story in advance.  Let's just say that Sarah has an out of wedlock child (Danny) by a piece of slime named Ethan.  Why?  Well he seduced her; that takes care of her side of the story.  But Ethan only bothered seducing her to provide a child for his wife, Priscilla.  That woman is a real piece if work!Bounty hunter Zach is an orphan from New York City who got the short end of the stick in his adoption from the orphan train. He hunts our heroine down for Ethan in order to get his ranch back. It's convoluted, but still realistic.  Ethan has his sticky paws in a lot of different deals.It's a nicely developed love story with the requsite love scenes well written.  It has quite a few twists and turns to keep it interesting.  All of the characters, from children through adults, are fully fleshed out people of interest.It's a keeper!!!!"
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "03 25, 2013",
        "reviewerID": "A2EKN4RQZYTPVF",
        "reviewerName": "Cat",
        "summary": "Alexis Harrington......",
        "overall": 5,
        "reviewText": "I love all of your novels. I am so ready for another one!!! The heroine in this novel is a fantastic woman who reminds me of myself. She stands up for what is right even though it means losing everything she loves!!!!"
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "07 10, 2013",
        "reviewerID": "A2YGZ5HH8NQ1Q8",
        "reviewerName": "Deborah Camp \"Author of more than 50 novels. ...",
        "summary": "Another Winner by Harrington",
        "overall": 5,
        "reviewText": "If you haven't read this one, then you're in for a treat. Very well told story of two people rising above their mistakes in life and grabbing onto what really counts in life. The main characters are interesting and complex. The situation is intriguing and there are several &#34;baddies&#34; who are well drawn and, of course, add danger and drama to this story of wounded hearts healed by the power of love."
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "11 21, 2000",
        "reviewerID": "AFVQZQ8PW0L",
        "reviewerName": "Harriet Klausner",
        "summary": "Great read by a real talent",
        "overall": 5,
        "reviewText": "In 1890 Lame Horse, Montana, Zach Garrett arrives to escort Sarah Kincaide and her son Danny back to Helena. Sarah signed a contract with wealthy Ethan Pembroke in which the single schoolmarm gave up her newborn in exchange for some money. Ethan and his wife Priscilla plan to adopt the infant. Zach, who believes he has no conscience, thinks Ethan is being charitable.Sarah realizes her quest to hide with her beloved Danny is over. On the trail, she thinks back to when Ethan courted and seduced her, a naive teacher. She thought they would marry and even gave him access to her bank account, which he stripped bare. When she told Ethan she was pregnant, he, accompanied by Priscilla, explained the trap they set for her. They offered her cash and her reputation plus a home for the child. Sarah signed the contract, but fled with Danny three days after the lad was born. Meanwhile, Zach feels two new emotions, guilt and love, but still feels he must complete his obligation to Ethan.MONTANA BORN AND BRED is an entertaining and exciting western romance starring two wounded characters healed by love. The story line is very exhilarating especially on the trail, but the ending is a major stretch. The lead couple is a pleasant duo healing through love. Alexis Harrington has written a thrilling western romance that sub-genre fans will fully enjoy. Readers will get lost into the fantasy.Harriet Klausner"
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "03 14, 2013",
        "reviewerID": "A11I6F72APCZEN",
        "reviewerName": "Hiding-out-with-my-Kindle",
        "summary": "Not her best, but not a bad read",
        "overall": 3,
        "reviewText": "I enjoyed this book for the most part, even though it's not my favorite from this author. The writing is good and the leads are likeable. Some parts of the plot felt a little farfetched, and the twist with the villain's wife and her maid left me with unresolved questions, but I still enjoyed the story. I assume the author added that twist to show the how the villain's greed caused him to overlook things and, in the end, increased his ultimate humiliation. But, as I said, it left me feeling like something was not totally explained.Anyhow, although I wouldn't suggest that you start with this book if you've never sampled Harrington's work -- maybe start with Harper's Bride or Homeward Hearts -- I still think this one is worth the read. 3 1/2 stars."
      },
      {
        "asin": "B0039UUSZK",
        "title": "Montana Born and Bred",
        "reviewTime": "12 13, 2012",
        "reviewerID": "A32M93IJ6UY2R8",
        "reviewerName": "Trish",
        "summary": "WOW..",
        "overall": 5,
        "reviewText": "What a great book. And what a horrible childhood Zach had.Sarah and little Danny were terrific...and Pembroke was such a creep!The whole storyline a was great and the sex was so fine and delicate, I loved it.On another note I would like to say that the person who gave this story1 star did so in 2001 and has no other reviews under her name. So, I would take THAT review with a grain of salt."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 16, 2011",
        "reviewerID": "AQA2EYX7UIICD",
        "reviewerName": "Barbara R. Farber \"I eat Books",
        "summary": "You won't be Betrayed!",
        "overall": 5,
        "reviewText": "I loved this book from start to finish, the characters are well formed, the period description is perfect.  Don't pass this one up!! I love knights in shining AMORE!!!"
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "03 10, 2014",
        "reviewerID": "A3LGIK3UBNUSR7",
        "reviewerName": "Bernadette",
        "summary": "Fairly Typical",
        "overall": 4,
        "reviewText": "This was a good book, but fairly typical for that time period. I think the book would have been better if the reading audience had not known about the other baby and only found out when the H discovered it."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 18, 2014",
        "reviewerID": "A2G1XB9J4IHNVJ",
        "reviewerName": "Book Addict \"Book Junkie",
        "summary": "A lot of loitering in the woods",
        "overall": 4,
        "reviewText": "Betrayal is the story of Lady Katherine whose castle is besieged and so she rides to get help from the man she once betrayed. De Lauren is her one true love but she jilted him for another man, just two weeks before the marriage. De Lauren still loves Kate but can't trust her. When the newly widowed Kate comes to him for help he agrees but the price is that she marries him...so he can take his revenge.Betrayal is a story about suspicion and the strength of love. On many levels it is very clever, pitching the love of a man for a woman, against the love of a mother for her child. The plot moves along at a good pace, with believable settings and characters. I did get a little frustrated that Kate didn't come straight out and tell de Lauren she had a child - because this could have avoided a lot of trouble (but there, again, the answer is in the reason) and I did get a tinsy bit annoyed with Kate for repeatedly drugging the knights protecting her, or else knocking them unconscious with blunt objects. (Reason being she wanted to shake them off to visit her hidden son.)All in all a good romp of a read which I enjoyed. The good points far outweigh the slightly dodgy aspects and I'd consider other books by the same author."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "11 19, 2006",
        "reviewerID": "AFVQZQ8PW0L",
        "reviewerName": "Harriet Klausner",
        "summary": "fun historical romance",
        "overall": 4,
        "reviewText": "In 1122, William Norris dies in combat after betraying an ally.  He leaves behind his pregnant wife Lady Katherine Stanfield, who would prefer the odious man, went to hell, but for the sake of her soon to be born child she gives him a Christian burial.  Less than two weeks later, Katherine gives birth to twins with her daughter dying in childbirth.  At about the same time Lord Ranulf invades the keep with plans to make Katherine his wife.  She flees leaving behind her dead child so Ranulf will not know that a son lives.Her loyal Commander Sir Guy takes her son into hiding while she asks her former betrothed De Lauren for help.  He agrees on the condition she marry him right then.  He retakes Stanfield keep, but the slaughter of innocent people and the destruction of property are horrifying.  De Lauren buries her daughter because he does not want the woman he loves but mistrusts to see that Ranulf decapitated the infant.  As Katherine realizes she too loves her spouse like she did when she broke off their engagement five years ago, Ranulf plots to assassinate De Lauren and make sure his enemy's loyal brother Stephen thinks Katherine betrayed them again.Though Ranulf is a too over the top psychopath (asks his late wife as he literally bled her dry), medieval romance readers will welcome this fine twelfth century tale more so because of the hero, who seems so realistic especially his code of justice.  The excitement in the entertaining story line resides in anticipating the confrontation and learning why Katherine broke off with De Lauren and defied her father to marry an odious Norris.  Karen Fenech writes a fun historical romance.Harriet Klausner"
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 7, 2014",
        "reviewerID": "A2KFRHUU6XTIHO",
        "reviewerName": "Jan Hynum \"twidget",
        "summary": "Betrayal by Karen Fenech",
        "overall": 5,
        "reviewText": "Another book that will keep you interest until the end.  It was lengthy which I like and I lay awake reading until the wee hrs in the morn.  I am 87 yrs young, and this kept me so involved in it.  If you like a book historical, romance and suspense you will read this and put a review in.  It was fantastic and riveting.  Jan"
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "03 29, 2014",
        "reviewerID": "A3MSI4YLWOJNM4",
        "reviewerName": "KimBerly Addison",
        "summary": "Good Story",
        "overall": 4,
        "reviewText": "I liked this book, interesting story with lots of suspense. Well paced story that had me guessing at times, and I really liked the characters, very well defined.  All in all, I'm glad I read it."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "03 23, 2014",
        "reviewerID": "A1K1P8Y3LO20AZ",
        "reviewerName": "K. Pilon",
        "summary": "Nice, fairly complicated plot",
        "overall": 5,
        "reviewText": "I liked this book a lot, not only because it gives you insight into the historical time, but the plot is more complicated than most. The characters are almost believable."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 24, 2014",
        "reviewerID": "A2EE1UV2NXG5OL",
        "reviewerName": "Monikle",
        "summary": "Review of Betrayal",
        "overall": 5,
        "reviewText": "This is an excellent story with a great plot,excitement, and romance.I would recommend this to anyone who enjoys historical romances."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "03 29, 2014",
        "reviewerID": "A1RJDG0BXW7LHP",
        "reviewerName": "oldaddy \"oldaddy",
        "summary": "IT WAS OK",
        "overall": 4,
        "reviewText": "THE AUTHOR DID WELL WHEN IT CAME TO THE MIXING OF FICTION WITH HISTORY. HOWEVER, SHE WOULD MAKE ABRUPT CHANGES AND SIMPLY BOTH STOP WITH ONE OF HER CHARACTER AND THEN START WITH ANOTHER. IN THIS MANNER, I WOULD HAVE TO REVIEW THE PAST CHAPTER(S) IN ORDER TO HER A CLEAR VIEW OF THE OBJECTIVES OFHER CHARACTERS. OTHER THAN THAT, I FOUND THE AUTHOR'S ABILITIES SATISFACTORY. THANKS FOR YOUR ATTENTION."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 20, 2014",
        "reviewerID": "ARV89XTELFH7",
        "reviewerName": "Patricia A. Webb",
        "summary": "It's okay, not my usual read.",
        "overall": 3,
        "reviewText": "Am reading it now.  It's okay.  The story line is not too empressive.At least the grammar is good, I assume it is early United Kingdom area."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "01 22, 2014",
        "reviewerID": "A1WM8S5TSUO07M",
        "reviewerName": "Patricia Shippee",
        "summary": "Interesting read",
        "overall": 5,
        "reviewText": "I enjoyed this story from beginning to end..Suspenseful and romantic. What I most enjoyed  was NOT having to skip  pages of overly explicit sex."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "03 3, 2014",
        "reviewerID": "AKMNK9Z5LSIF5",
        "reviewerName": "Ronnie",
        "summary": "Good story",
        "overall": 4,
        "reviewText": "This story was good. If you are looking for a lot of hot steamy sex scenes, this is not for you. I don't need that in a story and so I enjoyed this one. The story was pretty predictable, but still good, and at a steal of a price."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "01 12, 2014",
        "reviewerID": "A3LLMXR3QJR60T",
        "reviewerName": "Tassy",
        "summary": "a good read",
        "overall": 5,
        "reviewText": "A very good tale that held my interest to the very end.  No skipping over pages that were boring or filled with endless descriptions of sex.  It is a story of a courageous woman trying to save her newborn son( his twin was stillborn) and her castle.  An evil man lusting for power causes much harm.  Her new husband who has loved her for many years saves her, her infant, and her castle.  I liked this book very much and would not hesitate to buy another book by Karen Fenech."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "02 11, 2014",
        "reviewerID": "A2RJVDKXZVOWBE",
        "reviewerName": "treaves",
        "summary": "Romance and Action!",
        "overall": 4,
        "reviewText": "Throughout the entire story, I was hoping the main characters would make it through all their trials and tribulations.  I could hardly put the book down until they were together!  I liked the historical aspects of the story as well.  I would recommend this book to anyone who likes historical romances."
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "01 29, 2014",
        "reviewerID": "A11AE5WPQYAMN9",
        "reviewerName": "T. Whittaker \"t.whitt",
        "summary": "Very good",
        "overall": 5,
        "reviewText": "Definitely a page turner what happen at the end that would of being really great to know what happen in the end"
      },
      {
        "asin": "B003U4W4YS",
        "title": "BETRAYAL",
        "reviewTime": "01 22, 2014",
        "reviewerID": "A2HOBVQG02B5FE",
        "reviewerName": "yves",
        "summary": "BETRAYED!!!I g",
        "overall": 3,
        "reviewText": "I gave this book a 4rating because it was a good book.  However, there were things that I felt the author left out that are important for me to know.  For example, the age of the h/h, eye color of the heroine, hair color of the hero.  Those are details that I find very important because that way I can better identify with the characters in a book.  Also I felt that the ending was incomplete because of the lack of the epilogue and because there were many things that were unanswered with the other characters that I would have liked to have happened or Known if they would have happened.  There was just no closure after having read the end, the ending left you wanting.  Oh last but not least, the love scenes between the h/h were blade, because I expected that when they made love for the first time, it would h ave been a very passionate union because of what they had been denied in the past."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "07 13, 2014",
        "reviewerID": "A2UE9D1TQ3XGUH",
        "reviewerName": "",
        "summary": "Avoid the audio- Read it in print!",
        "overall": 5,
        "reviewText": "Loved it! So much fun! A total page-turner with a little humor tossed in. It's more complex than your average cozy mystery but not as dark as your average spy thriller. It's a nice combination of the two. I loved Lexi and all the other characters. I can't wait to see them all again in the next book and am curious to see which of her many potential suitors she ends up with. On a side note, avoid the audio book. I tried listening to it but the reader was just so wrong for the book. It's far, far superior in print."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "05 4, 2013",
        "reviewerID": "A50FCMA1VA5QB",
        "reviewerName": "abairdgal",
        "summary": "Great Read",
        "overall": 4,
        "reviewText": "Although there were times hordes of information were thrown at the reader (I had to re-read a few paragraphs along the way), the novel contained superb character development and a thoroughly devised plot line that had no holes. The characters were charming and quirky creating a comfortable atmosphere for a quick but suspense ridden story.Definitely recommend this book!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 30, 2013",
        "reviewerID": "A513XIGZQV94V",
        "reviewerName": "Always In Pumps",
        "summary": "Good start to a series.",
        "overall": 4,
        "reviewText": "Lexi Carmichael is somewhere between Stephanie Plum and Lexi Graves. She is a super smart hacker geek with no social skills whatsoever. There are a few guys that like her - 'good' guy Finn, 'bad' boy Slash, and 'geeky, super genius Elvis. I like how the author took the time to build the characters but at time the social awkwardness Lexi possesses make me cringe to the point of unbelievable. The storyline is interesting to see how the mystery pulls Lexi away from her computer and has to interact with real people. I am also a fan on how she pulls in some math equations to her sleuthing. Overall a good start. I will keep reading the series as I'm interested to see how this plays out and hope the Julie Moffett can keep an interesting storyline."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 5, 2013",
        "reviewerID": "A351CT1QP6QP0G",
        "reviewerName": "Amazon Customer",
        "summary": "Light, fun and thoroughly enjoyable!!!",
        "overall": 5,
        "reviewText": "Fun frolic. A good read. Well plotted. Interesting characters.I look forward to the next adventure with Lexi and her pals."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "07 8, 2013",
        "reviewerID": "A3L76C4T2MF3GZ",
        "reviewerName": "Amazon Customer",
        "summary": "No one lives twice",
        "overall": 5,
        "reviewText": "I thought this book was funny and intriguing. It was a suspenseful  and a little romantic. I'm looking forward to sequel."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "02 16, 2014",
        "reviewerID": "A2N8MVPYE0T6MZ",
        "reviewerName": "Amazon Customer",
        "summary": "Hard to put it down..",
        "overall": 4,
        "reviewText": "This was a fast-paced and fun book, with interesting, likeable characters.  The story line was fresh and not totally predictable, although it was a bit far-fetched (hence 4 instead of 5 stars).  I will most definitely read others in this series!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "08 8, 2013",
        "reviewerID": "A2JY7ZK7SO9WJH",
        "reviewerName": "Amazon Customer",
        "summary": "No One Lives Twice",
        "overall": 5,
        "reviewText": "What a great series!  Yes, I am a computer geek...but anyone can enjoy the characters in these books.  If you like Janet Evanovich, you'll appreciate the humor, light suspense and romance.  Great read!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 17, 2013",
        "reviewerID": "AJFEFWCSM9EBS",
        "reviewerName": "Amazon Customer \"rapid reader",
        "summary": "Geek girls rule",
        "overall": 5,
        "reviewText": "Especially the uber mathematician Lexington Carmichael. A fun story with lots of twists and turn. Take it for a spin."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 19, 2013",
        "reviewerID": "A1I6BG5XRGOUJJ",
        "reviewerName": "Annie Athens",
        "summary": "Not A Good Read",
        "overall": 1,
        "reviewText": "It's  rare for me not to finish reading a book, even if I do have to skip through the last few chapters. Unfortunately in this case I couldn't get past the first third of the novel.  I downloaded the book for free,  and I certainly would have been most disappointed if I had purchased the novel.. The whole writing style is most immature and I could find nothing appealing in the heroine. Maybe a younger reader would enjoy but I wouldn't recommend to mature readers."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 24, 2013",
        "reviewerID": "A2AA3FRU9RDZ0R",
        "reviewerName": "Annie",
        "summary": "No One Lives Twice",
        "overall": 5,
        "reviewText": "I chose this rating because it kept me on the edge. Every page had me thinking. This was my first mystery."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "09 9, 2013",
        "reviewerID": "A2B3ZOK9X4GY5S",
        "reviewerName": "Ardie Steinbronn",
        "summary": "Loved it",
        "overall": 5,
        "reviewText": "This is an Awesome Series its funny .. sometimes scary and once I started reading it I couldn't put it down ..."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "06 8, 2011",
        "reviewerID": "A3D14ZWK8UOBHA",
        "reviewerName": "A Reader in the Mitten \"Blue Crab Books",
        "summary": "Fast & Fun",
        "overall": 4,
        "reviewText": "The first page hooked me right into the story, and the twists and turns, quirky characters and fast action, plus some laugh-out-loud humor, guarantees a good, solid read. Lexi, computer geek, sets off to help a friend and discovers that such excitement might just get her killed. No spoilers here, but if you like a twisting plot and a bit more development than Evanovich, this book's for you."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 6, 2013",
        "reviewerID": "A29ESW4TJ6I2GM",
        "reviewerName": "Betteboop",
        "summary": "thoroughly enjoyable",
        "overall": 4,
        "reviewText": "I started this book because I liked the idea of a \"female\" James Bond....but Lexi wasn't that at all.....but she could be!  Her innocent charm and brilliant mind, could make her a real threat in the world of espionage.  I think that Julie Moffett created a delightful character who could be any of us....well, if we were 25 years old and an incredibly tall female geek.  The new men in her life seem like really nice guys, even if they are not the regular ones you might meet in a bar (I never hung out in bars, I'm just guessing)They're gorgeous, smart and sensitive.....in other words, not real. But they are good counterparts to Lexi and her coming out in the world. I use the term coming out in the old-fashioned sense of having been naive but learning the ways of the world.The story was well presented to be believable and the characters had substance: I liked them.  There were places where I actually laughed out loud. The humor was well mixed into the story line.A very enjoyable book. I plan to read more of Lexi's stories."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "04 15, 2014",
        "reviewerID": "A19NQUINOBMV03",
        "reviewerName": "Book Babe \"book babe",
        "summary": "Loved It!",
        "overall": 5,
        "reviewText": "Absolutely loved this book!! I loved the concept of a geek girl getting involved in all kinds of intrigue and of course all the men she gets to meet. Fun and entertaining right from the start. Lexi is an awesome character and I look forward to reading the next books in the series. Don't miss this!!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 3, 2013",
        "reviewerID": "A2R4MQKLGFIVXD",
        "reviewerName": "bsparky",
        "summary": "A fun read that will leave you wanting more.",
        "overall": 5,
        "reviewText": "I loved this book!  This is a great series and I cannot wait to read the next one. Lexi and her crew were a fun bunch and I'm glad their adventures will continue."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 24, 2014",
        "reviewerID": "A3VCUNJ8OKI106",
        "reviewerName": "Cc",
        "summary": "Interesting...",
        "overall": 4,
        "reviewText": "Never read a book with so much technology based background in a mystery about government agencies.  Figured out a lot of it as we went along,but am looking forward to the others in series"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 11, 2010",
        "reviewerID": "A2XNOB1T796Y6B",
        "reviewerName": "ChibiNeko \"Sooo many books, so little time!",
        "summary": "A fun new addition to the CP lineup!",
        "overall": 4,
        "reviewText": "Longing for a bit of the old James Bond type thrillers? Want something with a little chase to it? Would you like to see a geeky girl on the run to stop the bad guys? If you answered yes to any of those three questions then you'll probably like this book.Readers of romance & fans of books similar to The Givenchy Code will enjoy this book. (It's not identical to TGC, but similar enough to where it reminded me a little of it.) Lexie Carmichael isn't the brightest computer geek out there, but she does have a lot of heart & determination to her that will endear her to most readers. You'll also love the variety of men in the series. It's pretty easy to determine who the main players are for Lexie's heart, though. Even so, the book is easy to read & the story's twist (which I'll admit I didn't entirely see coming) makes this a pretty fun read overall.The only drawback? Well... for a girl that's supposedly smart enough to get into the NSA for her hacking skills, Lexie doesn't really show them off that much in this book. That might change in the next few books, but for right now we the only \"hacking\" we see Lexie doing is her talking to a supposed hacker in the beginning of the book. She's also not exactly savvy when it comes to avoiding stupid actions, but at least Moffett has Lexie calling herself out on this at various points in the book.Overall though, this is a pretty enjoyable read. It's a nice fluffy story that will be sure to please romance fans looking for something with a little thrill to it. I have to admit that it was better than I was initially expecting it to be & I'm curious enough to read the next book in the series.(ARC provided by NetGalley)"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "05 24, 2013",
        "reviewerID": "A1SYMBNYSKZEW9",
        "reviewerName": "Christy",
        "summary": "A Whole Lot of Action",
        "overall": 5,
        "reviewText": "What happens when you take the NSA, FBI, and a whole slew of other agencies and throw them in the middle of a missing person case ?  Chaos !  Then add in three cyber tech nerds Lexi, and the twins and it goes out of this world.  I loved this book.  Lexi's bestfriend goes missing after sending her some documents to hide/keep.  This is where everything go to you know where in a hand basket.  Lexi meets this super hot lawyer named Finn,  this super hot Italian superhacker who has FBI agents for proection and carries a gun named Slash, and lets not forget the guys trying to kill her and all she wants is a Diet Coke.  I could not put down this book and immediately bought the next one.I would recommend this for anyone who loves Stephanie Plum or Brandy Alexandra books :)"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 20, 2014",
        "reviewerID": "A3VJBZID4QYTSA",
        "reviewerName": "c-lu",
        "summary": "Fun Read",
        "overall": 4,
        "reviewText": "This was a fun read and Lexi is a great character.  She works for NSA, a secret that is not so secret since almost everyone in her suburb seems to work there. But she isn't the usual type one thinks of when envisioning someone at NSA - she is a computer geek.  Lexi is held at gunpoint, kidnapped, her apartment trashed, her privacy invaded despite new security, and then befriended by the person who asked Lexi's BFF to translate a document.  It all comes together with twists and turns, a chuckle or two, and lots of possibilities.  This is the first in the series and I will definitely read the other three already published: No One to Trust, No Money Down, No Place Like Rome.  All are now on my TBR list.This review was posted initially on Christa Reads and Writes (christanardi.blogspot.com)"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 10, 2013",
        "reviewerID": "A3EFLRQ8WRJ2AM",
        "reviewerName": "Ctv",
        "summary": "Loved it",
        "overall": 5,
        "reviewText": "This book is funny, and has a good mystery and a hint of romance.  The characters are very likable and connects to the readers.  This has become one series that I am looking forward to."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 14, 2013",
        "reviewerID": "A2DQWWJ2HYR5C0",
        "reviewerName": "Dannette Elaine Calderin \"Write on, right now.",
        "summary": "A good read",
        "overall": 4,
        "reviewText": "When I first started reading this I thought \"great, another Evanovich wannabe. But I hung in...and it was worth it. There are things in here that are absolutely wrong (an NSA agent that cannot use a cell phone, especially a white hat hacker?!!) But the story was good, the characters interesting and I ended up enjoying it despite the Bill white moments. Give it a try."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 26, 2013",
        "reviewerID": "A2Q8B7JPI4LAKL",
        "reviewerName": "Debra A. Johnson",
        "summary": "Guns, Spies, Hot men",
        "overall": 5,
        "reviewText": "This book was awesome. I really enjoyed reading this book and getting to know the characters evolved. I am so glad I gave this author a try. I look forward to the next one in this series. High Fives to this series and to the author."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 28, 2013",
        "reviewerID": "A7N1JRLTA65IE",
        "reviewerName": "Doc",
        "summary": "Long Live The Geek",
        "overall": 5,
        "reviewText": "Nice change from the traditional format.  I would call it Big Bang meets Scooby Doo while channeling Numbers.  Don't get me wrong that is not a bad thing.  A retired educator and IT pro I enjoyed the book tremendously.  Yes it was apparent this was a departure for this author but it works.I found the characters engaging and can see a long running series for this heroine.  The father of two geeks and a bit of a geek myself I could relate to the characters.  I can also see how some would have problems doing so.  However, you have to remember that some suspension of reality is necessary for most mysteries to work.  Additionally most authors are distilling down characters that a mix of many different people they know or have observed.  Having worked with and managed many people of Lexi's type I think she came up with an entertaining and engaging mash up.The book is also light and humorous a real plus for me.  I lifelong devourer of books I have given up on the heavy and the dark which seems to prevail in Science Fiction and many genres of the thrillers of today.  I read for a laugh and for relaxation.  If I want to be depressed I will read the paper.  Just enough suspense to keep it interesting and just enough humor to keep it light.So bottom line if you have a little geek in you male or female and you like a good laugh check out this series."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "04 17, 2013",
        "reviewerID": "A2VS6B6P1LV5Q5",
        "reviewerName": "Don L",
        "summary": "Interesting",
        "overall": 5,
        "reviewText": "Slow to start with but growing with intensive page by page. Definitely recommend for anyone interested in wondering what. The next page would reveal."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 4, 2013",
        "reviewerID": "A2FZG1PJSU9S4C",
        "reviewerName": "D. Wilson",
        "summary": "A must read!",
        "overall": 5,
        "reviewText": "Loved this book!  Very well-written, great characters, romance, suspense, comedy.  This book had it all!  I highly recommend this book."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 30, 2013",
        "reviewerID": "A14X4SE3N409R4",
        "reviewerName": "Enchanted",
        "summary": "No one lives twice",
        "overall": 5,
        "reviewText": "I loved this book. It's fast paced and very funny and at the same time it has you holding your breath wondering what's going to happen next."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 23, 2013",
        "reviewerID": "A1XD1M9Y7HZ13I",
        "reviewerName": "Fascinatingbooks \"Books books books",
        "summary": "Pleasantly surprised!",
        "overall": 5,
        "reviewText": "I love books told in the first person IF that character has something going that makes me want to visit in their skin for the length of the book. Lexi had it all .. humor, brains, good heartedness and a goofiness that was endearing. Her romantic encounters were sexy without being sordid, the dangerous situations were alarming without being gory and her thought processes were intelligent and funny. I had a great time reading this book, was able to follow the plot and keep all the characters straight and stayed interested right to the end. I couldn't ask for a more entertaining read."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "08 11, 2011",
        "reviewerID": "A1OO3AOVNJAOA",
        "reviewerName": "Ginny \"Book Lover",
        "summary": "Almost Didn't Get",
        "overall": 4,
        "reviewText": "And I would have been missing a fun read. I will be buying more of the Lexi spy/mysteries. Just enough romance & humor & plenty of adventure. What more could you ask for?"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "02 21, 2014",
        "reviewerID": "A3PQYXLTFRM14Z",
        "reviewerName": "Ginny - Gin's Book Notes \"Book blogger at Gin...",
        "summary": "Three word review: fun, smart, adventure",
        "overall": 5,
        "reviewText": "I really enjoyed \"No One Lives Twice\" book 1 in Julie Moffett's, Lexi Carmichael Mystery series.  I picked it up during a free promotion but it is one that I would have felt I got my money's worth from if I had purchased it. As a matter of fact, I've already purchased book 2 and hope to be able to read it soon.Lexi Carmichael is a NSA computer geek. She is super smart but a little lacking in common sense and at times socially awkward. I loved her. There were moments that I laughed at her and moments that I cringed and thought \"no, no, Lexi don't do that\".I loved that the author balanced out all Lexi's quirks so that nothing was over the top. You get the good and the bad and in the end you end up wanting to cheer for Lexi and give her a mini-makeover while at the same time encouraging her to stay true to herself.The mystery aspects of the story are great. There is a touch of James Bond type adventure to the story that moves things along at a fast pace. There's some romance but it's more hints of things to come as the series progresses type romance.At the end the mystery is solved and Lexi is left with possibilities of future employment and romance. This is a series that I am looking forward to reading and following as Lexi and her fellow characters solve more mysteries and find romance.Three word review: fun, smart, adventure"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 21, 2011",
        "reviewerID": "A2RPZTZP8W80W",
        "reviewerName": "Jasmyn A. Dieck \"Jasmyn",
        "summary": "No One Lives Twice",
        "overall": 3,
        "reviewText": "Lexi Carmichael is a geek, a computer geek to be specific, and works for the NSA. She has no love life to speak of, and doesn't find herself to be very appealing to men. But now her best friend Basia has disappeared and men seem to be lining up to help find her.I loved the action in this story. It was fast paced and exciting. It was great to see a bunch of computer geeks in action to save the day. In fact, the computer geeks were my favorite part...except for Lexi. Now since Lexi is our main character, that poses quite a predicament. Lexi is just a little too depressing. She complains about her lack of love life, her lack of taste in clothes, and about anyone who tries to help her. She gets a bit annoying at times just because she is always talking herself down.The action, on the other hand, is fantastic. There are so many twists and turns subtly worked into the story, and they kept me guessing up until the very end.3/5"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 19, 2014",
        "reviewerID": "A1QDAWZ0ED4OBQ",
        "reviewerName": "Jody Gilchrist",
        "summary": "No one lives twice",
        "overall": 3,
        "reviewText": "Lexi is a witty and engaging female character. I loved the story line which was filled with mystery, suspense and romance. The male lead characters were captivating. It is a gifted author who  has her readers rooting for Lexi to end up with any of the men because she portrays them  all with style, humor and a touch of humanity. Although I do have a slight preference for one of the men. I know I will be reading more Lexi Carmichael mysteries in order to solve the mystery of  who she end up with -  Slash, Finn or Elvis."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 11, 2013",
        "reviewerID": "A369UWZFIPQMX3",
        "reviewerName": "Julia",
        "summary": "A 4.5, fun, fast read!",
        "overall": 5,
        "reviewText": "The first book in the Lexi Carmichael Mystery Series.  I had been putting this off since I lumped it into the Stephanie Plum and Brandy Alexander category.  This book is VERY similar to those series.  I do find the Janet Evanovich books much more humorous, but I like the character of Lexi a bit better than Stephanie.  Maybe because Lexi is smarter.  I know I will eventually tire of a possible love triangle.  The author set it up quite clearly and they are almost clones of Ranger and Morelli.  I do recommend this book and will keep reading them unless they start getting too predictable and/or dragging out the same story line.  I have to say, as much as I love the Stephanie Plum books (I'm a huge fan and recommended them to many friends) I haven't read one since 12 or 13.  Couldn't take them any more, no growth or decisions were ever made.  I am hopeful Julie Moffett won't let that happen here."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "06 29, 2014",
        "reviewerID": "A2B8C9QHIXJO6N",
        "reviewerName": "Julia \"Julia",
        "summary": "Lexi finds a way",
        "overall": 5,
        "reviewText": "Lexi is an amazing heroine. Although she is described as a geek, I love her to death. She is intelligent, nice, amazing and just a bit naive. But not too much. She does get into strange or embarrassing situations, but she always gets out of them with her head held high.I read the novella 'No money down' first, so I knew about the twins and Basia (her best friend). I was amazed about Slash (the sexy uberhacker) and Finn (English, dark handsome lawyer). Who will Lexi choose in the end?"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 20, 2014",
        "reviewerID": "A1PZSXNJL3NKZJ",
        "reviewerName": "Just An Ordinary Gal",
        "summary": "Geek Gal Gets Spiced-Up Date Life on the Run",
        "overall": 4,
        "reviewText": "Self-described geek Lexi Carmichael bring a smart mind and a smart mouth to the world of espionage. The mysterious hacker twins are another great addition to the mix.Action, amusing characters, and intriguing complications made this an enjoyable read.As noted by other readers, descriptions, especially of fast food, can drag on too long."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 1, 2013",
        "reviewerID": "A323TNOHRMNXW9",
        "reviewerName": "Kathleen Kedigh",
        "summary": "Seriously mysterious with just a hint of humor.",
        "overall": 5,
        "reviewText": "I like mysteries, but many if them are too light -- in fact, they're downright frivolous.  But not this one.  It is serious, yet the protagonist has a sense of humor, despite her inexperience.  The plot is well-paced and never drags.  It's a nice read."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 26, 2013",
        "reviewerID": "A1UH21GLZTYYR5",
        "reviewerName": "Kelly Rubidoux \"soulswallo",
        "summary": "A Reading the Paranormal Review",
        "overall": 4,
        "reviewText": "Heh. Geek girl gets thrown in the middle of international craziness and finds her social life taking off when all the men around her are of the hunky variety. I CAN GET BEHIND THIS IDEA!First off, Lexi goes from having a dating life that's a social wasteland to drowning in hot, smart, sexy men. Sure, most of them are keeping secrets from her and she's understandably upset about it when she finds out but the man-candy parade seems well worth it to me. On the other hand, having your life threatened and getting shot at a time or two don't seem as fun. But Lexi takes it in stride. She has the occasional meltdown (and who wouldn't!?!) but when she starts to understand what sort of shenanigans her best friend has been unintentionally dragged into, she rallies and starts plotting and planning.With the sexy hacker guys. *slow thumbs up*I was in the mood for something fast-paced and fun and this book delivered. Lexi is pretty clueless when it comes to men but that doesn't stop the hunks from gathering. She's good with computers, but has no field experience and she's smart enough to play to her strengths. I like a girl with smarts. I also like a girl who goes out and buys news clothes when she can't stomach the idea of doing laundry. Oh, Lexi. Don't ever change.-Kelly @ Reading the Paranormal"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 1, 2013",
        "reviewerID": "A3BCRJ0FVIWCHS",
        "reviewerName": "Kim \"music lover",
        "summary": "Great read",
        "overall": 5,
        "reviewText": "I started this book thinking it was probably another clone of the Stephanie Plum series.  What a lovely surprise to find that it wasn't!!!!!  I really enjoyed it!!  Great characters and the plot kept me on my toes till the end!!  I am definitely going to read them all now.  I highly  recommend this!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 2, 2014",
        "reviewerID": "A3MPAC2IHTDKE",
        "reviewerName": "Lara Mclean",
        "summary": "Awesome",
        "overall": 5,
        "reviewText": "These books are well written and an awful lot of fun to read as well.pretty nice combination. I hate to say it, but they'd make a great movie."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 30, 2013",
        "reviewerID": "A1ATX1WJ6XW953",
        "reviewerName": "Lester Allen",
        "summary": "It was good. But I liked the series .",
        "overall": 5,
        "reviewText": "I started to read the books because they reminded me of the Stephanie Plum series. as most books they first was kind of slow but then it got very interesting. I couldn't put it down."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 30, 2013",
        "reviewerID": "A6TLD3SC0TAMQ",
        "reviewerName": "Linda Meulen",
        "summary": "Seriously Good Read",
        "overall": 5,
        "reviewText": "Very fast paced and a likeable main character. Interesting crime and use of technology. Can't wait to read the next one."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "03 19, 2014",
        "reviewerID": "A356ELGUMS0D3Q",
        "reviewerName": "LinneyBean's Mom",
        "summary": "this book really hit the spot!!",
        "overall": 4,
        "reviewText": "I really, really, really enjoyed this book!!! There are several reasons why. The first is the fact that the heroine is not beautiful and rich with a jaw dropping body. She's very smart but that isn't thrown out there constantly making those of us, whose math/computer skills are less than stellar, feel inadequate. She sort of bumbles along figuring things with the help of a couple of computer whizzes with a couple of nice looking men thrown in for good measure.  The story unfolded at a good pace - enough to keep the reader wanting to read &#34;just a few more pages, dear&#34; but not so much that you had everything figured out way too soon! There is a wee bit of romance but absolutely no sex.  For those looking for a serious mystery/thriller this isn't it!!! It's more on the lines of a cozy mystery. I would soooooo like to read the next in this series but money being what it is I'm afraid I have to stick to free and $.99 books for the time being."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "07 2, 2011",
        "reviewerID": "AU9VM5YFI8F55",
        "reviewerName": "L. J. Engelke \"lisa at theromancereviews(dot)com",
        "summary": "An Okay Start to New Mystery Series",
        "overall": 3,
        "reviewText": "No One Lives Twice is a fun and wild adventure of an unsuspecting geek thrown into the crazy world of espionage, but be prepared for a few bumps in the road with this novel. Still, that's no reason you shouldn't pull up a chair, grab a shaken martini and prepare yourself for Lexi Carmichael...the female James Bond!Lexi Carmichael was having your average boring and uneventful day when she was confronted in the street by a mad man with a gun. He demands Lexi had over a document she has no knowledge of. Confused and terrified, Lexi arrives at her apartment only to discover her best friend Basia did send her papers with a note that she keep them safe. Knowing there is something deeper behind these papers, Lexi is determined to get to the bottom of this puzzle. With the help of her computer-hacking friends Lexi is working desperately to help Basia. The more she discovers about Basia's secret, the deeper she becomes entangled in this dangerous web. Now all Lexi needs is a plan...and a miracle.Moffett pens a delightful and exciting adventure for this simple computer geek gone rouge. Perhaps my favorite part of this first person novel were the secondary characters. No One Lives Twice has a wide range of fun and wacky characters that will make you smile and laugh. These characters mean business, but yet there is a light and funny side in their complimentary relationship when they work together. I could easily see fans of the Stephanie Plum series really enjoying this story and all it's eclectic characters. It has that same sexy edge, with a bit of light humor and fascinating characters to keep readings intrigued.Moffett adds plenty of sexy book candy to this novel, all setting their eyes on Lexi. Yet despite the lightness of this novel, one problem was the revolving door of potential romantic candidates. It was incredibly difficult, if not impossible, to believe that a woman with such a dry and uneventful romantic life was turning the heads of every male character in this story (and I literally mean every male character). I wanted to see one character pushed to front as the guy she was most interested in, even if everyone else was still chasing her around. If was hinted at the end, but not enough to be convincing. Usually with any love triangle, or in this case love pentagon, the reader can claim their favorite. It wasn't so in this case and that took a little of the joy out of the overall story.Another teeny tiny problem was the overwhelming description and drawn out plot points. By the third chapter, I think I read about Lexi stopping at every fast food joint known to man, and what she ate there. Admittedly, there was some unwanted detail, but the novel was still a fresh and fun read. Lexi is a great character with a lot of spunk and charm! The storyline is definitely unpredictable as you follow along with Lexi to solve the case and rescue her friend. Moffett takes her original characters on a thrilling ride that most girls only dream of! No One Lives Twice is an entertaining and fun novel for anyone who enjoys seeing the underdog computer geek come out of her shell to save the day. This novel is a decent start to a fresh new series. With a few slight modifications, this series could be flat out fantastic.Overall Rating: 3/5Heat Level: 1/5Lisa @ Once Upon A Chapter"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "09 18, 2010",
        "reviewerID": "A3THYM7XMB8B0U",
        "reviewerName": "Lola's Mom",
        "summary": "Stephanie Plum,  Lisbeth Salander, and James Bond in One",
        "overall": 4,
        "reviewText": "This was a fun book. Think 1/3 Stephanie Plum, 1/3 Lisbeth Salander, and 1/3 James Bond.Lexi is a 24 going on 25 year old woman with a top secret computer job. She is a computer geek, wears no makeup, has had sex exactly one time in her life, and it is quite possible that she buys her clothes at Walmart. Not what you picture as a Bond girl... She also loves Dunkin Donuts and Diet Coke. She is very down to earth, sassy, and honest. She does not have a side kick named Lulu, but there are hot guys suddenly popping out of the woodwork and just appearing in her apartment at all hours of the day and night. Unfortuneately, Lexi can trust none of them.From computer geek to Bond girl.. After being abducted twice in one night, interrogated about some papers she was supposed to have received in the mail, and discovering her best friend has gone missing, Lexi starts asking questions. Before you know it, she is shot at and uncovering some major corruption involving a fertility clinic and 40 million dollars and an Arab prince. A hot Irish lawyer, a sexy Swede karate instructor, and an Enrique Inglesius look alike all claim to want to help Lexi get to the bottom of this mess, but each one is hiding secrets of his own. Who can she trust?There are hot kisses, agents on stakeouts, world traveling, handcuffs, and another sexy guy named Elvis. I wonder if this is the beginning of a series? I can see it going somewhere. I had a few chuckles and a whole lot of fun wondering what mess Lexi was going to end up in next.Why not five whole stars? Too much information and too many characters at times. Still, a fun read tho."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "05 18, 2014",
        "reviewerID": "A1REZUQZMJUFW2",
        "reviewerName": "Lovesbooks",
        "summary": "Great Book",
        "overall": 5,
        "reviewText": "This is the first romance book that I've read, involving computer hackers and it really didn't disappoint! Not only was it fun, but it was also extremely witty, humorous, non-predictable, and action-filled. There were honestly no dull moments in that book and it was all I could do NOT to put the book down. The interesting men in Lexi Carmichael's life really intrigued me also which made me look forward to the next installment in the series. The fact that I can completely identify and emphasize with such a realistic character is an added bonus to liking the book. There are a lot of interesting twists and turns in the book, so be prepared for a wonderful, intriguing ride. Highly recommended."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 3, 2013",
        "reviewerID": "A26KWG162U8VBQ",
        "reviewerName": "lq",
        "summary": "Loved it!",
        "overall": 5,
        "reviewText": "Loved it!  This is a fast paced novel with an unlikely heroine that gets thrust into a mystery.  Very likable characters and great plot.  I would consider this chick lit, but written at a more intelligent level.  I really liked the math and science woven into the story.  I have added this author to my must read authors list."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 18, 2013",
        "reviewerID": "A7AUZ9JIM79BK",
        "reviewerName": "Melissa Fox",
        "summary": "A lot of fun",
        "overall": 5,
        "reviewText": "Solid 4.5 stars. I really enjoyed this fun romp. Shades of Stephanie Plumb, well written, and a story I found myself picking up throughout the day and reading with a smile. I wish we could have seen more of Lexi's computer skills and maybe relying more on her brothers than her friends and strangers who popped somewhat suspiciously into her life during this adventure. I mean, why give her brothers awesome, story-apropriate-and-intriguing jobs like a cop and an investigative reporter and then not really use them? Maybe in the next books of the series, which I will definitely purchase. Had a lot of lighthearted fun reading this one."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "10 5, 2013",
        "reviewerID": "A2IOL4R0J3NVY5",
        "reviewerName": "Mimi LaRue",
        "summary": "No On Lives Twice",
        "overall": 5,
        "reviewText": "I'm officially in love with Lexi!!! Julie Moffett writes like I'm living and experiencing what Lexi does. I have a new favorite author to follow!! I recommend this book and her other two in the series to date!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "10 8, 2012",
        "reviewerID": "A34Y1UROE0GM1G",
        "reviewerName": "MnBookLady",
        "summary": "Can't wait to read more!!",
        "overall": 4,
        "reviewText": "I accidentally requested book 2 of this series from netGalley, so I found myself in a position to find and read book 1 first because I don't enjoy reading books out of order.This was my first Moffett read, and I really enjoyed it!  It had a very easy flow, which made it a quick, light read.  I enjoy Lexi's character - she is that geeky yet sexy girl, in a bookish subtle sort of way.  I don't even think she knows yet what kind of power she has over certain men.  Just because she doesn't like her figure, doesn't mean men don't find her attractive.  They obviously do if this book is any indication.  3 guys swooning over her the entire book without any sort of encouragement on her part is pretty funny.At first, I had no idea what sort of investigative trouble Lexi was getting herself into, and the story kept taking twists and turns into different directions until I was so confused that it wasn't until the ending two chapters that I finally understood the complexity of the situation she was in and the part that everyone played in the whole operation. Elvis and Xavier are absolutely hilariously brilliant, and a great team to have on your side when dealing with several governmental agencies - FBI, CIA, NSA, MI-6 and the Vatican Intelligence.  When Lexi gets herself thrown into a situation, she really gets involved deep!Slash is an unknown quantity, and I can't help but wonder what role he will play as the series continues - but he is definitely sexy!!  Basia is fiercely loyal and that's a great quality to have in a best friend...even one who involves you in something you really don't want to be involved in.  Finn is sexy, in that Irish sort of way, but still a bit of an enigma.  It'll be interesting to see how his and Lexi's \"relationship\" evolves in books to come.  The ending was pretty good, and I think Lexi is about to embark on a totally different career path than a lowly computer geek at the NSA.  I can't wait to read more!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 7, 2010",
        "reviewerID": "A320TMDV6KCFU",
        "reviewerName": "MNix",
        "summary": "No One Lives Twice",
        "overall": 5,
        "reviewText": "In the space of a few hours Lexi Carmichael went from her dull job stopping hackers with the National Security Agency to being confronted with two different gun-wIelding thugs. Why? Because everyone seems to be looking for her best friend and some mysterious papers that she might have sent.  Lexi is totally confused since normally her biggest threat is the blind dates her mother keeps setting up for her.  Lexi knows and accepts she is a dull, brainy geek with little interest in fashion but her mother still tries to set her up with men who don't know how to handle her.Trying to find her friend and discover what everyone else is trying to find, Lexi goes to her other best friends, Elvis and Xavier Zimmerman, twins who are genius with computers and have designed extremely sensitive electronic networks.  You would think that would be enough but no, now Lexi is confronted with one sexy Italian government agent co-named Slash, who says he will help her, and a drop-dead handsome Irish man named Finn Shaughnessy who was working with the missing friend when everything went down.  Lexi now has to not only find her friend and keep her safe, figure out who is behind the thugs, and work her way though feelings for two men who normally would never look twice at her but seem to be falling for Lexi.  With a madcap plan, Lexi works her way from Jersey to Sweden with a trail of thugs, thieves, Finn, Slash and friends all to save the day and get to the bottom of what is going on and why.Thugs, Guns and Hot Guys - Oh my.  No One Lives Twice takes a geeky Lexi out of her normal life and puts her in the middle of an international who-dun-it.  I knew I would like Lexi from the first when I discovered she was a junk food junky and slow to get her laundry done.  When I then got thrown Slash, Finn and a mystery that is turning deadly, I knew this was going to be one fun book.  I was not wrong.  Watching as Lexi dealt with two gun-toting thugs, two beyond smart computer geniuses, one hot agent and then a toe-curling lawyer, all while trying to find and help a friend, proved to be a page turning plot.  I loved the humor that was the background for everything. The beginning buds of romance Lexi was feeling with both Slash and Finn at separate times had me wondering if Lexi would be able to choose. I can't wait until the next Lexi book so I can see just how her life has changed and who will get the upper hand in the romance department - Slash or Finn.  No One Lives Twice is a humorous look at the world of secret agents and enemy plots that will become an instant favorite series.JoReviewed for Joyfully Reviewed"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "02 21, 2014",
        "reviewerID": "A144XIE37Z6FZ8",
        "reviewerName": "Mom who loves to read",
        "summary": "Biting my nails to the end!",
        "overall": 5,
        "reviewText": "This book will keep you on your toes and guessing til the end who is a good guy and who is the enemy! My first time reading anything by Julie Moffett and certainly NOT my last. A very good read that you will have a hard time putting down. I'm ready for book two (which I've already purchased!). Well done."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 1, 2013",
        "reviewerID": "A2PFCU5WLS5UIX",
        "reviewerName": "Monica",
        "summary": "Seriously faced paced full of humour.",
        "overall": 5,
        "reviewText": "Excellent blend of innocent brilliance, danger,romance and intrigue. Loved the quirky mind of Lexi and her wild assortment of brainiacs and brainy secret services men."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 7, 2014",
        "reviewerID": "A130CNG1VZ37NE",
        "reviewerName": "Mrs Don",
        "summary": "Lexi is awesome",
        "overall": 5,
        "reviewText": "This series is not just for young adults, us old ladies enjoy it also. Has just the right amount of adventure, romance and mystery to make it a hard to put down book."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "07 11, 2013",
        "reviewerID": "AHLTOEEH5UDRR",
        "reviewerName": "MsEnglishTeacher",
        "summary": "Smart and funny",
        "overall": 5,
        "reviewText": "In this first Lexi Carmichael mystery, we are introduced to a Lexi, a socially awkward, reformed hacker working for the NSA.  She soon finds herself at the center of an international medical technology scandal when she determines to help her missing best friend.  Along the way, she enlists the help of high-tech twins, and meets a dreamy Irishman and a sexy Italian spy, who, for some reason, both seem to be romantically interested in her.  I enjoyed this fast-paced and funny mystery."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "02 9, 2014",
        "reviewerID": "A136VAVDIU9DOU",
        "reviewerName": "Msth \"sth",
        "summary": "Terrific",
        "overall": 5,
        "reviewText": "A true cyber geek fun action packed story with good characterizations and believable personalities.  I think she's got a great new series"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 30, 2013",
        "reviewerID": "A3ARWCQHUTZO6K",
        "reviewerName": "New 1",
        "summary": "Funny & Smart",
        "overall": 5,
        "reviewText": "This book was well written, funny and smart.  The main character Lexington was intelligent but naive and very amusing, I look forward to finding out her future in the next book!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 9, 2013",
        "reviewerID": "A2YFUGQI0PKWN8",
        "reviewerName": "Nicole Luiken",
        "summary": "Shades of Stephanie Plum",
        "overall": 4,
        "reviewText": "Shades of Stephanie Plum... Lexi Carmichael, geek girl extraordinaire, gets pulled into a world of spies and hot guys when her best friend sends her a mysterious package. A fun, light read with an appealing main characters. I really liked Lexi's resilience, and the situations she got into made me giggle (not wince, as sitcom humor often does).Fave scene: When the guy who broke into her apartment listens in on the demonstration of her new security system.Quibble: I expected Lexi to have more hacking skills, instead she relies on the Zimmerman twins in that area."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 27, 2014",
        "reviewerID": "ABJNNV60ANYSN",
        "reviewerName": "Ray J Cowling \"Author",
        "summary": "A FUN READ",
        "overall": 5,
        "reviewText": "A fun read and fast-paced adventure story. As the author ofBlood Sisters (Book One Of The Hanna and Carla Series), I thought the colourful characters in this book really shone through, especially the secondary characters.In some ways they actually made the book more interesting than the main ones. This book has got plenty of adventure, romance and humour to keep anyone turning the page.Certainly a nice way to spend a few relaxing hours of your time. Very good indeed."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "04 4, 2014",
        "reviewerID": "AI6Q4UETJR85X",
        "reviewerName": "sblettuce",
        "summary": "No One Lives Twice",
        "overall": 5,
        "reviewText": "Great author!  Worthwhile read.  The characters and plot were very good and I'd recommend this book among the top mysteries I've read in the last three years of just reading women sleuths."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "01 7, 2013",
        "reviewerID": "A1URUFWK20ZV9X",
        "reviewerName": "Sharon Wareham",
        "summary": "Again",
        "overall": 5,
        "reviewText": "Have really liked this series and hope that they keep coming.  I keep checking for new ones.  Please write more."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 2, 2013",
        "reviewerID": "A1FN5KPBPL1WCB",
        "reviewerName": "Shel D. \"shel d",
        "summary": "Excellent & geeky chic!",
        "overall": 5,
        "reviewText": "Fun letting the nerdy girl prevail with her wits. Great series that I'm actually re-reading. Keep up the great Lexi stories Julie Moffett!!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 23, 2013",
        "reviewerID": "A1FA4WVFVMBLZS",
        "reviewerName": "shirleen miller \"Shirleen",
        "summary": "Most interesting and surprisingly good",
        "overall": 5,
        "reviewText": "Not sure what I expected, but this was a delight to read. Not that murder and mayhem at today's government levels is a delight but the way the story is written, with humor and loyalty toward a friend. Standing up against those you are not sure you can trust is written so well in this book, well that is the delight."
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 14, 2013",
        "reviewerID": "A29QBZJ00B5N2I",
        "reviewerName": "Sigrid Spodzieja",
        "summary": "no one lives twice",
        "overall": 5,
        "reviewText": "voting for the other Lexi Carmicheal 5 stars and can't wait until the next book comes out (no place like Rome) ordered it already. Excellent writing"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "12 17, 2013",
        "reviewerID": "A94HJ77BPQBC7",
        "reviewerName": "Stacey Puleio",
        "summary": "great read..humor mixed with romance and suspense...perfect blend..now on to the other books",
        "overall": 5,
        "reviewText": "Loved the book...great twists and turns mixed with lots of witty dialogue and humor...looking forward to the next book in the series!"
      },
      {
        "asin": "B003U89RS0",
        "title": "No One Lives Twice",
        "reviewTime": "11 6, 2013",
        "reviewerID": "A11WWO25Q1IU0O",
        "reviewerName": "Wiggiemomsi (Wiggie) \"Sharon S.",
        "summary": "WOW, what an unexpectedly delightful book!",
        "overall": 5,
        "reviewText": "OK, this book was free, and I figured if I didn't like it I could just delete it from my Kenny Kindle II.  But WOW, what a surprise!  I really, really liked Lexi Carmichael, super geek girl, and was drawn into her escapades.I'm headed now to buy the other books in the series, and will add Julie Moffett to my list of to-buy authors!  :o)"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "11 1, 2013",
        "reviewerID": "A3O2UZACDPCGZ5",
        "reviewerName": "Alan Arthur Katz",
        "summary": "Addicted to Lanyon",
        "overall": 5,
        "reviewText": "I need to admit it openly: I'm addicted to Josh Lanyon.His writing is so good that you're never even aware of the author writing. It's virtually cinematic. I'm not sure exactly what he does to effect this, but each page is so alive and present that even the dull ones, when nothing much is happening, are interesting and engaging.That's the word: \"engaging\". His characters, locations, plots, exposition and dialog are all engaging. They grab you from the first word on the first page and don't let go until the ending. The plot, like this one about a serial killer, doesn't even have to be mind-grabbingly unique. In fact, the plot of \"Fair Game\" is a perfectly standard serial killer mystery/police procedural. But in the hands of the master writer, it becomes so real, so alive, that you can't bear to walk away from it until you get to the very last page.This applies not just to \"Fair Game\", but to the six or seven other Lanyon novels to which I've also given enthusiastic 5-star reviews. This is not a fluke. It is the sign of a genuine talent, and Mr. Lanyon is, at very least, a most genuine talent."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 10, 2013",
        "reviewerID": "A3TP31S61PPE3G",
        "reviewerName": "AlexJouJou",
        "summary": "Excellent combo of romance, suspense, and mystery!",
        "overall": 4,
        "reviewText": "I haven't read a ton of Lanyon but this is easily the best of what I have read so far. Strong characters with enough vulnerability to make them appealing but not so much they come off as weak or simpering or irritating. Strong story - the whole mystery really was the thing which made the relationship framing inside of it very natural. I thought the reactions were natural and true and they felt right to me. This flowed very well - no dead spots (ha ha pun intended!)."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 19, 2014",
        "reviewerID": "A10V1ZP40DPK4B",
        "reviewerName": "Alwazmemsp30 \"Marsherri Pierce",
        "summary": "Surprise",
        "overall": 4,
        "reviewText": "I got the this book because I had just finished up the Cut and Run series and was in need of something to read, it sound like it would be okay.  At first I was not sure I was going to like it but once I got to really reading this book I feel in love with the character's.  This was a good book that should be made into a series that is how much I like these guys, if anyone knows the author please tell him to give us more!!!!!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 17, 2013",
        "reviewerID": "A1TY1ILM5T2LO8",
        "reviewerName": "Amazon Customer",
        "summary": "GREAT",
        "overall": 5,
        "reviewText": "Everything has already been said.  This was great book and well worth the time to read.  I liked the plot and the main characters.  A MUST READ"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "11 20, 2010",
        "reviewerID": "A1TTILUCUXD7JO",
        "reviewerName": "Amazon Customer",
        "summary": "Sweet, tender, healing love reunited...",
        "overall": 5,
        "reviewText": "Sweet, tender, healing love reunited...Tender story of two heroic men who go past the challenges life has thrown their way to reunite and solve a killer's sadistic trail.  Story of Elliot, an FBI agent forced into retirement by injury and Tucker, his ex-lover and co-worker at the FBI.  Great characters, both main and secondary as well as a story that will stick with you long after you've closed the book.Keep in mind that this is a sweet gay fluff read.  5* of 5*"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "09 21, 2010",
        "reviewerID": "A14R9XMZVJ6INB",
        "reviewerName": "amf0001",
        "summary": "More than Fair",
        "overall": 5,
        "reviewText": "Josh Lanyon has become an autobuy for me, I've read several of his books and they written to a consistently high standard. He hasn't disappointed yet!Fair Game follows Elliot,  terribly wounded while working for the FBI,  now recovering having resigned from the FBI and lost his boyfriend/colleague at the same time.  Elliot is now working as a professor at the same college where his father taught for many years.  But something odd is going on,  and this brings Tucker Lance,  FBI agent,  back into  Elliot's life.I enjoyed the mystery,  but I really loved the dynamic between Elliot and Tucker,  how they misunderstood each other and let each other down after the terrible shooting and then struggled back to a kind of friendship and then something more.I rate this a keeper and a reread,  and while not as gripping as Adrien English (well,  I haven't read 5 books with them yet,  give it a chance...) and I for one would be delighted to meet these characters again."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 22, 2013",
        "reviewerID": "ALJO98LZGRC3P",
        "reviewerName": "Ann Alaskan",
        "summary": "Josh can't write a bad book",
        "overall": 5,
        "reviewText": "Love Josh and ALL of his writings and this one has moved close to the top of my Josh list."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 6, 2014",
        "reviewerID": "A1ZVW3VWAASU2Z",
        "reviewerName": "Annie Allen",
        "summary": "Good who dunnit",
        "overall": 5,
        "reviewText": "I really like a book that hides the bad guy until the end, although he was my top two. Well written, great characters, good job."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 2, 2014",
        "reviewerID": "A29SI70VWX82AL",
        "reviewerName": "Arshad Ahsanuddin",
        "summary": "Romantic conflict against a murder mystery backdrop",
        "overall": 4,
        "reviewText": "3.5 stars. An interesting romantic conflict between two male characters, trapped in their previous roles and misunderstandings, with a murder mystery thrown in. The pacing seemed a little too fast towards the end, but that can be forgiven in an adventure/procedural story."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 28, 2011",
        "reviewerID": "A3N6JG64P2G9EV",
        "reviewerName": "BarkLessWagMore",
        "summary": "Fab mystery/romance",
        "overall": 5,
        "reviewText": "4 1/2 Elliot is a former FBI agent, injured on the job, and now reluctantly working as history professor due to his bum knee. He doesn't realize just how much he misses his old life until he gets involved in a missing person investigation and finds himself consultant to the FBI and his ex-lover Tucker. Their relationship simply ended when Elliot was injured and neither has ever resolved it. Seeing each other is drudging up uncomfortable memories for Elliot, who insists the two had nothing in common anyway. Except sex. Mindblowing sex. Elliot really misses the sex. Tucker apparently was very good at it.This is a mystery with solid writing and strong sense of place. The romance is there, slowly building in the background but it's first and foremost an intriguing murder mystery. I wasn't expecting that because I've probably been reading way too many m/m erotica novels. I've gotten comfy with the main focus being (often) 100% on the relationship, the sexing and the conflicts within that relationship. Fair Game follows its own path and was a nice surprise.Tucker doesn't welcome Elliot's interference on the case and isn't at all shy about letting him know it. Working together is difficult for them; they have unresolved, unsaid stuff between them. Stuff neither wants to talk about. Both are resentful and have feelings of abandonment but talking would mean facing their feelings and these guys aren't the type to have a big emotional row.Elliot and Tucker seem like men most of us know (albeit probably much better looking). They think like guys, they act like guys and it was such a nice change of pace for me, having read more than my fair share of books that featured gay men who were, ahem, so fem and saccharine sweet I felt as if I were reading a fairy tale or someone's idea of a dream man. Fair Game seemed less of a fantasy and more of a reality about two tough, stubborn men who have a connection and whether they're willing to admit it or not want each other but can't communicate. Instead they brood and let things simmer until it all spills out in the form of hot kisses and near sex. It was so real it was touching. Seriously, who doesn't know a man afraid to talk about what he's feeling and would much prefer to clam up and get naked?I'm not a big mystery girl but this one never had me daydreaming or wishing I was reading something, anything, else. It was interesting; the characters well developed and there were more than enough suspects to keep me guessing and, yeah, the romance was lovely. If I didn't have so many other books to read right now and a crazy busy weekend I would snatch up the rest of Lanyon's work and hide away in my room until I'd read myself into a stupor."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 16, 2013",
        "reviewerID": "AU0TU06DREUXE",
        "reviewerName": "BeckyBWVU",
        "summary": "First Josh Lanyon Book..Wont Be The Last!",
        "overall": 4,
        "reviewText": "This was my first Josh Lanyon book and I enjoyed it.  There was a good plot and I enjoyed the slow burn between Elliot and Tucker.  Will be starting the Adrien English series next."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 15, 2014",
        "reviewerID": "A3P4BJ6GBH7KIW",
        "reviewerName": "Becky C",
        "summary": "Beautiful story of a man in transition",
        "overall": 4,
        "reviewText": "Landry's Review at Mrs Condit & Friends review blog: &#8220;Fair Game&#8221; tells the tale of Elliot Mills, a man in transition. He used to be a top FBI agent in the Pacific Northwest until an on-the-job injury forced him to start over as a college history professor in his Washington state hometown. Everything is new for him but not much is necessarily better. He likes teaching and loves being near his dad-his only remaining relative- but being an agent for the Bureau was his dream career and he was good at it. When a gunshot wound forced him out of field work, he knew he was not suited for a desk job. So he walked away from that life and everyone who was a part of it&#8212;-and that included fellow agent and new lover Tucker Lance.Elliot was just learning to accept his new, quieter life when he reluctantly agreed to his father&#8217;s request to help old family friends search for their missing son, a student at the college where he taught. Elliot is drawn deeper into the case when he realizes that they are more victims involved. Soon the FBI is called in and Elliot is forced to swallow a lot of personal issues and deal with his old flame, Special Agent Lance. I know this book is about the mystery Elliot and Tucker are brought together to solve. But, personally, I found it more interesting to uncover and understand the whole story behind the prior romance that the two main characters shared before Elliot&#8217;s injury. Telling this personal story did not happen fast. In fact, because so little was explained in the beginning of the book, I originally thought that this was a later installment in a series. I checked and it wasn&#8217;t. This was simply the author&#8217;s choice to slowly let us, the readers, in on the exact nature of their relationship, how it developed and eventually fell apart. It caught and held my interest because I wanted to know! But, honestly, I would have liked to know more sooner. Knowing the back story helped me to understand and like Tucker so much more. It also made it easier to relate to Elliot even if I did not always agree with the choices he made. He certainly has what it takes to be a top-notch cop. He was always a step ahead of everyone else, except of course the perpetrator, at least until the very end. Elliot figured out &#8220;whodunit&#8221; but in my eyes, it was the tiniest piece of evidence possible that lead him to identify the guilty party. Still, the crime wave was stopped and Elliot and Tucker had time to talk and come to a new understanding. I enjoyed author Josh Lanyon&#8217;s descriptive writing skills. His words created beautiful visions of the Washington State area. I could picture the scenery but I did have to check a state map to understand the distance between the different locations he mentioned. There were many characters introduced but I was disappointed that we didn&#8217;t learn much about the victims, especially the first young man Elliot was asked to help find. I didn&#8217;t feel any real personal sympathies for him, no sense of loss because he was really just a name, not a person. There were several possible suspects discussed and when the culprit was revealed, it was not the person I first suspected so, as a mystery, the story worked fine for me. This mystery seemed to be the main focus of the book but it was the romance between Elliot and Tucker that I enjoyed the most. Having the two men come together and work out their differences was the outcome I most anticipated and in the end, I was rewarded."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 25, 2010",
        "reviewerID": "A24O0UFBFC6EW0",
        "reviewerName": "Bloomingranny",
        "summary": "Loved it!",
        "overall": 5,
        "reviewText": "What a great book! Excellent mystery keeping the suspense all the way to the end. Wonderful, well-drawn characters and a sweet romance too."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 6, 2010",
        "reviewerID": "A301X46BHB2WD8",
        "reviewerName": "Bogey \"Gene",
        "summary": "Never saw it coming",
        "overall": 5,
        "reviewText": "Excellent!  Bravo Mr. Lanyon!  This is a well written mystery with lots of twists and turns that hurt like hell. Woven into all this mystery is the past romance, hurts, and lonliness of Elliot and then we find out that Tucker was sharing the same fate.  This has got to be Josh Lanyons' best one yet; a must read."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 6, 2010",
        "reviewerID": "AZ2RMVGXHLG80",
        "reviewerName": "Buda",
        "summary": "Fair? No way. Fantastic!",
        "overall": 5,
        "reviewText": "The blurb lets you know the gist of the story. Here's the other important stuff: The mystery is solid, the story beautifully written and well told, the romance is secondary to the mystery (as in most Lanyon books), the characters are, as always, wonderfully drawn and fully dimensional so they'll irritate you as well as make you laugh and love them. I enjoyed this one very much and will definitely revisit Elliot and Tucker's world!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 3, 2012",
        "reviewerID": "A26SPAD93IGOB8",
        "reviewerName": "Charles Dickens \"canary451",
        "summary": "An Excellent Read ! !",
        "overall": 5,
        "reviewText": "This was the first book by Josh Lanyon I have read, and I thought it excellent!  It was a skillful incorporation of sex scenes and mystery, and I highly recommend it.  I had to finish the book before I went to bed last night, and about three-fourths of the way through the book, I figured out who did it.  I was wrong!  I hope you enjoy it as much as I did."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 6, 2010",
        "reviewerID": "A3O9A7B0KJO88B",
        "reviewerName": "Charly T. Anchor",
        "summary": "I found one of the main guys a little hard to like, but the book has a great action/mystery plot",
        "overall": 4,
        "reviewText": "Warning: This review might contain what some people consider SPOILERS.Rating: 8/10PROS:- I found the plot interested and well-paced. The mystery is...mysterious (at least, *I* didn't guess the murderer's identity before it was revealed, although I'm admittedly not a great mystery solver), and the story incorporates a lot of different witnesses presenting differing views on the case and widely disparate opinions about the other people involved--all of which Elliot and Tucker have to sift through to discover the truth.- The characters are interesting while at the same time seeming like real people. None of them have the \"perfect\" feel of fictional characters; Elliot and Tucker both act like real men with believable insecurities and fairly quick tempers. I also like that there's no power inequality in their relationship: they're equally strong and intelligent.- Lanyon does an excellent job of reinforcing character traits, especially those that reveal something about the character's past. There's a little indication nearly every page early on in the story that Elliot's current life as a professor is quite different from his former life working for the FBI.- I used to teach college English, and Elliot strikes me as a true-to-life depiction of a college professor. He's intelligent and a little careless, he interacts with his students as though he's equal parts amused and frightened by them, and he thinks of them by first and last name, often inverted (\"Mrachek, Leslie\"). The story also contains a large number of caustic remarks about the arrogance of people who work in academia (example: \"Only in academia did people talk such [b.s.] and expect to be taken seriously\"). Not all academics are that way, of course--Elliot isn't; otherwise his observations wouldn't be funny--but the comments are largely true and made me laugh out loud more than once.CON:- The entire story is told in third person limited from Elliot's perspective. This isn't inherently a bad thing; this was just one of those stories that I really wanted to see from both main characters' points of view. Elliot has some pretty painful memories of Tucker, and I wanted to see Tucker's defense of himself. The main reason I wanted to see Tucker's perspective on their history together is that so many of their early encounters in this story are bitter and tight-lipped and angry. I could see Elliot's desire for something more to develop once again, but all I ever saw from Tucker was his outward terseness, so I started thinking of him as kind of a jerk. Tucker's redemptive moment, for me, didn't come until three-quarters of the way through the book.Overall comments: The plot, as opposed to the relationship, is certainly central here. But it's a good plot. I wasn't QUITE on the edge of my seat biting my fingernails the whole time, but I never lost interest, never wanted to put the book down. The investigation plot and the romance are also well tied together. It didn't feel to me as though either one was tacked on to the story as an afterthought."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 7, 2014",
        "reviewerID": "A15MDKL27F12DF",
        "reviewerName": "cherryt3",
        "summary": "4 stars",
        "overall": 4,
        "reviewText": "I really enjoyed this, I do wish there had been more between Tucker and Elliot, and I don't just mean more sex--though that would have been nice, too, but I was craving a little more connection and interaction between the two.I think I accused just about everybody of something, I was right a few times and was surprised a time as well, so I enjoyed that.Would recommend and will read more from this author."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 15, 2011",
        "reviewerID": "A8PLPVAMWRSOG",
        "reviewerName": "Chris Castle \"Readiculous",
        "summary": "So good it gave me brain freeze ;)",
        "overall": 4,
        "reviewText": "I often wonder how 80% of the books out there get published. I think to myself, 'who read this and thought: I must get this out to the masses immediately'; I didn't wonder that once while reading this book. IT WAS EXCELLENT. It's the kind of writing that forces the reader to pay attention and even look up a few words or theological themes. It is very obvious the writer is intelligent, more obvious that he expects his readers to be. I like that; please don't dumb it down on my account; I love learning new words.Anyway, this story is first and foremost a mystery, not a romance as I had previously thought when considering it for purchase. Still, the relationship between Elliot and Tucker offers a much needed and equally engrossing subtext. Both the plot and the relationship milestones moved forward seamlessly and best of all I never felt like either dragged out to some inevitable conclusion, despite the foregone conclusion of a 'case closed and HEA' ending due to it's genre and reader preferences. That's hard to do these days. Bravo.I don't want to spoil any of the story by offering insights into the plot. Suffice to say,when the mood strikes and my brain cells need massaging I'll be sure to pick up another of Josh Lanyon's novels.And for those to wonder why I gave this book 4, instead of 5 stars: I only rate books at five stars if I can enjoy them more that once. With the mystery solved and the romance only secondary, I probably won't read this book again, unless of course I want to write down any of those ten cent words I had to look up the first time around. I don't know if that's fair, but it's true. Besides, Josh Lanyon doesn't need my 5 star review to write a 5 star mystery, nor does he need me to buoy his career. His work speaks eloquently enough for itself. READ IT!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 10, 2011",
        "reviewerID": "A2PPW46BO3QK52",
        "reviewerName": "C. L. Vinnes \"Book Warren",
        "summary": "A Must Read!",
        "overall": 5,
        "reviewText": "I have recently fallen into love with Josh Lanyon's work. His stories are well crafted and his characters and plot have amazing depth. This book had everything I was looking for in a great story. Amazing characters, a well designed murder mystery, and hot steamy sex. The scene where Tucker comes to Elliots rescue at the lake was nail biting. I was literally at work and I couldn't put the story down until I knew they were alright. Thank god I didn't get fired. I found absolutley nothing to dislike about this book and I must say that I wish for a sequel most desperatly. I would love to know how the main characters are dealing with their new found relationship.Thank you Josh for another amazing story!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "02 5, 2014",
        "reviewerID": "AYKXGNC7S5LO2",
        "reviewerName": "Darcy Thornton \"JCM",
        "summary": "Thanks for another sleepless night, Josh Lanyon! (Fist in air but smiling)",
        "overall": 5,
        "reviewText": "Wow, I LOVED this story! The mystery/suspense portion was interesting & had me guessing- definitely not a throw-away as background to the romance portion. The MCs were fantastic. The story was written in 3rd person but from Elliot's POV, so you developed a more intimate 'relationship' w/ him vs Tucker, but it worked! Elliot was a sympathetic character and was very like-able. He & Tucker were fantastic together. They clearly cared for each other & had to work through old hurts to kick start the new version of their lives together. I liked that Tucker was a little more clued in & open about what he wanted. Elliot had more baggage to lose but I never felt that they were unreasonable in their dealings w/ each other. No gratuitous stupidity or conflict. Yay!I don't know how Josh Lanyon does it, but I've pretty much loved all of his MCs & their relationships. There is just the right amount of conflict, internal & external, the right amount of tenderness, & perfect sexy times. I really can't say enough. I've become a rabid devotee of Lanyon since I started reading his works a few weeks ago.Back to this story, it was both a mystery & romance, side-by-side. I think he nailed the secondary characters as well. No throw-aways here either. My ONLY ongoing Lanyon complaint. I would love to see an epilogue! For all of his stories. I always feel like I'm not ready to say goodbye yet when the stories end. It's not a bad complaint to have & is a testament to how good Lanyon is at what he does.I couldn't put the book down, but when I had to, I couldn't wait to get back to it (OK, I read it in a day, but still). Great emotional depth, interesting & sexy MCs, a solid supporting cast, what's not to love? This is probably one of my favorite Lanyon's to date.Highly recommend!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 19, 2011",
        "reviewerID": "A3UKBPJ19RDC3I",
        "reviewerName": "Derrick Dodson \"Font of useless knowledge",
        "summary": "Fantastic and a freaking bargain!",
        "overall": 5,
        "reviewText": "Josh Lanyon is always good, and this one is terrific. It includes Lanyon's signature protagonist with some kind of disability in the form of Elliott. He was an FBI Agent who was injured in the line of duty and now teaches. A disappearance that turns into a series of disappearances at his school pulls him into a role investigating what's going on. Unfortunately, it also brings him back into contact with his former partner from the Bureau, Tucker. The man who he feels dropped out of his life completely once he was injured. It also makes him a target of the killer they are each hunting. Again, a fantastic book with an awesome plot, executed perfectly. I am SO glad Lanyon uses his powers for the good of m/m readers everywhere."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "11 5, 2012",
        "reviewerID": "A1E481YU3ZPK6S",
        "reviewerName": "Elisa",
        "summary": "Fair Game by Josh Lanyon",
        "overall": 4,
        "reviewText": "It's strange since Carina Press is actually a romance publisher, but I think Fair Game is the less \"romance\" among the novels by Josh Lanyon I read; now, there is a love story in it, but really, the lion share in the plot is to the mystery/thriller. Elliot Mills, former FBI agent and currently a college professor, is investigating on the disappearance of a student, who happens to be a family friends's son. That former lover Tucker Lance is the FBI agent in charge of the investigation it's not a plus to Elliot's eyes.When I said the mystery is more important of the romance, I don't want to give the impression the romance is not good. I actually liked how real both Elliot than Tucker seemed; when Elliot was forced to leave the FBI, Tucker was not really sympathetic, and the reason was purely egoistic: Elliot leaving meant less chances for them to continue with their story, or also losing what little they had in common, aside for their job, Elliot and Tucker were at the opposite, and Tucker had the wrong idea only their job was bounding them. On the other hand, Elliot was stubborn, and not ready, or willingly, to listen to Tucker's explanation, once he realized what mistake he did. Elliot is a little of a primadonna, and being attacked by Tucker was something he didn't forgive easily; when he was down, he wanted for people to commiserate him, to tell him how unfair was the fate, that he didn't deserve it... he didn't want for someone else to be miserable, to steal his spotlight in hell, and Tucker was.But now, months later, both of them are ready to admit they were wrong, and while Tucker is able to say the words, Elliot perhaps prefers to prove them with facts; it's easier to commit with his body than with his words. Maybe since, words are harder to hide or deny."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "12 31, 2010",
        "reviewerID": "A1CNQTCRQ35IMM",
        "reviewerName": "Jane",
        "summary": "Above average and enjoyable.  Mostly mystery solving, some good action scenes and a few intense M/M sex scenes.",
        "overall": 4,
        "reviewText": "FAIR GAME by Josh Lanyon.STORY BRIEF:Elliot and Tucker were FBI agents.  They had an intense sexual relationship for three months until Elliot was shot in the knee.  At that time they broke up.  (The reader doesn't know why until later in the book.)  It is now 17 months after their break-up.  Elliot has an artificial knee which restricts his movements, requires weekly therapy, and is painful at times.  Elliot didn't want a desk job with the FBI so he now teaches history at a university.  He misses Tucker.A student Terry is missing.  His parents are friends of Elliot's father.  They feel the police and FBI aren't doing enough and ask Elliot to look into the disappearance.  Tucker is the FBI agent in charge of the case.  Elliot and Tucker interact regarding the case.  A second student Gordie goes missing.  The university president asks Elliot to look into that as well.  Elliot suspects a serial killer.REVIEWER'S OPINION:This is mostly a mystery.  There is suspense because the killer knows Elliot is investigating and wants him dead.  There is not much relationship development between Elliot and Tucker.  Their interaction on the case is the catalyst for them to start talking to each other.  As they forgive each other, there are a couple of intense sex scenes.  While I was reading it, I was little impatient with the mystery solving - wanting more time with the relationship.  But on hindsight, the mystery solving was ok.  I really liked the action scenes.  My favorite scenes were a sniper shooting at someone and an attack in a parking lot.I would have liked seeing Tucker's feelings and point of view about their past and at other times.  The story is told in third person from Elliot's perspective.Sex scenes include anal.  There are two short scenes where Elliot is remembering or dreaming.  There is a hot kissing scene.  And then there are two longer scenes at about  of the way through which are passionate and tender.POSSIBLE SPOILERS - UNANSWERED QUESTIONS  (I DON'T give away whodunit):There are some things I would have liked explained.  Where did the killer put the dead bodies?  Why did he put one of them in the place it was found and not with the others?  Did he kill men and women or just men?  What did he do with the bodies during the time he had them - before he disposed of them?  Were they dead, alive, drugged?  I wanted to know how the killer first attacked and subdued his victims.  Did he use a knife, gun, rope?  The only one I know about had him wrestling the victim with a hypodermic needle in his hand.DATA:Kindle count story length: 4052.  Swearing language: moderate, including religious swear words.  Sexual language: moderate.  Number of sex scenes: 5.  Setting: current day Tacoma and Puget Sound area in Washington State.  Copyright: 2010.  Genre: gay male mystery suspense romance."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 19, 2014",
        "reviewerID": "A1O4D0B2IO2K6T",
        "reviewerName": "Jewel Cardwell",
        "summary": "Kept me guessing!",
        "overall": 5,
        "reviewText": "I've read a couple of Josh Lanyon's short stories and enjoyed them quite a lot and so bought this one the other day to try.  I loved it.  It was action packed and suspenseful and Elliot and Tucker obviously had some unresolved issues that needed dealing with.I loved the story and the suspense.  The antagonist was camouflaged pretty well, I thought, and what a sick sick person it was, too.  And it gave Elliot and Tucker not only a reason and the chance to work together again, but also to remember that they were good together before Elliot's injury.  And I loved the interaction between Elliot and Tucker.  It's obvious that they cared about one another, even through the anger and hurt.  They're good for each other - even if it did take a while for them to figure it out."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 11, 2010",
        "reviewerID": "A2HIC8D9J64PAP",
        "reviewerName": "J. Mckay \"jennysmum",
        "summary": "An Excellent Mystery",
        "overall": 5,
        "reviewText": "This is an excellent mystery with romance on the side.  This is one of Josh's well plotted mysteries, well written and not obvious.  The characters are engaging and real.  There is enough romance to satisfy the romantics without swallowing the mystery.Definitely one to read over again."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 9, 2012",
        "reviewerID": "A9TJRJW8SUINH",
        "reviewerName": "Johanna",
        "summary": "Hot mystery",
        "overall": 5,
        "reviewText": "This is probably going to sound weird, but I love Lanyon's sentences. The way they bind together so easily and the way they still keep surprising you. It's so delightful and witty - from the very first page of the book. This book made me chuckle and laugh so many times. One of the things I like about Lanyon's books is actually the fact that the story begins right away from the first page in full gear.The mystery part of Fair Game was very clever: there were so many possible suspects. I changed my mind about the murderer at least half a dozen times as the story proceeded! I also like the way some of Lanyon's books have titles with multiple meanings - just like Fair Game did.The chemistry between Elliot and Tucker was titillating and intense. I absolutely love how Lanyon's characters feel so real and imperfect in their actions. These guys weren't neither perfect nor one-dimensional for sure! I genuinely enjoyed the way they argued and the way their logic and squabble twisted and turned and held so many emotions in both sides. All the awkward moments between the main couple were so tangible it almost hurt! These guys fit together so badly that it was impossibly hot, annoying and totally enjoyable. It also was very interesting how in the beginning of the book it looked like that it was Elliot who had been dumped, but when the story continues we find out that both men had been pretty lost at the time of their separation. And the scapegoat Tucker proves to be a very emotional and endearing sweetheart.I did love the sex scenes in this book. The actual sex happens long after a fabulous kiss-in-the-car-scene and an ultra-passionate scene by/in the lake after Elliot gets shot. Those scenes, the extreme tension between the main couple and Elliot's memories about him and Tucker together worked like a sweet, long foreplay."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "04 21, 2014",
        "reviewerID": "A27Y3RZUBWIKWK",
        "reviewerName": "jonboy",
        "summary": "A RIVETING, EXCITING, TOUR DE FORCE AND PRETTY DAMN SEXY!",
        "overall": 5,
        "reviewText": "I read this about a year ago and was pretty sure it was one of the best Josh Lanyon books I'd read so far. Now, with some other authors under my belt, I decided to see if I was correct.Elliot Mills is a former FBI field agent and with his sometime partner Lance Tucker they had been opposites in their methods but very compatible in the sack. That is, until a disabling injury during a takedown gave Elliot two choices: a desk job with the department or a professorship at a local college. Deciding on the latter meant the end of his relationship, although that had its problems as well.Now, seventeen months later, settled in at his new job at the university, Elliot is again pulled into an investigation of a missing student by the boy's family. He decides to help and as luck would have it, the lead agent from the FBI assigned to the case is none other than Lance.The tension, professional and sexual is evident, with neither willing to admit the underlying need for mutual assistance. With Elliot, like a pit bull, not wanting to let go of the case, and another victim going missing, it seems that Agent Tucker will have to team once again with him.The interplay between the two is fun to watch, the rekindling of their relation is smoking hot, and the steady and swift pace of the investigation is just icing on the cake.This is a thoroughly enjoyable outing for the reader, with a great, intense, and sexy storyline. The conclusion had me turning pages quickly, and when then perpetrator is unmasked, it was a total surprise.I HIGHLY RECOMMEND THIS, NOT AS JUST A JOSH LANYON BOOK, BUT AS A TERRIFIC READ WITH A HANDS DOWN SMASHING ENDING!  GREAT!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "06 21, 2013",
        "reviewerID": "A2H6XPMMOG4LPQ",
        "reviewerName": "Justin Parker",
        "summary": "It was ok",
        "overall": 4,
        "reviewText": "The characters were likeable for the most part. The sex scenes were a little out of touch with reality and stereotypical.  I didn't really feel the romance. I thought that it was an okay book. It was worth reading but somehow I think this book will become one of the many \"ok\" books that I read and have forgotten. Still it wasn't terrible. I do like these types of books for the most part but they usually end predictably the same way."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 9, 2014",
        "reviewerID": "A1N25JPFSIDG7Z",
        "reviewerName": "JustMe",
        "summary": "Intriguing reading with love added into the mix",
        "overall": 5,
        "reviewText": "I really enjoyed this book with suspense. Much because it was not all only about the sex. Actually it was little of that and much more about emotions. Elliot is the person we get to know. He is the one, although still told in 3rd person, who tells the story. He had been injured in line of duty some months ago and had lost not only much of his ability to move (and thus he choose to leave his position with FBI), but also the man he cared about. Once again a case of lack of communication. Both men thought the other didn't care enough and not willing to fix the problem.The backdrop of this story about a relationship is disappearance of a student from the university where Elliot is currently professor. The boy is son of Elliot&#8217;s father&#8217;s friends and thus Elliot gets involved. He has obviously still the abilities that made him a good FBI agent, because he connects the dots and against all odds unravels a serial killer that until now had sailed under the radar.The search for the missing student evolves into game of life and death. Something that brings Elliot and Tucker closer and even if the communication still is not what it should be, they seem to be able to mend their relationship and find their way forward &#8211; together (I did not spoil too much, did I?)."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 27, 2014",
        "reviewerID": "A2PADB9SEGJPXM",
        "reviewerName": "Katzie",
        "summary": "Loved it!",
        "overall": 5,
        "reviewText": "I loved this, hands down. Josh Lanyon is so amazing, and this story was the start of my love for all his stories. It was amazing!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 1, 2014",
        "reviewerID": "AGORW02J2U6ON",
        "reviewerName": "Kindle Customer",
        "summary": "Loved it",
        "overall": 4,
        "reviewText": "I like Josh Lanyon more and more with every book I read. I don't even like thrillers!!!! I plan on reading more."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 5, 2014",
        "reviewerID": "A3DWWVW3PO5VH",
        "reviewerName": "Kindle Customer",
        "summary": "Unexpected ending but .....",
        "overall": 3,
        "reviewText": "Many times I thought I had figured things out... but every time I was wrong.The romance in this story is very mild. I like more spice and emotions in the books I read. This book is great if you care more about the adventure of the story. Not so great if you like deep connections between characters.3.5 stars"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "04 1, 2013",
        "reviewerID": "AOKHFKWNKXZ13",
        "reviewerName": "Larissa \"from Larissa's Bookish Life",
        "summary": "Great!",
        "overall": 4,
        "reviewText": "I simply fell in love with Mr. Lanyon's writing when i read his Adrien English Mystery series and when I saw this new release from him on NetGalley I just jumped at the chance to read it.Elliot Mills is an ex-FBI who has turned back to his original job of History Professor after a shooting gone wrong left him with a bummed knee almost an year and a half ago.He lives by himself, doesn't really have a social life and hasn't dated ever since his not so amicable break up with former colleague and FBI agent Tucker Lance over an year before.Tucker and Elliot get thrown together when Elliot's father asks him to look into the disappearance of a student of his university and since the kid's father is high profile, the FBI is in charge of the case and Tucker is the agent on the job.Fair game is a great character driven romantic thriller. The plot and whodunit mystery is definitely more prominent than the romance, but you can't help but root for Elliot and Tucker to make it work and just admit that what they once had was much more than casual and that they can work together in the future.I LOVE Tucker! He is a hard-ass federal agent, but he is also lovable and not afraid to say he is wrong and to fight for what he wants. His and Elliot's relationship only works out because he is willing to put in the extra mile and let go of his pride.Elliot is a great leading man and I think i like him more because he was flawed. He made me want to punch him whenever he was being stubborn, but I definitely understood his reticence and difficulty in letting go. He and Tucker make such a cute and lovable couple, you can't help but swoon.The mystery in Fair Game is pretty awesome and I found myself trying to guess who was the perpetrator and being wrong all the time, I ended up getting it right right before Elliot and I felt that it was perfect. It didn't make me feel stupid and it also didn't make me feel smarter than the main character.All in all Fair Game is a fast-paced character driven romantic thriller featuring two very swoon worthy men and creepy mystery that will keep you on your toes. If you love a good whodunit and are into an awesome m/m romance that does not overshadow the over all story, this is the book for you.Originally Posted at Welcome to Larissa's Bookish Life {larissaslife DOT com}"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "12 21, 2010",
        "reviewerID": "A34M6ROJW6C0LX",
        "reviewerName": "Larry Tomaw",
        "summary": "Thriller love story...",
        "overall": 5,
        "reviewText": "The beginning seemed to drag along for a while but it slowly gathered momentum. It is as much a thriller as a love story. As for the protagonists, one is an FBI agent who has a love/hate/love relationship with an ex-FBI agent turned college professor who together try to find a serial killer."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 26, 2010",
        "reviewerID": "A11F5KW6QXHL8L",
        "reviewerName": "Lasha",
        "summary": "Fair Game is a winner",
        "overall": 4,
        "reviewText": "Josh Lanyon is on my must-buy list, so I was surprised when I got my new Kindle that for some reason I had missed this book when it was first published. I am glad I bought it now, because late is better than nothing.Premise: Elliott, is a retired FBI agent who after being injured on the job has taken up teaching at a small university. When a friend of the family's son disappears, the boy's parents ask Elliott to look into the matter. This brings him back into contact with his ex-FBI partner (and lover) Tucker. Their relationship at the beginning is strained to say the least. As the novel progresses and more young men have gone missing, Elliott and Tucker soon realize they have a serial killer on their hands whose man goal is to torment Elliott. The question is will Tucker and Elliott stop this mad man or will his game end with the death of one (or both) of them?I love Lanyon's mysteries. Some of the time I can figure out the killer, and sometimes I cannot. \"Fair Game\" was one of those novels where the person who I thought was the serial killer wasn't and the person who was the killer wasn't even on my suspect list! That takes true talent as I was raised on Agatha Cristie and Sherlock Holmes novels. The love story between Elliott and Tucker felt real, not forced and even though there was originally a Big Misunderstanding about why they broke up originally, their reunion made sense. Plus the secondary characters (some suspects) were three dimensional and complex, as always with Josh's books. All in all, this was a very enjoyable read. I highly recommend it."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "09 15, 2010",
        "reviewerID": "A13QTZ8CIMHHG4",
        "reviewerName": "LAS Reviewer \"The Long and the Short Of It Re...",
        "summary": "You Need to Read This Book",
        "overall": 5,
        "reviewText": "Originally posted at: [...]Fair Game by Josh Lanyon is a finely crafted mystery that keeps you guessing until the very end who the killer is, but most important, if Elliot and Tucker will live happily ever after.Elliot Mills does not realize how much he misses his past life as an FBI agent until he agrees to help a family friend find his missing son. His investigation finds him working with ex-lover Tucker Lance, and he discovers their relationship is far from over. As Elliot finds himself in the crosshairs of the killer and in protective custody, he and Tucker are finally forced to take a closer look at what drove them apart.Fair Game is more than a fast paced mystery. It is a journey of self-discovery for Elliot as he reconciles himself to his new life as a college professor and as he works to resolve his relationship with Tucker.The past relationship between Elliot and Tucker was intense and short-lived due to his injury, recovery, and subsequent departure from the FBI. It was apparent they had many unresolved issues, and Mr. Lanyon does not rush their reconciliation. Surprisingly enough, Tucker is the one who opens up and takes those first crucial steps toward salvaging their relationship. While Elliot has excellent social skills for handling superficial relationships, he often finds himself at a loss in dealing with the deeper relationships with Tucker and to some extent, his father, Roland. When he finds himself in danger of losing both relationships, he does not hesitate to take a hard look at himself and work to fix what is broken.Mr. Lanyon's characters are exceptionally well-developed, realistic, and three dimensional. Some of the best scenes in Fair Game are between Elliot and Roland. The two men are polar opposites and many of their interactions are laugh out loud funny. The glimpses into the academic life of a college professor are interesting and accurate. While there are plenty of suspects to choose from, Mr. Lanyon keeps the killer under wraps until the end, and the reader and Elliot piece it together at the same time.Fair Game by Josh Lanyon is a delightful mix of mystery, love, and humor. This is my first Josh Lanyon book but I can guarantee it will not be my last."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 6, 2011",
        "reviewerID": "A2ORHL4594GX7X",
        "reviewerName": "LibertyLuvr",
        "summary": "Wonderful!!!",
        "overall": 5,
        "reviewText": "I LOVED this book! I love pretty much anything Josh Lanyon writes, but this one was just fantastic! This book should be sold as a mainstream mystery/thriller. It's really sad that it won't be simply because the protagonist is gay. But the fact that Elliot is gay is really rather beside the point. It's a real credit to Josh Lanyon's writing skill and style that you feel you're not reading about a gay relationship (when it comes to his relationship with Tucker - which is not the main thrust of the story, but still vital), but just a relationship. You get so involved with Elliot, the person, and his prickly relationship with Tucker, that you don't think along the lines of it being gay vs. straight. It just IS. I love that. Josh always has the ability to draw characters so vividly, so realistically, you start to feel you know them. You really feel a connection and start to care about them. The characters in this book, especially Elliot, are no different.The story here, though...the mystery is what draws you in. You get sucked into the story from the beginning, and it doesn't let you go until you reach the end. I was truly surprised once the culprit was revealed. When I first read this, (I'm about to start reading it again for the third time.) I was still in physical therapy after a couple of knee surgeries. So, I really felt a connection to the pain Elliot was experiencing with his knee (though, mine couldn't compare to his practically being shot off!). Josh is a master of writing in the first person. He did it to perfection in the Adrien English books, and he does so here as well. You get an insight into a character like no other with this writing format. You feel what the character feels, you see what the character sees, and you experience things right along with the character. When reading this book, you understand just how much Elliot misses being an FBI agent. You feel his heartache at knowing that the career he loved is over. You feel his abivalence at being a college professor. You feel his resurrected joy and energy at delving into helping to solve the mystery of the missing students. You feel Elliot's hurt, anger, tension, and a deeper emotion he's not ready to admit is love when he meets up with Tucker again.There are some chilling moments, too. You get creeped out when Elliot comes home to his cabin and suspects he's not alone. You're willing Elliot to hurry up and get back to his car when he's on the college campus at night alone, retracing the steps of one of the missing students. And the ending...when you realize (I won't give away any details) at the same time what Elliot is realizing, when he's at the gala event and looking at...Well, you'll have to read it to find out. It's very chilling! I highly, highly recommend this book! I really hope Josh plans on a sequel!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 20, 2013",
        "reviewerID": "AJ949W8T9DACB",
        "reviewerName": "Lissy R",
        "summary": "A very good story",
        "overall": 5,
        "reviewText": "I've read a few of Josh Lanyon's books and so far this  one is my favorite. I liked the characters and story line. A great m/m novel that I highly recommend."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "03 19, 2013",
        "reviewerID": "A3L2QHQN6YFWS6",
        "reviewerName": "Lizzyb",
        "summary": "So good!",
        "overall": 5,
        "reviewText": "This book was fantastic! More mystery then romance and done so well. The author did an outstanding job with the story. There were multiple possibilities for the killer and although i had my suspicions I really wasn't totally sure until the end.Even though the author chose not to include an epilogue and ended the book very quickly (my biggest pet peeve) I still have to go 5 stars. Great story, great characters, well written, and at a great price too. I highly recommend it. Enjoy!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "09 11, 2011",
        "reviewerID": "AQKDEUK9Q76D1",
        "reviewerName": "L.L.",
        "summary": "Consider me hooked!",
        "overall": 5,
        "reviewText": "This was my first introduction to Josh Lanyon, and I was instantly hooked to his writing and his characters. This is a solid murder mystery that kept me guessing right to the end, and the characters are compelling and real. It's not often I read books that make me root for characters, much less want to strangle of couple of former hippies (one more than the other), but this one had me emotionally invested on what was going to happen next. One of the things I enjoy most about JL's books is that he tends to give the main character some sort of physical limitation, and he details it so well as to make it believable and easy to identify with that character, and thus make you root for them more. I've re-read it once already and enjoyed it even more the second time around, a sure sign of a great book."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 13, 2011",
        "reviewerID": "A1UUBO91ZGR0Z1",
        "reviewerName": "Love2Read \"Romance Reader",
        "summary": "A tastefully done love story",
        "overall": 5,
        "reviewText": "This was the first M/M romantic suspense I've read.I'm glad I chose Josh Lanyon's work, as he is a fabulous writer. The love scenes were tastefully portrayed,with the romance foremost and riveting. I fell in love with both of the heroes, and was delighted when theyresolved their differences and got their HEA."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "12 19, 2012",
        "reviewerID": "A3OIU04O6VGWC5",
        "reviewerName": "L. Williams",
        "summary": "Great romance/mystery combo!",
        "overall": 5,
        "reviewText": "I love a good mystery and this book had a great one along with just the right amount of romance! Loved it!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 25, 2010",
        "reviewerID": "A1RXR105ND8OSH",
        "reviewerName": "manutwo",
        "summary": "Amazing!",
        "overall": 5,
        "reviewText": "The most difficult reviews to write are for the books I really liked, because it's hard to analyze what left an emotion, so I must write a review based on impressions rather than on rational, critical thoughts.First of all, I'll never stop being impressed by Mr Lanyon's writing, it's at the same time a real pleasure and a never-ending surprise. I can't count the number of times I had to re-read a paragraph or a few lines of dialogue because they were too good.I liked the cast of characters. I enjoyed the way Elliot and Tucker were forced to meet again and how their first conversations seemed like the tip-toeing of elephants. It's always fascinating to watch estranged people who have to interact again (even if it's usually painful), because the intimacy they had is undeniable and it can't be suppressed and the situation was rendered beautifully.We had only Elliot's point of view, so we were closer to him, but it's Elliot who, at one point, acknowledges Tucker's reason for the way he behaved after Elliot's injury. The honesty and understanding made me feel an incredible admiration for him (and he's a fictional character!)I also liked the mistery. At one point I was so sure I had the murderer! Big surprise there and I'm not referring to whom the killer was, but to whom he wasn't, if it makes sense.5 star. I hope Elliot and Tucker will return. Please!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "01 28, 2012",
        "reviewerID": "A2I8JEUY9G2J8B",
        "reviewerName": "Michael Booker",
        "summary": "Very \"Fair Game",
        "overall": 5,
        "reviewText": "In Josh Lanyon's riveting, gay-themed mystery, \"Fair Game\" former FBI agent and now current history professor, Elliot Mills, finds himself wrapped up in solving the case of a missing boy, who is a student at a private Washington university where Elliot teaches. Because of his history as a Special Agent, Pauline Baker, the mother of the disappeared student, Terry Baker asks for Elliot's help in gathering clues as to the whereabouts of her missing son. Elliot reluctantly agrees to do so, only because Pauline is a family friend. Coincidentally, Elliot's former boyfriend, Tucker Lance is also assigned to Terry Baker's case, which stirs up resentful memories for Elliot, who despite his anger toward the hard-edged Tucker, is still attracted to him. As Elliot becomes more involved in the case, as well as the similar disappearance of another male student, Elliot himself becomes the target of a killer's vile cat and mouse game.Lanyon is superb at creating compelling, believable, and fully realized characters. Readers automatically connect with Elliot, a former FBI agent, who bitterly had to resign his position, after a brutal altercation with an assailant years ago left him with a severely damaged knee and the incapability to work in the field. Lanyon does a good job at illustrating Eliot's plight over the mundane routine of being a college professor and wishing he was still an agent. It does not help that his former lover Tucker is involved with the case, which means that Elliot is forced to interact with him, even though he does not want to. Lanyon also does a good job with the verbal matches between Elliot and Tucker. Both are strong, stubborn men, almost incapable of lowering their emotional guards and yet are irresistibly drawn to each other. It's very interesting to see the dynamic of their interactions change though the course of the novel, as the danger becomes more real.What makes \"Fair Game\" really work is that it really is a mystery. I've noticed in a lot of gay-themed mysteries, the stories are really just thinly-veiled romances with a very easily solvable mystery thrown in. \"Fair Game\" is actually a really involving, detailed, and intelligent mystery that will you really keep you guessing. Another thing that really shines about this book is the suspense works two ways: the reader is urgent to find out the identity of the villain (who was pretty surprising) and also the suspense of Elliot and Tucker's reconciliation. If you're looking for a good mystery, \"Fair Game\" is a great pick.Michael S. BookerAuthor of \"Anomaly"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "11 7, 2010",
        "reviewerID": "A320TMDV6KCFU",
        "reviewerName": "MNix",
        "summary": "Fair Game",
        "overall": 5,
        "reviewText": "Professor Elliot Mills used to be an FBI agent. He likes teaching, but doesn't hesitate to get back into action when a student disappears and the case seems suspicious. Elliot's ex-lover, FBI Agent Tucker Lance, is working the case and doesn't want Elliot around, regardless of his experience. Elliot and Tucker find it difficult to be in the same room together after how badly their relationship ended, but soon Elliot's making more progress than anyone else on the case. As Elliot and Tucker try to make peace with their past, Elliot becomes the killer's next target.While I do masochistically enjoy the angsty romantic hell Josh Lanyon usually puts me through while reading his books, Fair Game has a little less gut wrenching heartache than his norm, and I loved it just as much. Lanyon has the expert ability to write realistic, suspenseful tales. Countless times throughout Fair Game I found myself pegging the villain only to realize I was mistaken yet again. The plot is not contrived or obtrusive, and it kept me riveted to each intriguing page. Along with an exciting storyline, Fair Game stars two very appealing men. Excellent characterization brings Tucker and Elliot to life. Despite the fact that Elliot is a professor now, he's a detective at heart and he plays that role amazingly well. He and Tucker make a terrific crime fighting team. Tucker has regrets, except his pride gets in the way of making things right. While they have a lot in common and are compatible in and out of the bedroom, it's that same common ground that causes strife between them. Sex between Elliot and Tucker is hard, hot, and meaningful, but it's not the focal point of their story. Fair Game is a novel of suspense with well-penned eroticism. It's the next great story in Josh Lanyon's arsenal of well-written gay suspense novels.NannetteReviewed"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "06 22, 2013",
        "reviewerID": "A1K69BBLY0NVOW",
        "reviewerName": "nowyat",
        "summary": "An AMAZING writer...",
        "overall": 5,
        "reviewText": "I enjoyed this book so much.  It had the romance, (I am all about romance), the suspense, the humor, the action...  Everything necessary for a good read and it provided a deep insight into all the characters thoughts and motives.  So often when you get toward the end of a book it seems as if an author gets tired of writing and does what they must to wrap it up.  Not this one.  This was one of the most exciting final chapters of a book that I have ever read!  I peeked at about halfway through to see who the killer was, because ahem, studies show that spoilers improve your comprehension of the material.  Yep.  But you will enjoy it either way. I am off to look at other books by this author now."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 8, 2010",
        "reviewerID": "A3VTW2X88WLXSJ",
        "reviewerName": "rdafan7",
        "summary": "Perfect blend of Mystery and Romance",
        "overall": 5,
        "reviewText": "Josh has woven a thriller that grabs the reader and does not let go until the end.Not only is the book full of suspense with the right balance of romance, but it is also well-plotted (as expected) and loaded with plenty of mis-direction. You also are introduced to another terrific bunch of characters. I adored Elliot, Tucker, Roland and their complicated relationships.Fair Game draws the reader in with the picturesque setting of Puget Sound, the tense/scary nature of the plot and the author's beautiful, evocative prose (as usual). But it is the book's characters, their relationships, and the mystery that unfolds that make this work a standout.  Waiting for a sequel!....Highly Recommended!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 2, 2014",
        "reviewerID": "A3IQYVBQXZ7GXW",
        "reviewerName": "Rosa, really",
        "summary": "Another fantastic JL read",
        "overall": 4,
        "reviewText": "This was the second time I've read this book. Shamefully, I remembered nothing but the beatnik dad - he refers to way too many men as &#34;cat&#34; not to remember him - and that it had a generally happy ending. Clearly I read way too many books last year if I forgot a Josh Lanyon novel. I read 537 books in 2013 and I'm pretty sure that's a low estimation. I know, it's a sickness.Here&#8217;s another sickness: Why do I feel a sense of pride that Elliot was shot, in the rain, at Pioneer Courthouse Square, in Portland, Oregon? I should be a tour guide &#8211; that&#8217;s right, folks, Portland is so great FBI agents get shot here too! And in such a pretty area! Isn&#8217;t that wonderful! Followed by: Hometown pride, GO&#8230;.oh that&#8217;s right, we don&#8217;t have a sports team. But we do have some very tall trees.This section of the review is entitled: Elliot Mills, you giant sack of poo.Elliot, buddy, I mean it sincerely when I say I love you but if you say there&#8217;s nothing but sex (and Nissans) between you & Tucker one more time, I&#8217;m planning on borrowing the nearest penis & making violent love to him myself. You ask yourself, &#34;how the hell could you be homesick for a place that had never been home?&#34; Um, cause you love him? Cause he is your home? Maybe? DUR. You seem to come to your senses by the end of the novel, but I&#8217;ve got my eye on you, buddy. (Seriously, though, I lurve you.) And ease up on all the Civil War music; that cannot possibly be healthy for anyone.This section is entitled: Tucker Lance, I want to climb your horny gingerness like a howler monkey.You make my down-belows sparkle. That&#8217;s pretty much it.To both boys: Communication is not just for cry baby pee-pants anymore, ok?That&#8217;s right, adults do it too. Listen to teacher now&#8230;.Elliot, you should learn by watching Tucker. He may be a tough FBI agent who sucks all the air of any room he enters (with his utter ginger hotness), but he&#8217;s clearly willing to open up and share his feelings with you. Even if it takes another near death incident and about 75% of the book for him to do it. However, this is something you both need to work on. Like Dr. Phil says, do you want to be right or do you want to be happy? Something to think about, hmm? Dismissed.That said, Josh Lanyon is fantastic at portraying a serious lack of communication. It&#8217;s something I find intensely annoying when done by some (many) authors, because it generally goes something like: &#34;Hey, dude, I really need to expl&#8212;oh, look. The vampires are attacking again.&#34; They&#8217;re just simple minded distractions created by an author to keep heroes apart. They have no actual meaning beyond extending an already weak novel. Lanyon creates two strong-willed men who are afraid to openly communicate, afraid of the answers they might hear. Like Adrien says in &#34;Death of a Pirate King.&#34; &#34;I just didn&#8217;t ask the questions I didn&#8217;t want to know the answers to.&#34;Another thing Lanyon does well? Sexy sex sex. Thank you, Mr. Lanyon, for not adding the ever popular &#8220;I need to stroke my ding dong in the shower cause I&#8217;m thinking about my one true love & the author thinks it&#8217;s way too early for us to get it on.&#8221; Instead we get ha-ta-ta-tot-hot dreams & memories of sex with Tucker: &#34;He kept remembering the weird, unlikely pleasure of being rolled onto his face and being [made violent love to] to within an inch of his sanity by someone bigger and stronger and possibly even hornier than himself.&#34; I WANT TO GO TO THERE.My favorite part of the book is the juxtaposition of the investigation of Elliot and Tucker&#8217;s feelings for each other and the investigation into the disappearance of two young college students. Elliot, Tucker and the reader spend the novel wondering what happened to these young men. Did they just take off and abandon their loved ones? Or was it something more sinister? Similarly Elliot and Tucker scrutinize their own feeling for each other &#8211; both feel abandoned by the other. Both feel that the other disappeared from their lives. Elliot, especially, uses the investigation as a way to explore the loss of his previous life and whether the end of that life means the end of his relationship with Tucker.I still have several questions about the mystery though. Which I can't list here without ticking people off about spoilers.I&#8217;m giving this book a very solid 4.25 stars, rounded down to 4. This is an excellent novel and I highly recommend it&#8230;but for me it didn&#8217;t hold that gut-punch of recognition I felt for the Adrien English series. Now that I&#8217;ve read that, I&#8217;m afraid every Josh Lanyon book will have to compete with it for first place in my heart."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 10, 2010",
        "reviewerID": "A1ARJBC8VD5P8P",
        "reviewerName": "R.Parklane",
        "summary": "Bravo Josh!",
        "overall": 5,
        "reviewText": "Bought it and read it within the same day. Could not put it down once I started. Love the mystery with its depth and well thought out plot. Never suspect the villain as the mystery evolves into something more sinister which I never anticipated. As for Elliot and Tucker, these 2 guys really grow on you. Equally alpha males, these two complex characters really have to work out their misunderstandings, wariness and trust but not before some explosive exchanges. Josh has expressed the romance angle so well even if the mystery is the focus. As another reviewer says, Fair Game is indeed a perfect blend of mystery and romance. As in any Josh's book, sex is kept to the right balance which I highly appreciate. And I also enjoy the interaction between father and son. The gritty ending has me holding my breath. And like another reviewer (Sirius) says I love it that Josh gives more closure to the guys' commitment to each other and not leave it to our imagination. Not that I am complaining but I just want to enjoy it in words. Highly recommended and waiting most impatiently for Josh's next effort!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "10 24, 2010",
        "reviewerID": "A1UPON7D8FZK8B",
        "reviewerName": "Sarah \"Rain on the Roof Reviews.",
        "summary": "Cool read.",
        "overall": 4,
        "reviewText": "I've not read Josh Lanyon in a while, so this was a cool pick up. I always enjoy Josh's deft plotting and smart characters. In Fair Game he's created an ex cop who is forced to give up a career he's loved and take up a more desk bound job. The dynamics between Eliott and his lover Tucker were pretty tense and steamy, although at times I wished Tucker was featured a little more prominently. I think the focus was more on Elliot's journey and the mysterious disappearance of the young men, kinda like his scooby swan song. Cool read and worth checking out."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "12 15, 2013",
        "reviewerID": "A37LOFF4GEYZ13",
        "reviewerName": "shacary \"Shacary",
        "summary": "buy anything  Josh Lanyon writes",
        "overall": 5,
        "reviewText": "Fair  game,  was  my introduction to  Josh Lanyon's  works.  He  writes thoroughly believable characters , with depth and  intelligence, The  fact that  they are  gay is  ancillary.  the  romance  portion of the story is  also  in line  with  reality, lying  in  actual male parallels.  The  mystery in the stories  is convincing, convoluted , and  for once I  am  left  wondering  who  the  culprit is. It lead me to  buy more  and  more of his  works,. to date  I have learned to  &#34;buy anything  Josh Lanyon  writes&#34;. Kudos"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 8, 2010",
        "reviewerID": "A19GJX6TTSK0C0",
        "reviewerName": "Sirius",
        "summary": "Fantastic!",
        "overall": 5,
        "reviewText": "Enjoyed every moment of this book, as other reviewer had said, mystery is solid (I was so so happy to be fooled about the identity of the villain) and characters are well drawn and likeable. And I really loved the ending, loved that writer allowed a bit more warm and content feel than he does in some of his other books, often he leaves a lot to imagination and it is good, but I enjoyed hearing characters actually say on page what I wanted them to say to each other."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "07 26, 2013",
        "reviewerID": "A139PS228BXDCX",
        "reviewerName": "Spifette \"mudluvsmacker",
        "summary": "Mystery, action... action and well drawn characters",
        "overall": 4,
        "reviewText": "I've now read several of Josh Lanyon's books but Fair Game was the first and is one of my favorites.From the main character and spreading out, all are well drawn with their own traits, attitudes and way of talking. Elliot and his father, the way they interact and know each other so well in some ways and barely at all in others - I think most people can relate to that in various relationships we all have.Elliot and his students and colleagues, the janitor (mmm hmmm) and of course, Tucker.I say of course and... of course, you'll understand once you read this book.*Slight Spoilers in regards to settings and character bits*The story opens on a college campus, bringing with it all of the things we love and find annoying about such a great place, full of experiences, memories, familiar frustrations and celebrations.All of the settings - the college, the mother's house, the cottage, and the lake (mmm hmmm) - are very well described, from layout, colors, atmosphere and scent. I love when you can so easily imagine the physical surroundings. To me, this always makes the conversations, the encounters crackle and spark that much more, upping the intensity, emotion and anxiety. Mix these in with naturally flowing dialogue, natural actions and reactions and you have an excellent read.Back to that lake, that is one of my favorite scenes in the book.  **stop reading here if you don't want even a bit of a spoiler** It tells us a lot in a very short amount of time set against the backdrop of one of the more tension ridden happenings. The danger level is upped, we're asking more questions about why and who, and we get the clearest picture yet of how things were and are between Elliot and Tucker.  So well done.I would highly recommend this as the first of Josh's books to read if you are looking for the place to start. But be forewarned, this won't be your last. He does such an excellent job of presenting every important part of a good story in very real and relatable ways, nothing seems forced or fake. I would say take a chance but it's not even a question:  it is well worth it. Enjoy!!!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "12 20, 2011",
        "reviewerID": "A1M2Z2Z94I2LXL",
        "reviewerName": "Sylvia",
        "summary": "Great story",
        "overall": 5,
        "reviewText": "I loved the setting, the mystery, the suspense, the romance. Very well and vividly written. The characters are very convincing, never flawless but so real."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "09 7, 2010",
        "reviewerID": "A284X9LZAOPJ0E",
        "reviewerName": "T. Hall",
        "summary": "Fair Game is an excellent read!",
        "overall": 5,
        "reviewText": "Just the right mix of suspense, mystery, romance and intellect.  Set in and around Seattle and the Puget Sound islands, the emotional and physical isolation of the main character is a little easier to accept than in most metropolitan areas. Prof Elliot is a great mix of smarts, compassion, curiosity, cynicism and hope.  FBI SA Tucker is tough but not as emotionally distant as we're first led to believe.  Beguiling.  Intriguing.  Honest.I liked the character development, the evolution and process of growth for both men.  Even the secondary characters had enough charm to wonder at their stories.  John Lanyon is a great story-teller, as attested to by his many literary awards.  Highly recommended."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 16, 2010",
        "reviewerID": "A2RY0BUMAMVFDD",
        "reviewerName": "tmsmith",
        "summary": "A surprising \"whodunnit",
        "overall": 5,
        "reviewText": "4.5 Stars!  This was my first book by mystery writer Josh Lanyon.  I can now see why he is considered to be at the top of his field and has won numerous awards.The mystery begins immediately when a student goes missing.  And then another.  As a former FBI agent, Elliot becomes involved as a liaison between the university and the FBI agent working the case.  Interestingly enough, said FBI agent turns out to be Elliot's former lover, Tucker.Lanyon proceeds to dangle possible suspects and motives.  I was sure I knew the \"whodunit,\" and was wrong.  I love it when an author can do that!Mystery aside, I also really enjoyed the romance between Elliot and Tucker.  They had a previous relationship that ended abruptly.  Working closely together on the missing student case gives them a second chance to see how and why they went wrong.  I love how Lanyon uses dialogue to really get inside his characters heads.I probably would have liked to see more of Elliot and Tuckers romance, but that's just me!  Very enjoyable book, which I highly recommend!!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 12, 2010",
        "reviewerID": "A12XK84U40NTXY",
        "reviewerName": "Tony Squared \"Book Freak",
        "summary": "A Game Winner",
        "overall": 5,
        "reviewText": "Fair Game\" is another winner from Josh Lanyon. It's a well-crafted and action-packed mystery of course, involving the disappearance first, of a student of college professor Elliot MiIls, and then other young men from the college campus where he teaches courses in History and Film. Mills has a history of his own, as a former ambitious \"hotshot FBI agent\" who retired from the Bureau after a receiving crippling gunshot wound. When asked by the parents of his missing student to act as their \"consultant\" in dealing with the FBI, Mills finds himself dealing with the formidable, handsome Agent Tucker Lance, with whom he has a personal history. Because of the nature and outcome of their past association, neither man is at all happy to have to work with one another.The college setting, which Lanyon renders in characteristically believable detail,allows him to take some fun satirical jabs at pretentious academic and artistic gobbledegook, not to mention the behavior of vapid young coeds trying to butter up the professor. As in Lanyon's other stories, someone is always cooking, in this case a delicious saute of mushrooms in butter. Before too long, someone should be able to compile a Josh Lanyon cookbook.Will Elliot and Tucker find a way to cooperate without constantly making each other angry because of the unresolved issues in their mutual past? Will Elliot survive the increasing violent anonymous threats he receives? Lanyon skillfully ratchets up the suspense in both areas.For those readers new to Lanyon, this writer creates exciting physical action sequences as good or better as anything in the Jason Bourne series. And the bedroom action is pretty exciting as well. But Lanyon also touches on a theme he has investigated in his other work, notably the Adrien English series and also in his muy caliente, muy apasionado \"Mexican Heat.\"  How can two strong-willed males get past anger, pride, and misunderstanding to find a balanced relationship? In \"Fair Game,\" Lanyon suggests the recipe includes a dash of humility, as well as trust and love. Don't wait another minute to read this excellent story."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 26, 2010",
        "reviewerID": "A2YDCWD319EP9F",
        "reviewerName": "Tracy Francis \"Avid book reader",
        "summary": "Perfect",
        "overall": 5,
        "reviewText": "Fair Gameis a masterfully crafted \"whodunit\" and steamy romance with strong, male leads all rolled into one delicious tale.It just doesn't get any better than this."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "07 6, 2013",
        "reviewerID": "A2R0CEL1BQUX9X",
        "reviewerName": "Urbanista",
        "summary": "my least favorite Lanyon",
        "overall": 3,
        "reviewText": "Chilly, judgmental hero. I cut him some slack for severe disruptions in his life, but ugh. Racial stereotypes. Hippy stereotypes. Academia stereotypes. Artist stereotypes. Repulsive neighbor--i cant believe the hero was so stupid about this sleazebag! Lack of contact between between MCs,"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "05 18, 2013",
        "reviewerID": "A2ZZ0SH8SLD700",
        "reviewerName": "Ursus Jr. \"retired and loving it",
        "summary": "Josh gets you turning the pages again",
        "overall": 5,
        "reviewText": "While it took longer than usual for me to accept the potential relationship between Elliot and Tucker, the \"who done what to who and why\" kicked in from the beginning.And how did Josh know I've a penchant for hunky red-heads?"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "08 24, 2011",
        "reviewerID": "A16S962P4J5YEX",
        "reviewerName": "Vanessa",
        "summary": "Fair Game is Amazing!",
        "overall": 5,
        "reviewText": "Josh Lanyon is an amazing writer. I love his books and this has to be one of my favorites. He does an incredible job of making his characters real. Each had a good balance of strength and flaws. I love the humor sprinkled throught out. Elliot's snark (internal or otherwise)often made me chuckle. How he handled the reunion with Elliot and Tucker was great and believable. The mystery was good. Josh is a master!"
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "06 11, 2014",
        "reviewerID": "A210J3YIBJI0DQ",
        "reviewerName": "VL",
        "summary": "great mystery & love story",
        "overall": 5,
        "reviewText": "It's really good read. I can just read it over and over. This must be my 7th time probably. Elliot is a lovely character."
      },
      {
        "asin": "B003U89S66",
        "title": "Fair Game",
        "reviewTime": "04 18, 2013",
        "reviewerID": "A2T8RB3W3OVD21",
        "reviewerName": "Winship75",
        "summary": "Very Good",
        "overall": 4,
        "reviewText": "Fair Game was quite good.  Lanyon is excellent at showing the relationship between two men, particularly when one is in law enforcement and the other isn't.  I loved the way Elliot and Tucker behaved with each other.  Their relationship ended on a poor note and, clearly, neither man had come to grips with it, so watching them both struggle with their feelings for each other (anger, lust, disappointment, etc.) was great to read.  The mystery didn't hold my interest as much as the relationship, but I liked that this book had some racial diversity in the secondary characters, something you don't see much in m/m books (or at least I don't)."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 5, 2014",
        "reviewerID": "A1EMKDBN5TL47U",
        "reviewerName": "A. Roberts \"Luvto Read'nEat",
        "summary": "Start to Finish a Lot of Change",
        "overall": 3,
        "reviewText": "I loved the beginning sections of this book; the author Chris Dolley certainly has a gift for words, humor and self-deprecation to keep one grinning ear to ear. However, after our hero succeeds in moving animals and family from one country to another, the dramatic comedy took another turn and it almost lost me. I wasn't able to finished the book in its entirety, (without reading ahead to the end of each chapter). The other plotline was stolen identity and could have made a very good story but it got bogged down into too many details for me to maintain an interest.  But the first section (trip to France) was truly a feast of words and adventures with I truly enjoyed."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 25, 2011",
        "reviewerID": "A3ROUG6JR4LCI5",
        "reviewerName": "Brenda Grate",
        "summary": "Laugh Out Loud Funny",
        "overall": 5,
        "reviewText": "I really enjoyed this book. Dolley has a great style that is both comfortable and funny. He makes you feel like you're sitting around enjoying a glass of wine while he tells you funny stories about his life. I enjoyed it so much I read many passages out loud to my husband. Be careful if you have a beverage while reading, you might want to pause while sipping. Great storytelling. I look forward to more books by Chris Dolley."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 11, 2013",
        "reviewerID": "AYBAACXH9UGIW",
        "reviewerName": "Caseyannie",
        "summary": "One man's fight",
        "overall": 4,
        "reviewText": "An uncommon man against injustice with no help from officials more interested. In maintaining status quo.  While battling in-laws,unruly animals and the road department."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 8, 2014",
        "reviewerID": "AITRKJNGWXRDF",
        "reviewerName": "colesen",
        "summary": "Funny and Enterteining",
        "overall": 4,
        "reviewText": "I like stories where people do things I think I'd like to do but I don't heave enough money or courage. Chris Dolley's adventures moving his household from England to France is told with lots of self-effacing humor. The only reason I gave it four stars is because I found the step-by-step telling of his encounter with a identify theft too involved. All in all an entertaining view into the life of a new expat.I was disappointed that the narrator is not British."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "04 4, 2014",
        "reviewerID": "A2DMROV9MIMSDU",
        "reviewerName": "deb whisenant",
        "summary": "hilarious, mostly",
        "overall": 4,
        "reviewText": "He SAYS that he is English, but his sense of humor was WAY TOO American for that to be true. At the beginning of the book Mr. Dolley found the humor in everything: the customs officials, the bureaucracy of the French, the plumbing. He really felt the rediculous-ness of the everyday situations in a new country where language is only half of the barrier to peace and calm. But when his identity is stolen, although he TRIES to put up a good front, he didn't seem quite so amused by incidents and events. Oh, the story line was interesting enough to convince a person NOT to move to a foreign country, but his heart was NOT so much into humor (more into anger, possibly) any more. Read it knowing that one CAN find humor in all thing human, but that SOME things are NOT as funny as others. (Four-country legal work , anyone?)"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "08 23, 2010",
        "reviewerID": "A2VZP50FSYD6CO",
        "reviewerName": "drebbles",
        "summary": "Has some good moments but a bit too scattered",
        "overall": 3,
        "reviewText": "When Chris and Shelagh Dolley move from England to France, everything that can go wrong does go wrong. But their problems with their animals, plumbing, cars, and language barriers seem small when they discover someone has stolen Chris's identity - and their life savings. The case turns out to span four countries and the police in each country are of little help. Chris decides to investigate the case himself, along with the help of Shelagh, her 80 year old mother, and their puppy.\"French Fried\" is an odd mixture of a book. The first part of the book is mostly humorous filled with the misadventures of moving to France. At times it is laugh out loud funny and at other times the humor is over exaggerated and forced as if Dolley is trying too hard to make readers laugh. Some of the things that happened weren't their fault and those are the funniest moments in the book. Other events that happen (mostly because of Chris Dolley's male stubbornness) aren't so funny and make you wonder about the intelligence of both Chris and Shelagh. Halfway through, the book takes a more serious turn when Chris discovers his identity has been stolen. At that point the book becomes like a mystery novel as Dolley struggles to get various police to help him and finally strikes out on his own. Readers will follow the clues as Dolley does and no doubt be surprised by the various twists the story takes. There is still some humor there, but for the most part Dolley treats it with the seriousness it deserves. This is perhaps the best part of the book - the forced humor is gone and Dolley's fears, frustration, and anger clearly come through.\"French Fried\" is a bit too scattered but has some interesting moments.Disclosure of Material Connection: I received this book for free. I was not required to write a positive review. The opinions I have expressed are my own. I am disclosing this in accordance with the Federal Trade Commission's 16 CFR, Part 255: \"Guides Concerning the Use of Endorsements and Testimonials in Advertising."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 10, 2014",
        "reviewerID": "A1G1PWJWIVW6UR",
        "reviewerName": "Gisella Patharkar \"plant and photonut",
        "summary": "Simply charming",
        "overall": 5,
        "reviewText": "This British couple decides to retire in a small village in southern Spain. They learn to adapt to their new way of life, at time truly relishing what the place has to offer, They make friends and on a few occasions they get entangled in comic situations. A book written in good humor and just very enjoyable."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 10, 2013",
        "reviewerID": "A1SEG7BE4L5CXH",
        "reviewerName": "James E. Uberti \"Nutmeg Reader",
        "summary": "FrencH Fried",
        "overall": 1,
        "reviewText": "Haven't finished it yet; not sure I will. I got the feeling that this would be a book of never-ending calamities, where our protagonist(s) had to deal with yet, another problem..I chose this book because the synopsis held promise. Maybe I'll give it another chance."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 10, 2014",
        "reviewerID": "A3NTMLGU86P4CO",
        "reviewerName": "Janet Hughes",
        "summary": "Not your usual memoir :-)",
        "overall": 4,
        "reviewText": "Chris Dolley delivers real belly laughs as he describes his emigration to France with his wife, a neurotic horse, a giant recidivist puppy and teo warring cats. The move, the house and its eccentricities (and there are many), the local people and of course the famous French Bureaucracy fill the pages with delight and at times despair. I didn't engage as well with the whodunnit  part of the story, but that's just me, and not a reflection on Chris's writing. Keep them coming Chris ... when's the next one due?"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "06 9, 2013",
        "reviewerID": "A1XUWHU092WO0L",
        "reviewerName": "Jeanette",
        "summary": "Charming and hilarious",
        "overall": 5,
        "reviewText": "This family moved from England to France and oh the obstacles that met them on their way. Each problem was told with much gusto which made me laugh out loud.The family next meets the calamities of the house and each problem presented many more problems. Their car purchase entailed more red tape. Then to make matters worse they were in the mist of identify thief. The language barrier created occurrences that left me in side splitting laughter. Great book hope you have the opportunity to read. Thanks"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 4, 2013",
        "reviewerID": "A2KJR14CE39W50",
        "reviewerName": "JeffKnowsStuff",
        "summary": "Charming and addictive...",
        "overall": 5,
        "reviewText": "Wonderfully written account of his move to France and the traumas associated with it. Hilarious and inspiring, anyone who has traveled, has a dog, or a mother-in-law will relate....."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 24, 2013",
        "reviewerID": "AHYDGX20GHBJJ",
        "reviewerName": "Joan Dee Sizemore \"Booklover",
        "summary": "A Move to France Becomes a Comedy of Errors!",
        "overall": 5,
        "reviewText": "A great read that kept me laughing! This fast paced story looks at cultural differences and the problems encountered by Dolley and his wife when they traded their farm in Ireland for one in France, including transporting their animals, buying a car and more. Enjoy!"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "05 4, 2013",
        "reviewerID": "A1TNVLKGO8YGI1",
        "reviewerName": "Kathy Jordan \"Kathy Jordan",
        "summary": "French Fried is hilarious",
        "overall": 5,
        "reviewText": "The title is it's own review and as we follow this family who thinks life will be better for them in the French countryside than in suburban England, we can only lay down, hold our sides and laugh until we are embarrassing ourselves. The story and writing are first rate and lead the reader on a merry chase that just happens to be what really happened to the Dolley family."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 4, 2013",
        "reviewerID": "AJC3SNHKR1DBE",
        "reviewerName": "Kl Polovina",
        "summary": "Liked, but was confusing",
        "overall": 3,
        "reviewText": "I generally like this kind of book.  This one got confusing in the beginning and end.  Fun book to read though."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 21, 2013",
        "reviewerID": "A2PB8POD9WCQX0",
        "reviewerName": "Lmhufana",
        "summary": "Interesting and fun",
        "overall": 1,
        "reviewText": "A cute story about the adventures of moving  to a country where you know very little of the language, customs or law.  Somehow  potential disasters are converted to an adventure"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 30, 2014",
        "reviewerID": "A3131JEJYVBJO",
        "reviewerName": "Marie&#39;s Read \"ME Griffin",
        "summary": "Marie's Read",
        "overall": 3,
        "reviewText": "It certainly has some laughs, especially for anyone who has moved with animals.Being an American, a great deal of the French/Spanish banking and other \"forms\", etc., were very confusing. The French neighbors sound lovely, but given all the other \"governmental\" mess, it is surprising anyone ever manages to immigrant there.It's a nice little read, but I admit to skipping every few pages when it came to \"The Detective Caper\".  I managed to keep up and even concluded the culprit correctly.I believe the British would probably enjoy it more."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 8, 2014",
        "reviewerID": "A20W0ALUJMJ2F8",
        "reviewerName": "mizjean \"jean",
        "summary": "exhausting",
        "overall": 2,
        "reviewText": "I am totally exhausted trying to make sense of this book. It is a long drawn-out and disjointed storyline, with no clear picture of the main characters, except we know that they can't speak French, or cope with a series of unending of and confusing problems. I wonder why I bothered to read it to the end."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "03 14, 2013",
        "reviewerID": "A303G268R4ZX9P",
        "reviewerName": "M. L. Stevens \"mile-a-minute",
        "summary": "Vicarious Moving",
        "overall": 4,
        "reviewText": "This was a great armchair traveler book....moving to a foreign country with out all the work!  Written well, many twists and turns, hilarious at points.  I have English friends/family so appreciated the cultural differences."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 2, 2014",
        "reviewerID": "A1JDQLPJG7F9YR",
        "reviewerName": "Ordinary Person",
        "summary": "Very funny once on a roll",
        "overall": 4,
        "reviewText": "There were times when the author was reaching a bit and fell just short of funny, but when he got into his groove, the book was extremely enjoyable.  While the fraud was a serious theme that stitched everything together, the book is really more a series of very human vignettes that everyone can relate to at some level."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "09 17, 2012",
        "reviewerID": "A27CXQGDPFEHJ2",
        "reviewerName": "Patricia Rice",
        "summary": "Clever",
        "overall": 4,
        "reviewText": "Dolley is a witty writer with a good eye for the humor in even the most uncomfortable situations. For the memoir reader, this is fabulous material."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 14, 2014",
        "reviewerID": "A1CL2KGZHQOESD",
        "reviewerName": "P. Block \"Braves Fan",
        "summary": "Hilarity about a Terrible Experience in Moving Country to Country",
        "overall": 4,
        "reviewText": "Thank goodness the author has a sense of humor and is British. Were he American, this move might be listed in the annals of murder and death in an Age when everyone who can walk has the right to bear arms and shoot when confronted. But instead this tale by an Englishman wanders from one ridiculous scene to the next, told with acerbic humor and a wry voice that exposes the best in defining human foibles. Indeed, the guffawing by this reader while enjoying the tome elicited loud (sometimes alarming) \"What's WRONG, Mom???\" responses from those in the next room. It was difficult to admit the story and mystery had come to an end. The author surely has more fabulous takes on the ensuing years of their lives in France. Bring us more, please. And the only reason for not giving five stars (Is there not a 5 1/2 category???) is that he tries sometimes to be a little too funny when a slow time emerges in the tale. Thoroughly enjoyable, recommended, and laugh out loud--go ahead, it's good for you!"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 1, 2013",
        "reviewerID": "A4ZT5P0CO6NZU",
        "reviewerName": "rvtraveler",
        "summary": "French Fried",
        "overall": 4,
        "reviewText": "Actually this couple kind of defy description.  They are seemingly intelligent, but then get caught up in preposterous situations. I think liked it, but also did lose patience with the different situations.  But descriptions of the countryside gave me a feeling of being there and there was a great feel for the country.  But I think would have left the horses home.!!!"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "08 25, 2010",
        "reviewerID": "A1N1YEMTI9DJ86",
        "reviewerName": "S. Schwartz \"romonko",
        "summary": "Very Funny - all the way through",
        "overall": 5,
        "reviewText": "This is an exceptionally funny and entertaining book.  It outlines one couple's move to southern France from England in about the year 1995.  This particular couple not only moved themselves but an entire menagerie of animals including a lurcher puppy, 2 horses and 2 cats.  The book outlines their exploits during their move as well as all the stuff that happened after they actually finally got into their home.  The description of them trying to get their vehicle \"tax license\" as it's called in France was very funny.  Then to top it all off they end up in an identity theft scam that threatens their life savings.  I couldn't put the book down.  It was captivating and I loved the writer's descriptions of his own and his wife's characters.  This is usually not the type of book that I would read, but it was made available to me read and I'm glad that it was.  I highly recommend it."
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "01 15, 2014",
        "reviewerID": "APDMW4T7G8V4N",
        "reviewerName": "Terry",
        "summary": "we've been there and done that!  what a great book",
        "overall": 4,
        "reviewText": "The sense of humor required to start life in a new country with a different language is truly shown in this book.  Found some of the French inserts a little difficult but loved the story!"
      },
      {
        "asin": "B003UBTVSI",
        "title": "French Fried: one man's move to France with too many animals and an identity thief",
        "reviewTime": "02 16, 2014",
        "reviewerID": "A39529JJJEEDP5",
        "reviewerName": "Whistlers Mom",
        "summary": "England invades France!  Just like D-Day, but funnier!",
        "overall": 5,
        "reviewText": "I bought this one on sale, but It's worth full price if you like to laugh.  There are so many books by Brits moving to France that you have to wonder when the French will start moving to England to get away from the English.  That said, this is one of the better efforts. I was struck by the trouble and expense of getting their horses to France, but if you are a horse lover maybe it will make sense to you.  Very funny observations of French country life and reactions to the newcomers.  The topper is the story of the identity thief.  I won't spoil it by revealing the guilty party, but it could certainly happen to any of us."
      }
    ]
  ]
}