{"reviewerID": "A1F6404F1VG29J", "asin": "B000F83SZQ", "reviewerName": "Avidreader", "helpful": [0, 0], "reviewText": "I enjoy vintage books and movies so I enjoyed reading this book.  The plot was unusual.  Don't think killing someone in self-defense but leaving the scene and the body without notifying the police or hitting someone in the jaw to knock them out would wash today.Still it was a good read for me.", "overall": 5.0, "summary": "Nice vintage story", "unixReviewTime": 1399248000, "reviewTime": "05 5, 2014"}
{"reviewerID": "AN0N05A9LIJEQ", "asin": "B000F83SZQ", "reviewerName": "critters", "helpful": [2, 2], "reviewText": "This book is a reissue of an old one; the author was born in 1910. It's of the era of, say, Nero Wolfe. The introduction was quite interesting, explaining who the author was and why he's been forgotten; I'd never heard of him.The language is a little dated at times, like calling a gun a &#34;heater.&#34;  I also made good use of my Fire's dictionary to look up words like &#34;deshabille&#34; and &#34;Canarsie.&#34; Still, it was well worth a look-see.", "overall": 4.0, "summary": "Different...", "unixReviewTime": 1388966400, "reviewTime": "01 6, 2014"}
{"reviewerID": "A795DMNCJILA6", "asin": "B000F83SZQ", "reviewerName": "dot", "helpful": [2, 2], "reviewText": "This was a fairly interesting read.  It had old- style terminology.I was glad to get  to read a story that doesn't have coarse, crasslanguage.  I read for fun and relaxation......I like the free ebooksbecause I can check out a writer and decide if they are intriguing,innovative, and have enough of the command of Englishthat they can convey the story without crude language.", "overall": 4.0, "summary": "Oldie", "unixReviewTime": 1396569600, "reviewTime": "04 4, 2014"}
{"reviewerID": "A1FV0SX13TWVXQ", "asin": "B000F83SZQ", "reviewerName": "Elaine H. Turley \"Montana Songbird\"", "helpful": [1, 1], "reviewText": "I'd never read any of the Amy Brewster mysteries until this one..  So I am really hooked on them now.", "overall": 5.0, "summary": "I really liked it.", "unixReviewTime": 1392768000, "reviewTime": "02 19, 2014"}
{"reviewerID": "A3SPTOKDG7WBLN", "asin": "B000F83SZQ", "reviewerName": "Father Dowling Fan", "helpful": [0, 1], "reviewText": "If you like period pieces - clothing, lingo, you will enjoy this mystery.  Author had me guessing at least 2/3 of the way through.", "overall": 4.0, "summary": "Period Mystery", "unixReviewTime": 1395187200, "reviewTime": "03 19, 2014"}
{"reviewerID": "A1RK2OCZDSGC6R", "asin": "B000F83SZQ", "reviewerName": "ubavka seirovska", "helpful": [0, 0], "reviewText": "A beautiful in-depth character description makes it like a fast pacing movie. It is a pity Mr Merwin did not write 30 instead only 3 of the Amy Brewster mysteries.", "overall": 4.0, "summary": "Review", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"}
{"reviewerID": "A2HSAKHC3IBRE6", "asin": "B000F83SZQ", "reviewerName": "Wolfmist", "helpful": [0, 0], "reviewText": "I enjoyed this one tho I'm not sure why it's called An Amy Brewster Mystery as she's not in it very much. It was clean, well written and the characters well drawn.", "overall": 4.0, "summary": "Nice old fashioned story", "unixReviewTime": 1402358400, "reviewTime": "06 10, 2014"}
{"reviewerID": "A3DE6XGZ2EPADS", "asin": "B000F83SZQ", "reviewerName": "WPY", "helpful": [1, 1], "reviewText": "Never heard of Amy Brewster. But I don't need to like Amy Brewster to like this book. Actually, Amy Brewster is a side kick in this story, who added mystery to the story not the one resolved it. The story brings back the old times, simple life, simple people and straight relationships.", "overall": 4.0, "summary": "Enjoyable reading and reminding the old times", "unixReviewTime": 1395446400, "reviewTime": "03 22, 2014"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000FA64PA", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "Darth Maul working under cloak of darkness committing sabotage now that is a story worth reading many times over.  Great story.", "overall": 5.0, "summary": "Darth Maul", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "AQZH7YTWQPOBE", "asin": "B000FA64PA", "reviewerName": "Enjolras", "helpful": [0, 0], "reviewText": "This is a short story focused on Darth Maul's role in helping the Trade Federation gain a mining colony. It's not bad, but it's also nothing exceptional. It's fairly short so we don't really get to see any characters develop. The few events that do happen seem to go by quickly, including what should have been major battles. The story is included in the novelShadow Hunter (Star Wars: Darth Maul), which is worth reading, so don't bother to buy this one separately.", "overall": 4.0, "summary": "Not bad, not exceptional", "unixReviewTime": 1297555200, "reviewTime": "02 13, 2011"}
{"reviewerID": "A1ZT7WV0ZUA0OJ", "asin": "B000FA64PA", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "I think I have this one in both book and audio. It is a good story either way. good ol' Maul.", "overall": 5.0, "summary": "Audio and book", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A2ZFR72PT054YS", "asin": "B000FA64PA", "reviewerName": "monkeyluis", "helpful": [0, 0], "reviewText": "Title has nothing to do with the story.  I did enjoy it though.  Good short story about Darth Maul setting up two corporations against each other.  All in the end to help Darth Sidious' rise to power.  Won't take you long to read & it's cheap.  Go for it.", "overall": 4.0, "summary": "Darth Maul...the brother I never had.", "unixReviewTime": 1316217600, "reviewTime": "09 17, 2011"}
{"reviewerID": "A2QK1U70OJ74P", "asin": "B000FA64PA", "reviewerName": "Sharon Deem", "helpful": [0, 0], "reviewText": "Well written. Interesting to see Sideous (through Maul) maneuvering events to fit his plan. We see human nature at work. But no good guys to root for. Even Rurit is a helpless pawn.", "overall": 3.0, "summary": "Not bad; it is well written", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
{"reviewerID": "A3SZMGJMV0G16C", "asin": "B000FA64PK", "reviewerName": "Andrew Pruette \"Rancors Love to Read\"", "helpful": [0, 0], "reviewText": "Troy Denning's novella Recovery was originally published in e-book form and is a short tale set after the events of Kathy Tyers' Balance Point. Han and Leia Solo's relationship was fractured early in the Yuuzhan Vong invasion by the death of someone in the family, and the books prior to Recovery, notably the Agents of Chaos duology, spent time exploring Han's journey to reclaim himself from his demons and Leia's efforts to be patient with the process.  Ms. Tyers reunited the couple in Balance Point as the battle for Duros commenced, but it is in this short story that they truly begin the emotional healing process.We start on Corellia with a battle in a hospital and an appearance from Han's rogue cousin Thracken Sal-Solo. It's good to touch base on what Sal-Solo has been up to since he fired the Centerpoint weapon earlier in the New Jedi Order. Mr. Denning uses this story to introduce a group of his preferred characters, a tight-knit group of saurian Barabel Jedi. Here they are accompanied by an entertainingly non-conventional, salt-addicted Arcona Jedi as well as a human Jedi, Master Eelysa, known for her lengthy and complicated solo missions. The Barabel come into full play in Mr. Denning's own Star by Star and are memorable characters: it's welcome, if certainly not essential, to have their background more fully fleshed out here.In fact, the Jedi provide the most entertaining aspect of Recovery. The Solo reactions to the explicitly non-human worldview of the Barabel are genuinely funny, especially as they struggle to comprehend Barabel humor. Mr. Denning handles the evolution of their relationship and concurrent healing capably enough, although no aspect of this jumps out at me as especially memorable. The final two chapters take the story on a race to Coruscant to stop a potentially disastrous Senate vote. This portion feels rushed, as if it was constrained by the limitations of being a short e-book, but it brings events to a satisfying close nevertheless.Certainly not an essential read, Recovery does flesh out aspects of the New Jedi Order and it worth a look to anyone reading that part of the saga, especially if you are a fan of Mr. Denning's later novels and want to get a bit more insight into the origin of a couple of his preferred Jedi characters.", "overall": 3.0, "summary": "Han and Leia reunited and Barabel Jedi introduced", "unixReviewTime": 1331769600, "reviewTime": "03 15, 2012"}
{"reviewerID": "A3H8PE1UFK04JZ", "asin": "B000FA64PK", "reviewerName": "Caleb Watts", "helpful": [0, 0], "reviewText": "I am not for sure on how much of a difference the short story has on the overall series (I haven't read on yet), but I would recommend that anyone buy it to help them understand the whole series better.P.S.- The series is one of the best of all the Star Wars series.", "overall": 5.0, "summary": "Possibly Important", "unixReviewTime": 1368316800, "reviewTime": "05 12, 2013"}
{"reviewerID": "A2EN84QHDRZLP2", "asin": "B000FA64PK", "reviewerName": "Carl craft", "helpful": [0, 0], "reviewText": "I really enjoyed the book. Had the normal back against the wall moments. It even had laugh out loud moments.", "overall": 5.0, "summary": "Another read", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000FA64PK", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "Great read enjoyed every minute of it .  I think it answers some questions that are out there about this series.", "overall": 5.0, "summary": "Recovery", "unixReviewTime": 1383004800, "reviewTime": "10 29, 2013"}
{"reviewerID": "A38Z3Q6DTDIH9J", "asin": "B000FA64PK", "reviewerName": "Jimmy J. Shaw \"oldbent1\"", "helpful": [4, 4], "reviewText": "Another well written eBook by Troy Denning, but why is it put where it is? Why not a part of Balance Point? It is well written and belongs in the new Jedi Order. I just don't think it should stand alone. It is fun and fast to read on my Kindle, but not even in paperback????", "overall": 3.0, "summary": "Star Wars: The New Jedi Order: Recovery", "unixReviewTime": 1239840000, "reviewTime": "04 16, 2009"}
{"reviewerID": "A1ZT7WV0ZUA0OJ", "asin": "B000FA64PK", "reviewerName": "Mike", "helpful": [0, 1], "reviewText": "This one promises to be another good book. I have been reading through the series and have not gotten this far yet.", "overall": 5.0, "summary": "my collection", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A22CW0ZHY3NJH8", "asin": "B000FA64PK", "reviewerName": "Noname", "helpful": [0, 0], "reviewText": "I have a version of \"Star by Star\" that does not include the novella \"Recovery,\" so I downloaded this book onto my Fire.  \"Recovery\" tells of Leia's recovery after she was nearly killed in \"Balance Point.\"  If it was meant to tell the story of the healing of Han and Leia's relationship, it surely failed.  There was far too much action to attempt much more than a few brief moments or reconciliation.  They have a deeper understanding of each other but not much time to work on it.Is it a necessary read?  Not really.  I could have skipped it (I actually did) and not miss much.  It felt like the extraneous part of a book that had been edited out, like in the DVD's, where it's billed as the extras.  People pay to see those extras.  I did.  It was worth it, but probably not to everyone.", "overall": 4.0, "summary": "Not a necessary read, but I liked it", "unixReviewTime": 1342742400, "reviewTime": "07 20, 2012"}
{"reviewerID": "A2QK1U70OJ74P", "asin": "B000FA64PK", "reviewerName": "Sharon Deem", "helpful": [0, 0], "reviewText": "Excellent! Very well written story, very exciting with LOTS of action. The bad guys trying to kill Leia and Han. Viki Shesh is introduced.", "overall": 5.0, "summary": "Fits right into New Jedi Order timeline", "unixReviewTime": 1388448000, "reviewTime": "12 31, 2013"}
{"reviewerID": "A3SZMGJMV0G16C", "asin": "B000FA64QO", "reviewerName": "Andrew Pruette \"Rancors Love to Read\"", "helpful": [0, 0], "reviewText": "With Ylesia, a novella originally published in e-book form, Walter Jon Williams gets an opportunity to insert further story into his novel Destiny's Way. The events of Ylesia take place midway through that book, so this is a good read to tackle immediately after finishing Destiny's Way. The novella follows a New Republic mission to the titular planet, which is serving as the capital of the traitorous Peace Brigade and houses their attempt at a Senate. The Peace Brigade promote capitulation to the Yuuzhan Vong and have served as a human counterpoint to the efforts of the Jedi and the more heroic members of the New Republic throughout the New Jedi Order. They are a logical part of the story but not one I've found terribly interesting, as we rarely get anything told from their point-of-view, making them rather cardboard as adversaries.Yleisa brings back Thracken Sal-Solo in an entertaining plotline which sees him forcibly installed as the President of the Peace Brigade. This doesn't fit well with Sal-Solo's plans to better his own galactic situation but he displays a knack for adaption and survival not unlike that of his famous cousin Han Solo. Ylesia itself, a major source of the drug spice in the Star Wars galaxy, will be familiar to readers of A. C. Crispin's Han Solo Trilogy, and it's nice to see it return.For the most part Yleisa doesn't advance the story of Destiny's Way much: primarily, it delivers some closure to the Peace Brigade subplot. Sal-Solo was the most memorable aspect, as some of the space battle and ground assault material following the New Republic's invasion of the system felt like material I've read an awful lot of times before.  Ylesia is a solid enough little story but I would only recommend it to someone going through the entire New Jedi Order and wanting a little more.", "overall": 2.0, "summary": "Minor New Jedi Order side story", "unixReviewTime": 1331769600, "reviewTime": "03 15, 2012"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000FA64QO", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "Great book couldn't put it down.  The story expands events in the new Jedi order series.  Good writer in Walter Jon Williams.", "overall": 5.0, "summary": "Ylesia", "unixReviewTime": 1391472000, "reviewTime": "02 4, 2014"}
{"reviewerID": "AQZH7YTWQPOBE", "asin": "B000FA64QO", "reviewerName": "Enjolras", "helpful": [2, 2], "reviewText": "Most of the New Jedi Order books focus on the Solo kids, to the extent that some are viewed as \"Jacen books\" or \"Jania books.\" The novella Ylesia is if anything a book starring Thrackan Sal-Solo. Thrackan is forcibly recruited by the Yuuzhan Vong to become president of the Peace Brigade Republic. However, the New Republic forces also choose to attack Ylesia. There's nothing new or terribly exciting in the novel, but it's a nice side story. It's written in a similar style asDestiny's Way (Star Wars: The New Jedi Order, Book 14), which isn't surprising as they're both by the same author. This short story actually takes place during the novel, so I'd recommend reading the novel first so Ylesia doesn't spoil any surprises.", "overall": 4.0, "summary": "A Thrackan story", "unixReviewTime": 1305590400, "reviewTime": "05 17, 2011"}
{"reviewerID": "A1ZT7WV0ZUA0OJ", "asin": "B000FA64QO", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "I was hoping to find this one in book form. The story looks like it will be good when I get that far in the series.", "overall": 5.0, "summary": "my e- collection", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A22CW0ZHY3NJH8", "asin": "B000FA64QO", "reviewerName": "Noname", "helpful": [0, 0], "reviewText": "The events of \"Ylesia\" take place during \"Destiny's Way.\"  If you've read \"Destiny's Way,\" you will see it mentioned in passing.Jaina and Jacen go to Ylesia to fight the Peace Brigade to show them that it's not good to align themselves with the enemy.  From there, it is page after page of battle scenes.  It is endless.  One huge chapter.  It's like the chapter that was cut out for good reason.\"Ylesia\" doesn't advance \"Destiny's Way\" or \"The New Jedi Order\" in any way that I could tell.  We don't learn anything new.  There is no insight.  If I had skipped it, I wouldn't have missed anything.If you don't mind reading in PDF, \"Ylesia\" is available free from Del Rey.  If you Google, you'll see it linked to the Wayback machine and it's still there.", "overall": 3.0, "summary": "One huge chapter", "unixReviewTime": 1344297600, "reviewTime": "08 7, 2012"}
{"reviewerID": "A3AZH0OO0GUAI3", "asin": "B000FBFMVG", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Really shouldn't have Han Solo on the cover as he doesn't come into the story.This story is all about Chewbacca and his family.I won't give anything away, but it is a nice, if short, read.", "overall": 5.0, "summary": "An interesting short story.", "unixReviewTime": 1392422400, "reviewTime": "02 15, 2014"}
{"reviewerID": "A3SZMGJMV0G16C", "asin": "B000FBFMVG", "reviewerName": "Andrew Pruette \"Rancors Love to Read\"", "helpful": [5, 5], "reviewText": "Originally published as an e-book coinciding with the release of the novel Tatooine Ghost, Troy Denning's A Forest Apart is a short story following Chewbacca, his wife Mallatobuck, and his son Lumpy on a adventure into the bowels of Coruscant. Malla and Lumpy are visiting Chewie at his Coruscant apartment when a break-in at the next-door Solo place turns out to have more serious ramifications. The Wookiees follow the burglars and end up unearthing an Imperial plot set in place by an old tool of the villainous Ysanne Isard.There's a lot of action in a short space but not much time for meaningful character development. Lumpy is a pre-teen striving to find his place in the world, and Chewbacca's perpetual absence in his life may have left a gaping hole as far as having a father figure to look up to. There's not enough pages to explore this theme with much depth, and in the end the issue is dropped, since on a practical level Lumpy can't live with his father chasing all over the galaxy anyway. The theme of the impact a Wookiee Life Debt has on the Wookiee holding it and on his/her family is an interesting one that could be explored in more detail with a longer story.Unlike many novels which handle Chewie's communications by having him grunt and then having a nearby character paraphrase what he said, Denning makes the wise choice of letting the Wookiees speak as normal characters and simply puts brackets to indicate they are actually using their native tongue. It's always enjoyable seeing Chewbacca in action, and even though this story doesn't really add anything significant to the larger saga, it's an entertaining diversion.", "overall": 3.0, "summary": "Short story featuring everyone's favorite Wookiee", "unixReviewTime": 1219622400, "reviewTime": "08 25, 2008"}
{"reviewerID": "A3H8PE1UFK04JZ", "asin": "B000FBFMVG", "reviewerName": "Caleb Watts", "helpful": [0, 1], "reviewText": "This book was a good idea. I have always wanted to read more about Chewbaccas son Lumpy. Though I do wish he would have added more to the ending. I would recommend this book to anyone who loves Star Wars and Chewbacca.", "overall": 4.0, "summary": "Great", "unixReviewTime": 1364774400, "reviewTime": "04 1, 2013"}
{"reviewerID": "A2EN84QHDRZLP2", "asin": "B000FBFMVG", "reviewerName": "Carl craft", "helpful": [0, 0], "reviewText": "Great short story. It gives a little more insight into the walking carpet we all love, this time as a father", "overall": 5.0, "summary": "Another read", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000FBFMVG", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "I love anything with Chewbacca in it.  Him and his family is just a bonus.  Kind of nice to see him having problems with his son.", "overall": 5.0, "summary": "Love It", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "A38Z3Q6DTDIH9J", "asin": "B000FBFMVG", "reviewerName": "Jimmy J. Shaw \"oldbent1\"", "helpful": [0, 0], "reviewText": "A great little chapter to read on my Kindle, but not necessarily worth the price. It would have been a nice addition to The Courtship of Princess Leia or an add on to Tatooine Ghost. I liked it, but when it doesn't even rate being published as a paperback; an avid Star Wars fan you will need to be to download and read this eBook.", "overall": 5.0, "summary": "Star Wars: A Forest Apart", "unixReviewTime": 1239840000, "reviewTime": "04 16, 2009"}
{"reviewerID": "A1ZT7WV0ZUA0OJ", "asin": "B000FBFMVG", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "I love the stories with Chewie in them! this e-book is no exception. great character introductions and wonderful story line.", "overall": 5.0, "summary": "my collection", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A3D58M29K2HWMV", "asin": "B000FBFMVG", "reviewerName": "P. Thompson \"romancewriter\"", "helpful": [0, 0], "reviewText": "I'm not really sure where it actually fits into the overall story line.This story involves only Chewie and his wife and son.  The other characters are only mentioned in passing.  It was enjoyable and well written but I was glad it was very short and didn't keep me from the main story for very long.", "overall": 4.0, "summary": "Enjoyable But...", "unixReviewTime": 1326499200, "reviewTime": "01 14, 2012"}
{"reviewerID": "A12LKEM543ILBK", "asin": "B000FBFMVG", "reviewerName": "zombie phreak", "helpful": [0, 0], "reviewText": "I really do enjoy Troy Denning's work, I want everyone who reads this review to know this.  I loved Star by Star and I very much enjoyed Tattooine Ghost.  This book \"A Forest Apart\" wasn't on par with his other works.  It wasn't without it's charm, but it had things in it that I didn't like.The story itself is pretty simple.  It's a coming of age story for Chewbacca's son, and instead of coming of age on Kashyyyk, he is growing up on Coruscant.  It's not horrible, and we find out that Lumpy is an avid gamer and enjoys playing video games and that he idolizes his father.***SPOILERS***  ***SPOILERS***  ***SPOILERS***First of all, why is Han Solo on the cover?  He's not even IN this story other than a few mentions of his name.  Why not have Chewbacca and Lumpy instead of Han and Chewie?  Also, I HATE books where Chewbacca's grunts and growls are translated.  Like in the Black Fleet Trilogy, he had his speech translated and it was just stupid.  I feel that he works much better as a strong silent type who speaks through his actions rather than his words.  I mean imagine in characters like Jason Vorhees, Michael Meyers, Silent Bob, or Sphynx (from Gone in 60 Seconds), all just started having lengthy conversations throughout their movies?  They lose some of what makes those characters awesome.  Sometimes an author can say very much by having a character say very little.My only other problem with the book is when Chewie and Malla have the droid \"IT\" in their blaster sights, his back is to them and he doesn't see them.  Why don't they just shoot him?  Instead they send Lumpy out as a \"distraction.\"  Yet he doesn't really do anything worth mentioning to distract IT and his minions.  He walks out on the observation deck where they are hiding, opens the window and drops down to the level where IT and his minions are loading nerve gas onto transport ships.  I mean that's not much of a distraction, besides the point of a distraction is to get someone's attention away from one spot so you can do something while they are not looking.  Well, IT wasn't looking in your direction to begin with, so why bother?  They could have just taken up positions on the observation deck and shot him.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***Okay so this story wasn't really bad other than a few minor details I didn't like.  I did like seeing that even in a galaxy far far away that we have sons who want to be like their fathers and get into trouble when they do rebellious things.  This story reminded me of what a good writer Troy Denning is and it reminded me to add his other works to my wishlist.Check this one out!", "overall": 3.0, "summary": "A Good Quick Read", "unixReviewTime": 1365292800, "reviewTime": "04 7, 2013"}
{"reviewerID": "A3SZMGJMV0G16C", "asin": "B000FC1BN8", "reviewerName": "Andrew Pruette \"Rancors Love to Read\"", "helpful": [1, 1], "reviewText": "Timothy Zahn's Fool's Bargain is a short story originally published in e-book form and set before the events of his novel Survivor's Quest. This tale covers an assignment Aurek Company of the Imperial 501st receives on the embattled planet Kariek. The focus is on the four troopers who comprise Aurek-Seven and in particular their leader Twister. This is the same squad that plays a part in Survivor's Quest, minus one personnel change which is detailed in this story. There aren't many Expanded Universe stories that take the Imperial point of view, so this is a welcome perspective here. By this stage in the galaxy's history, years after the Battle of Endor, certain elements of the Empire have developed a more enlightened perspective of the universe around them. These troopers are honorable soldiers fighting for a government they believe in, one that no longer ruthlessly oppresses subject populations but rather plays more of a protector role.The Empire of the films is notably a human-centric organization. Zahn opens the door to alien Imperials in this story with the introduction of Su-mil, an Eickarie and a Kariek native swept up in a civil war. There is a clever bit of deception on Su-mils part involving the Eickarie concept of a lie (they term a lie \"left-handed,\" vs. a truth which is \"right-handed\" - this must be awkward for the native left-handed Eickaries!). By fighting together, Twister sees a potentially valuable ally in Su-mil and we get a perspective of how a stormtrooper unit might be something a soldier would actually aspire to join, rather than simply being cannon fodder for Rebel heroes.All in all, Fool's Bargain is an enjoyable vignette of Imperial life that expands a bit on characters from Survivor's Quest and also provides an interesting preview of the Imperial perspective Zahn went on to explore more thoroughly in his novel Allegiance. It can be purchased in electronic form and is also available in the paperback version ofSurvivor's Quest (Star Wars).", "overall": 3.0, "summary": "Enjoyable Imperial slice-of-life story", "unixReviewTime": 1285286400, "reviewTime": "09 24, 2010"}
{"reviewerID": "AIG0I95Q2H1GF", "asin": "B000FC1BN8", "reviewerName": "Anita", "helpful": [0, 0], "reviewText": "Not too bad, an intro-short-story for some bigger upcoming novel. It's timothy Zahn, what did you expect from the master of Science Fiction.", "overall": 3.0, "summary": "A Short Story", "unixReviewTime": 1393286400, "reviewTime": "02 25, 2014"}
{"reviewerID": "A3H8PE1UFK04JZ", "asin": "B000FC1BN8", "reviewerName": "Caleb Watts", "helpful": [0, 0], "reviewText": "I absolutely love this book. Though it is short it was written by Zahn. Any Star Wars fan knows this book is a good one. I would recommend this book to anyone who loves Star Wars.", "overall": 5.0, "summary": "Great", "unixReviewTime": 1364774400, "reviewTime": "04 1, 2013"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000FC1BN8", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "What can I say Stormtroopers.  A story with troopers is as awesome as a story with any Sith lord.  AWESOME!!!!!!", "overall": 5.0, "summary": "Stormtroopers", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "AQZH7YTWQPOBE", "asin": "B000FC1BN8", "reviewerName": "Enjolras", "helpful": [8, 9], "reviewText": "For whatever reason, Star Wars short stories are a bit of a hit or miss. The \"Tales of...\" are great in that they explain background characters. However,Fool's Bargaindidn't really fit the bill. It's a short story about a relatively minor and unmemorable character from Timothy Zahn'sSurvivor's Quest (Star Wars). The story itself is basically about stormtroopers storming a fortress with some mysterious Warlord. Unlike most of Zahn's other work, this is mostly a book of action, not intricate plot development. In fact, the story ends with an exciting twist, but doesn't develop it. I feel like this short story would have been better had it been about a character we all know and love, or included a really interesting plot twist. Also, just to note, this same story is included in the paperback copy ofSurvivor's Quest (Star Wars), so there's no need to buy the separate Kindle version.", "overall": 2.0, "summary": "Too short, not enough story", "unixReviewTime": 1285286400, "reviewTime": "09 24, 2010"}
{"reviewerID": "A38Z3Q6DTDIH9J", "asin": "B000FC1BN8", "reviewerName": "Jimmy J. Shaw \"oldbent1\"", "helpful": [0, 2], "reviewText": "As an ebook it reads very well on my Kindle, but it really doesn't seem to belong where it is. Maybe at the end of The Dark Nest Trilogy or Legacy of the Force, but it just seems not to have a place it belongs in the Star Wars universe. At least not to me.", "overall": 3.0, "summary": "Star Wars: Fool's Bargain", "unixReviewTime": 1239840000, "reviewTime": "04 16, 2009"}
{"reviewerID": "A2OIGPPBTR65MR", "asin": "B000FC1BN8", "reviewerName": "para", "helpful": [0, 0], "reviewText": "** Note: this story appears as a bonus in the paperback edition of Survivor's Quest. **Fool's Bargain is a short story featuring the stormtroopers of Aurek-Four, a unit of the Imperial 501st Legion of the Empire of the Hand.  It takes place shortly before the events of Survivor's Quest, but is probably best read after.The Empire of the Hand is involved in a war to rid the native Eickarie people of their latest warlord, but the 501st curious orders are very specific - take the warlord alive.  This story is tightly focused, with a couple of characters firmly at the center.  There's good detail here but for some reason it doesn't feel as well developed as other short stories I've read by Zahn.  Also,  those who look for big names in their Star Wars stories will want to give this a pass.  A couple of minor characters from Survivor's Quest show up in largely supporting roles, but there are no movie characters nor beloved favorites here.But despite these caveats Fool's Bargain is a good short story that gives further glimpse of Zahn's take on stormtroopers, which he touched on in Survivor's Quest, and would continue to explore in later novels (Allegiance and Choices of One).", "overall": 3.0, "summary": "Enjoyable, if unremarkable, stormtrooper tale.", "unixReviewTime": 1336953600, "reviewTime": "05 14, 2012"}
{"reviewerID": "A1YEPFLLH42OU1", "asin": "B000FC1BN8", "reviewerName": "Yu-jin &amp; Tracy Chia \"Yu-Jin Chia\"", "helpful": [0, 0], "reviewText": "I admit it, I snapped this up the moment I saw it on new releases, because I tend to do that with anything written by Timothy Zahn. He is, in my opinion, one of the best contemporary sci-fi authors where it comes to world building, intricate plot, and edge-of-seat action. His Thrawn and Conqueror's trilogies were incredible, Quadrail and Cobra were very unique and engaging, and even his one-off novels like Icarus Hunt and Outbound Flight are excellent. So I figured this would be too.First off, when I hit the end my jaw dropped and I literally said aloud \"Huh? That's it?!\" I then spent several minutes looking to see if it picked up somewhere else. It is a really short story, barely longer than some of the ones that appear in the 'Tales' Star Wars series (and those books have several of them!). It's also, I must say, a lot less interesting than most of them and probably the single weakest plot I've seen Zahn write. It's not terrible, but it really isn't that great either- there's no twists and at the end you're left wondering where the other half of the story is. The novella revolves around a force of Stormtroopers who are only somewhat memorable (as is the case with most such white-armored shock troops) and though there is quite a bit of action, it kind of reads like a (short) movie or videogame script.Overall, not worth paying for. In fact, it should really be free if you ask me.", "overall": 2.0, "summary": "An average short story", "unixReviewTime": 1358380800, "reviewTime": "01 17, 2013"}
{"reviewerID": "A12LKEM543ILBK", "asin": "B000FC1BN8", "reviewerName": "zombie phreak", "helpful": [0, 0], "reviewText": "I love Timothy Zahn's work!  He does what no other writer, not even George Lucas himself can do.  He takes the rank and file Storm Troopers and gives them personalities, talents, skills and makes them multi-dimensional characters that people can get invested in.Where most writers show the Storm Troopers as faceless cannon fodder who can't hit anything with their blasters, Zahn shows them as competent sharpshooting elite commandos who can think on their feet and adapt to any situation as well as follow orders.***SPOILERS***  ***SPOILERS***  ***SPOILERS***So the story is a pretty basic one.  There is an alien warlord who is ruling a planet with an iron fist, and the Empire decides it is time to go and free the plant of his rule, so they dispatch the 501st Legion a.k.a. Vader's Fist to take him down.There is something I do wonder about though, this takes place after Vader is dead, and after Thrawn's rule has ended.  So why does the 501st Legion keep calling themselves \"Vader's Fist?\"  Vader's not around anymore?  Do they keep the name just for the sake of nostalgia?  It's not really a major gripe, just something that makes me scratch my head.Our main characters are three Storm Troopers who all have different skills and specialties.  They infiltrate the warlord's fortress and meet up with some of the local freedom fighters and strike a deal with them.  If the troopers help them free their imprisoned comrades, they will help the troopers get inside and take out the warlord's troops and bring him to justice.The troopers agree and they infiltrate the stronghold together.  Later it seems the rebels have betrayed the Storm Troopers, but it turns out it is just a very elaborate ruse and the rebels were always on the side of the troopers and the prisoners are freed and the warlord is captured by the Empire and brought to justice.Later the head of the rebels is offered a position in the 501st Legion, which is awesome!  It really helps to enforce the fact that the Empire has learned that just having humans in their military doesn't help, it's a hindrance and it was the main reason the Rebel Alliance was able to defeat them.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***Zahn gives us action, gun fights, intrigue and a little bit of politics as well in this story.  Any fan of Star Wars or Zahn's writing will enjoy this book very much!", "overall": 5.0, "summary": "Excellent!", "unixReviewTime": 1368748800, "reviewTime": "05 17, 2013"}
{"reviewerID": "AVWWFK3FZDEL2", "asin": "B000FC1TG2", "reviewerName": "D. Mckinzie", "helpful": [0, 0], "reviewText": "The hero in this story has been living in NYC and working for a sort of Crime boss.  Beaten up and tossed in an empty train car by the competition, he ends up out west and, by a series of flukes, becomes the sheriff of a small western town that is in serious trouble.  While it is not one of my L'Amour favorites, he tells it with his usual flair and attention to detail and it's well worth reading.", "overall": 5.0, "summary": "Unlikely, but possible, story, very well told", "unixReviewTime": 1362960000, "reviewTime": "03 11, 2013"}
{"reviewerID": "A1CQ8WG6CUDBNV", "asin": "B000FC1TG2", "reviewerName": "gail", "helpful": [0, 0], "reviewText": "The Iron Marshall, by Louie L`Amour is one of his best. Of course all of his are the best.Louie is a man who knew the west. His books make it possible to really feel how it was.", "overall": 5.0, "summary": "Gail", "unixReviewTime": 1395964800, "reviewTime": "03 28, 2014"}
{"reviewerID": "A1XWEAEETTS4OD", "asin": "B000FC1TG2", "reviewerName": "John H. Danner \"Book Lover\"", "helpful": [0, 0], "reviewText": "This is yet another  L'Amour winner. I have yet to read a book of his that was less than great. He has the ability to keep you enthalled enough in the story to make you not want to put the book down until it is finished.", "overall": 5.0, "summary": "Great Read", "unixReviewTime": 1386374400, "reviewTime": "12 7, 2013"}
{"reviewerID": "A3B07KAS0C0Q2R", "asin": "B000FC1TG2", "reviewerName": "Kindle Customer", "helpful": [0, 0], "reviewText": "I almost didn't get this book because of the cover but since it was double 'LL  I did.  As always the author came through.  Good book and characters.  The plot was interesting", "overall": 5.0, "summary": "Irish luck", "unixReviewTime": 1371513600, "reviewTime": "06 18, 2013"}
{"reviewerID": "AWYOWZKRBKQHQ", "asin": "B000FC1TG2", "reviewerName": "Mary Ellison", "helpful": [0, 0], "reviewText": "This story by Louis L'Amour was the very first of his novels that I ever read.  Novels with a western theme were not my thing when I was growning up, so imagine my surprise when I just sort of drifted into this book one rainy afternoon.  I guess I was attracted to it by the fact that it opens in New York City, not the deserts of New Mexico.Anyway, I soon found that L'Amour has a writing style just as smooth as silk, and I found myself sliding into this book as easily as if he took me by the hand and led me to an alter.  Since then I have read several more of L'Amour's books and have enjoyed all of them.  I will review them here over the next few weeks, time permitting.This book tells the story of how a young man from New York City ends up in a small Kansas town and picks up the job of being the Sheriff one day before all hell is scheduled to break loose.  Others have outlined the text already, so I won't bore you with yet another outline.  I'll just say that if you have not read any of Louis L'Amour in the past, this would be a really great place to start, or even to get reacquainted.  While you do that, I'm gonna find another L'Amour book to read.:)", "overall": 5.0, "summary": "A Good Afternoon Read", "unixReviewTime": 1248480000, "reviewTime": "07 25, 2009"}
{"reviewerID": "AEC18J7P03ZBP", "asin": "B000FC1TG2", "reviewerName": "pigskin", "helpful": [0, 0], "reviewText": "This is how it was in the big gambling and corrupt cities of the eastern seaboard.  Then go out west and become a real hero.  Again, the video was also good.", "overall": 5.0, "summary": "Wow what a transition!", "unixReviewTime": 1369785600, "reviewTime": "05 29, 2013"}
{"reviewerID": "A39N0BN4B2Q7F", "asin": "B000FC26RI", "reviewerName": "Amazoner \"reader, thinker, doer\"", "helpful": [0, 0], "reviewText": "Pat Anjali is the da man of an overview of spiritual practice, from an Indian perspective 600 AD.  (or is that 800 Ad?)The most controversial part of PJ, imo, is he discusses at length the Siddhis or powers accruing from SP.But the definition of SP, according to Pat is in the opening:Yogaham chitta vritti narodaham.Yoga is the stilling of the thought  waves of the mind.orcloseness to God is a result of clearing out childish distractions of the mind.A must have book on every learned person's book shelf, but see another reviewer's comments on the translation - evidently theKindle is crap, or scholarly quality.SO - buy the book, and avoid the Kindle.", "overall": 5.0, "summary": "classic by the master", "unixReviewTime": 1395532800, "reviewTime": "03 23, 2014"}
{"reviewerID": "A3GSHMATNCP0XP", "asin": "B000FC26RI", "reviewerName": "Gary R. Casebeer \"Montessorian, Retired\"", "helpful": [0, 0], "reviewText": "simply stated and translated, this copy is easily understood. The review says it has to have eleven more words to be accepted, so here they are.", "overall": 5.0, "summary": "love it", "unixReviewTime": 1357516800, "reviewTime": "01 7, 2013"}
{"reviewerID": "A2T7TBJM0ETP2M", "asin": "B000FC26RI", "reviewerName": "George", "helpful": [0, 0], "reviewText": "I have several translations of the Yoga Sutras and did find this one a fairly understandable one. It has a decent layout and you can move through it fairly fast.", "overall": 4.0, "summary": "Nice read", "unixReviewTime": 1401321600, "reviewTime": "05 29, 2014"}
{"reviewerID": "ADXAE3UOGPUN4", "asin": "B000FC26RI", "reviewerName": "Goldilocks", "helpful": [0, 0], "reviewText": "Did not impress me that much, as I have read the one written by The Yogaville founder (which was detailed and informative)", "overall": 3.0, "summary": "So-So", "unixReviewTime": 1383523200, "reviewTime": "11 4, 2013"}
{"reviewerID": "A2Y1X56N8NPH8G", "asin": "B000FC26RI", "reviewerName": "Heather \"Houndog\"", "helpful": [0, 0], "reviewText": "As an aspiring yogini this is required reading.  It's not an easy read but it's essential and the translation was good.", "overall": 4.0, "summary": "A good resource", "unixReviewTime": 1360713600, "reviewTime": "02 13, 2013"}
{"reviewerID": "A6J7GN6ZOR085", "asin": "B000FC26RI", "reviewerName": "lonebeaut", "helpful": [0, 0], "reviewText": "I thought it would be instructive to compare this Charles Johnston translation, sutra by sutra, to Chip Hartranft's Shambhala version of Patanjali's Yoga Sutras.  I'm glad I also have the Shambhala book, because some of the typos in this Kindle book make it at times a real head scratcher.  Here are some of the funnier ones:* Through the weakening of the causes of bondage, and by learning the method of sassing, the consciousness is transferred to the other body.* Vestures of consciousness are built up in conformity with the Boston of the feeling of selfhood.* In the internals of the batik, other thoughts will arise, through the impressions of the dynamic mind-images.I'm glad I had the Hartranft version to be able to figure out what was being said.Unlike Hartranft and most modern translators, Johnston takes exception with calling the sutras \"aphorisms\", pointing out that aphorisms are really standalone gems of wisdom, while sutras are interdependent. I kind of agree with that.  But, being an older translation, the word use is a bit quaint.  For example, Johnson likes the word \"psychic\", but more in the sense of psychological, not extrasensory perception.  He uses the phrase \"judicial action\" to connote \"reflection-free\".  He's fond of the word \"unwisdom\", which Hartranft translates as \"not seeing things as they are\".  And he does over-explain sutras that don't need that much explanation to comprehend.  But then, Hartranft goes into great detail also.The lesson to be learned is that, if you're interested in the original philosophy of Yoga and not just the postures, you should read more than one version of this seminal and relatively short book.  Translations are always tricky, so if you compare and contrast different versions from various time periods and interpreters, you'll achieve a better understanding of the original work.", "overall": 4.0, "summary": "Compare and contrast for a better understanding", "unixReviewTime": 1403308800, "reviewTime": "06 21, 2014"}
{"reviewerID": "AVWWFK3FZDEL2", "asin": "B000FC2MB8", "reviewerName": "D. Mckinzie", "helpful": [5, 5], "reviewText": "L'Amour's story of a man whose wife has killed herself before a band of thieves and thugs can rape and murder her, keeps your interest from the first.  Brionne's concern with his son, traumatized by witnessing his mother's attack and death, and his attempt to help a young woman in distress take him to wild country where the same band of outlaws are trying to kill him, his son, the young woman, and anyone else traveling with him.  A good story.", "overall": 5.0, "summary": "Moving on", "unixReviewTime": 1274659200, "reviewTime": "05 24, 2010"}
{"reviewerID": "AFSMRL2GSJ59Z", "asin": "B000FC2MB8", "reviewerName": "Donald Thomason \"taquara\"", "helpful": [0, 0], "reviewText": "I like most of Louis L'Amour's books and this is one is no exception. You want 6 more words. words words words words words words.", "overall": 4.0, "summary": "Another good L.L. read.", "unixReviewTime": 1392508800, "reviewTime": "02 16, 2014"}
{"reviewerID": "AMGNZ94OLLUMU", "asin": "B000FC2MB8", "reviewerName": "Edward Brown", "helpful": [0, 0], "reviewText": "Typical book by Louis L'Amour one of the best you can read as you read it seems that you are riding the trail along the side of the stories character,  you see what he sees, you hear what he hears . Can't go wrong with this author.", "overall": 4.0, "summary": "Brionne", "unixReviewTime": 1376006400, "reviewTime": "08 9, 2013"}
{"reviewerID": "A1CQ8WG6CUDBNV", "asin": "B000FC2MB8", "reviewerName": "gail", "helpful": [0, 0], "reviewText": "BRIONNE is another one of L Amours great books. Imagine how it would be to see the mountains, and canyons and desserts. What we see in the lower fourth eight, is nothing compared to back when they drove the golden spike when the railroads joined. However it is an awful lot like here in Alaska.", "overall": 5.0, "summary": "Gail", "unixReviewTime": 1398038400, "reviewTime": "04 21, 2014"}
{"reviewerID": "A3B07KAS0C0Q2R", "asin": "B000FC2MB8", "reviewerName": "Kindle Customer", "helpful": [0, 0], "reviewText": "I enjoyed the book, I dislike reviewing L'Aour's books because I haven't found one I did not like.He writes about the part of the country I love and of course I love westerns also.  In this book, as wellas others he has written it is a good cast of characters and the story line is easy to follow.I could write mnore but then I would be into the book.  Good read.", "overall": 5.0, "summary": "On the run, head West", "unixReviewTime": 1352073600, "reviewTime": "11 5, 2012"}
{"reviewerID": "A1U360OMVQRPUB", "asin": "B000FC2MB8", "reviewerName": "Mel Odom", "helpful": [0, 0], "reviewText": "I needed an evening of relaxed reading, settling in with an old friend whose story I'd already heard, so I picked up Louis L'Amour's Brionne.  L'Amour was a staple when I was growing up, and I still return to him again and again as I go along.  Fair Blows the Wind remains my favorite novel by the author because it's such a combination of Old World swordplay, coming of age, and early Americana.  But that's beside the point.In James Brionne, L'Amour creates one of his best fighting men, a man who'd served in the Union Army during the Civil War, a man who had the ear of President Grant - and a man who had lost his wife to tragic circumstances.  The first few pages of the book draw the reader in and sets him on a journey to see good triumph over evil.The book is much as I remember it, written with a lot of introspection and bouncing around from character to character, with less action and tension than I would have liked.  L'Amour also instills a romantic lyricism in his word choice, though.  James Brionne is an educated man, a thinker, and that shows on the pages.There's no real tension about where the reader is going to get during the read because the endgame is almost transparent.  Still, L'Amour manages to throw a couple curves in there that will leave you unsettled about a few things as you turn the pages.I wish there had been a little more to the story, and even the ending just seems to coast to a halt rather than escalating.  The pieces just fall together without any real stress or narrative tension.The plot is pretty thin even for a L'Amour novel, but the tale pulled me through again, and even though I knew how the book ended, and would have known anyway because it's so clear, I enjoyed roving through the Old West and stepping through my own past.", "overall": 4.0, "summary": "Brionne", "unixReviewTime": 1370908800, "reviewTime": "06 11, 2013"}
{"reviewerID": "A1P3Q598K6TNFC", "asin": "B000FC2MB8", "reviewerName": "Michael", "helpful": [0, 0], "reviewText": "L'Among classic.  Great read. Great book . Great on the MY Kendle. . . . . . . . ..", "overall": 5.0, "summary": "Classic", "unixReviewTime": 1365552000, "reviewTime": "04 10, 2013"}
{"reviewerID": "AEC18J7P03ZBP", "asin": "B000FC2MB8", "reviewerName": "pigskin", "helpful": [0, 0], "reviewText": "I look forward to getting to the next books, and sometimes can't recall exactly what the book was about, but it is a very good book, and real good reading.'", "overall": 5.0, "summary": "Also, exciting and descriptive.", "unixReviewTime": 1375142400, "reviewTime": "07 30, 2013"}
{"reviewerID": "A39N0BN4B2Q7F", "asin": "B000FDJ0FS", "reviewerName": "Amazoner \"reader, thinker, doer\"", "helpful": [2, 9], "reviewText": "He had an english accent which he seemed trying to hide. I don't know this, but my impression is that europeons now own the WSJ.England s a great country, but I'm suspicious of europeon socialism. (I really can't spell it.) In particular the Brits are proud of their writing ability, and rightly so, but I'd rather have Americans brainwashing Americans, bad as that may be.", "overall": 1.0, "summary": "In was thinking of getting until I heard the chief editor speak....", "unixReviewTime": 1386633600, "reviewTime": "12 10, 2013"}
{"reviewerID": "A2XGPSOJXTW5JF", "asin": "B000FDJ0FS", "reviewerName": "Anne", "helpful": [2, 2], "reviewText": "Somewhat of a disappointment.  The articles were all there, but I missed Pepper and Salt and the list of declared dividends, currency exchange, weather.  These were the small things that I would like for travel, the whole stack of paperes was waiting for me at home.  This was just a stop-gap for travel abroad where the WSJ was not available.", "overall": 1.0, "summary": "Wall Street Journal", "unixReviewTime": 1355356800, "reviewTime": "12 13, 2012"}
{"reviewerID": "A1JZFGZEZVWQPY", "asin": "B000FDJ0FS", "reviewerName": "Carter H \"1amazonreviewer@gmail . com\"", "helpful": [1, 1], "reviewText": "1. Costs more than delivered to your door paper and online version combined.2. Very confusing to read. Not intuitive.3. Layout is a nightmare4. Cant find anything like in the paper or online version.5. Price went up even more.I cancelled until they get it right just like everyone else who has tried it. Big let down.", "overall": 1.0, "summary": "Just Not Up To WSJ Standards", "unixReviewTime": 1250640000, "reviewTime": "08 19, 2009"}
{"reviewerID": "A3775OP5VTX5ON", "asin": "B000FDJ0FS", "reviewerName": "Coolkayaker \"ck1\"", "helpful": [49, 57], "reviewText": "The WSJ for Kindle is overpriced, and the customer service has gone completely haywire since the newspaper was bought out.  I have read and subscribed by Kindle, print edition, and iPhone app (WSJ Mobile).  Unfortunately, they are all horrible in contebt delivery--even though the writing is still superb--and try calling them.  10 minute waits to speak to someone in a different country who will put you on hold, and then when you try to cancel, it is abysmal.  More waiting.  I will never be part of WSJ Online, pinrt, Mobile or Kindle after my recent experiences.  Again, the company has been bought out and is now on its way out.  Beware.", "overall": 1.0, "summary": "The WSJ Has Gone to Pot!", "unixReviewTime": 1203984000, "reviewTime": "02 26, 2008"}
{"reviewerID": "A3AKG73AM4OKSI", "asin": "B000FDJ0FS", "reviewerName": "Dave W", "helpful": [2, 3], "reviewText": "Although WSJ has good reporting and covers all the news, the price keeps going up.  I often buy alternatives due to the inflated price.  I don't think the Kindle version of WSJ is that much better than other sources of financial news (Financial Times, for example) to justify the price difference.", "overall": 3.0, "summary": "high priced", "unixReviewTime": 1353369600, "reviewTime": "11 20, 2012"}
{"reviewerID": "A36K2N527TXXJN", "asin": "B000FDJ0FS", "reviewerName": "Dr. Bojan Tunguz", "helpful": [6, 7], "reviewText": "I've been an occasional reader of the Wall Street Journal for many years, but had never really considered subscribing to it. For the most part I've been happy to get my news for free online from a variety of sources, but of late I've been craving a more consistent access to the kind of high quality news stories that WSJ is known for. I decided to check out several subscription options, and compare them to each other. The Kindle version, even though it is very limited in many respects, turns out to be pretty good and in line with my expectations for what I wanted to get out of reading WSJ.Once you subscribe to WSJ, you can setup the delivery to any one of your Kindle devices or enabled Kindle readers. You can also manually download the current issue of WSJ to another device, but the automatic downloads are enabled for only one device at the time (you can change which one in the online Kindle setting at any time). Kindle formatting of WSJ leaves a lot to be desired. As you may imagine, the reading experience will be much closer to reading a book than a newspaper. I don't mind this all that much, as WSJ has always been a pretty text-heavy newspaper. The exceptions are the graphs and charts, which can be almost illegible when presented on Kindle. The sections and articles are well organized and easily accessible through the menu, and I am overall pleased with the navigation options. In terms of formatting, I still prefer the dedicated WSJ iPad version, but the Kindle version gets the job done.One big difference between the Kindle version and those for various tablets is that you won't be able to access various embedded videos on Kindle (not even in the tablet version of Kindle software). Those small video clips are indeed a lot of fun, and definitely add to the overall \"reading\" experience. However, they also add to the size of the download, and unless you have a really fast wireless connection and the latest version of the tablet, the download can be choppy. For me these videos are a nice addition, but they are not crucial.As far as the price goes, yes, Wall Street Journal on Kindle is kind of expensive. However, keep in mind that you can in principle cancel your subscription without much trouble after any number of months has passed, something that in my experience is not that easy to pull off with a print subscription of any newspaper. I do consider WSJ to be a very high quality publication, and in my opinion the price is reasonable for the kind of content and convenience that you get. We've all been spoiled by the years of de-facto free online access to various newspapers and magazines, but unfortunately this free-for-all state of affairs has lead many fine journals and newspapers to shut down.If you are seeking the convenience and the ease of use that the Kindle version of WSJ provides, and are not too concerned with the formatting and various bells and whistles, then I'd definitely recommend that you check it out. So far I've been more satisfied than I had expected based on all the negative reviews that I have read.", "overall": 4.0, "summary": "Convenient, Simply-formatted, Pricey", "unixReviewTime": 1330732800, "reviewTime": "03 3, 2012"}
{"reviewerID": "ABXANRX4GPYRZ", "asin": "B000FDJ0FS", "reviewerName": "hdtravel", "helpful": [10, 23], "reviewText": "This is it, the big kahuna of financial newspapers delivered right to your Kindle. You do not even need to get out of bed or off the throne to retrieve a soggy paper version from your snowed in yard.Just read it right there on your beloved Kindle.The problem is the high price for what you get and the pesky DRM content that you have to put up with.All the Kindle content is like this. This is the evil DRM inherent in the Kindle. It only lets you view the content on the Kindle. No printing articles, no emailing articles to a friend, no using it in presentations. You are stuck. Very evil is it not !So, if you can live with the price and restrictions of DRM then go for it my friend.", "overall": 2.0, "summary": "OK but TOO restrictive", "unixReviewTime": 1203811200, "reviewTime": "02 24, 2008"}
{"reviewerID": "A3L25SHGZKH8Q1", "asin": "B000FDJ0FS", "reviewerName": "John K. Pearson", "helpful": [3, 3], "reviewText": "I read nearly all my books and magazines on Kindle.  I have had a paper subscription for the WSJ for several years but have trouble reading the small print.  Nevertheless, I renewed it via Amazon and Kindle in the apparently mistaken belief that I would be able to read it on more than my Kindle (I have two).  First of all, I had one hell of a time getting it to open on the Kindle Fire.  After much fumbling, I managed.  There are some serious problems with the app: the type face sizes are too small (hardly larger than the print version) and now I can't get it to open on the iPad.  I could have continued with the online version on the iPad and Kindle (I'm going to start receiving the print version soon, I hope) cheaper - but opted for the Amazon version thinking mistakenly that I would be able to read it on the ipad with the larger screen.  This isn't quite a disaster - but it comes close.If I were you, I'd buy the print/digital combination directly and use either the Kindle or the iPad - not the special app.Ok, I'm part of the disaster - I thought I was ordering the Kindle and print versions and somehow managed to just order the print version.  After a cordial conversation with Amazon, I cancelled the order - the Amazon print version is nearly 50% more than the same offer from the WSJ.  I then bought the WSJ on line, logged in on my Kindle and presto - a decent readable product (type size is still too small) on line.  I can now read it on the Kindle Fire, my iMac - and if I can find my iPad, probably there.  All things considered, the product is a good one - but the price extracted for buying it thru Amazon is too high.  I suppose I'll have to change my email -", "overall": 1.0, "summary": "Not quite a disaster", "unixReviewTime": 1353628800, "reviewTime": "11 23, 2012"}
{"reviewerID": "AJNIKU4GSIWHY", "asin": "B000FDJ0FS", "reviewerName": "J. Wallace", "helpful": [5, 5], "reviewText": "This is an update of my original review...The content of the Kindle version of WSJ is very similar to what you would find getting the print edition delivered.  There are some things missing such as stock quotes but that's ok because it's easier to look up and read stock quotes and such on the web.  The format makes navigating the paper a bit cumbersome.  Graphs, photos, and other graphics are poor in the Kindle format.  It helps that this subscription comes with WSJ Online and iPhone access.  WSJ Online is very good and the iPhone app is terrible.  Not only is the content via the iPhone app incomplete, you have to put up with ads!Considering the new cost of $21.62/month or $.072/day I think the cost for electronic format is way overpriced considering its deficiencies.  I am seriously considering canceling.6/2/2012 Update: I have canceled my subscription.", "overall": 2.0, "summary": "Kindle Edition is OK, online great, iPhone app is sadly lacking...", "unixReviewTime": 1285891200, "reviewTime": "10 1, 2010"}
{"reviewerID": "A1CWMO3LQQ7P0P", "asin": "B000FDJ0FS", "reviewerName": "Keith Wissman", "helpful": [4, 5], "reviewText": "ten days into my trial subscription and i have decided to cancel. have read the wsj for 30 years and i guess i have one foot in the digital world and one in the analog world.i won't repeat all of the other comments, i can concur on the difficulties of making the transition to kindle reading. if i was still in a job that had me traveling alot it might make sense but since i pick up my wsj of my front porch it just doesn't work.the one thing that really baffles me is how to cancel a free trial. unless the magic button is hiding right out in the open, i can't find a website or kindle method to cancel. i had to call into customer service and yes, it got taken care of but i was disconnected three times before i made it into the queue, the fidelity of the call made it almost impossible to understand what the person was saying, and the english of the rep was spotty at best. not up to the usual amazon quality.", "overall": 1.0, "summary": "Big Disappointment", "unixReviewTime": 1251936000, "reviewTime": "09 3, 2009"}
{"reviewerID": "A3EUWDJRITS8SB", "asin": "B000FDJ0FS", "reviewerName": "ljkr", "helpful": [0, 0], "reviewText": "Always love to get this newspaper in my Kindle. I really enjoy the insightful opinion pieces. Quick read on the days headlines and how they apply to us non financial types. Please enjoy. I know I do.", "overall": 5.0, "summary": "Still a great newspaper", "unixReviewTime": 1362787200, "reviewTime": "03 9, 2013"}
{"reviewerID": "A21EAOIDC2EITY", "asin": "B000FDJ0FS", "reviewerName": "Mark", "helpful": [1, 1], "reviewText": "This paper costs a lot per online issue but there's lots of good content.I'd like to choose what region to download from.  Maybe there's some way to do that but I always get the NYC version.Good newspaper.", "overall": 5.0, "summary": "Good reporting.  Lots of Content.", "unixReviewTime": 1389484800, "reviewTime": "01 12, 2014"}
{"reviewerID": "A1AKKYXG0Y0ULL", "asin": "B000FDJ0FS", "reviewerName": "S. Michael", "helpful": [12, 13], "reviewText": "My Combination Online/Print version of the WSJ cost $160 per year.  The kindle version alone will run me $180 per year.  I might buy single issues for .99 a day on vacation but otherwise, I guess I'll keep filling up the landfills.  At the old $100 per year I would have switched.  Amazon...are you listening???", "overall": 1.0, "summary": "Too Expensive", "unixReviewTime": 1284422400, "reviewTime": "09 14, 2010"}
{"reviewerID": "A11I1I9QLMAM1A", "asin": "B000FDJ0FS", "reviewerName": "S. Power", "helpful": [10, 10], "reviewText": "When it comes to speed and convenience, there is no better way to read the Wall Street Journal. With almost no advertisements, you just get the articles and pictures in a very concise and easy to read format. With wireless delivery, you get the paper delivered to your Kindle, no matter where you are, as soon as it comes out.I can't say enough how much I enjoy this version of the Wall Street Journal. With it being in my Kindle am able to have it with me, whenever I'm looking for something to read.  Perfect for the commute and for unexpected waits.My only complaint is a small one.  In the \"Page One\" section of the paper, it has several \"What's News\" blurbs, after the first couple articles.  While this is useful on the print version, it is annoying and distracting on the Kindle.  You get the first paragraph of articles deep in the paper, with a link to get to them.  Since the menu page already has links to every single article in the paper, this is detracting, disrupts the flow of reading the paper, and is pointless.  I really wish that they would get rid of these \"article teaser links\", but in the mean time, I'll just have to get used to skipping them.Overall, I really love the WSJ on my Kindle.  I highly recommend you get it in this format.  Good luck when you cancel your paper version, though, as they'll keep delivering it to you long after you cancel (so they can keep reporting you as a reader to their advertisers).  Magazines and newspapers are the best thing about Kindle.", "overall": 4.0, "summary": "Excellent and convenient way to read the WSJ, with 1 complaint..", "unixReviewTime": 1309564800, "reviewTime": "07 2, 2011"}
{"reviewerID": "A18FT4SOVZ4CCW", "asin": "B000FDJ0FS", "reviewerName": "SunbowSue", "helpful": [1, 1], "reviewText": "I downloaded to read while sitting at the ocean!  Something cool about reading the journal and being at the beach!  I like their articles!", "overall": 5.0, "summary": "A good read!", "unixReviewTime": 1368057600, "reviewTime": "05 9, 2013"}
{"reviewerID": "A9FVWRHMM550F", "asin": "B000GFK7L6", "reviewerName": "Amazon Customer \"EmanEkaf\"", "helpful": [6, 8], "reviewText": "i thought the n.y. times was a morning daily.  i'm on the west coast.  in new york, it's nearly noon.  i haven't received today's paper yet.  i left wireless on all night, and have been reading other kindle content all morning.  is this standard?", "overall": 1.0, "summary": "what time do i get today's paper?", "unixReviewTime": 1257206400, "reviewTime": "11 3, 2009"}
{"reviewerID": "A19ZRAIDBMQD7M", "asin": "B000GFK7L6", "reviewerName": "Amazon Customer \"Math puzzler\"", "helpful": [3, 3], "reviewText": "The 2 month free trial is well worth a try.  I'll say that up front.Second, NYT is a great paper.  I haven't gotten newspapers in a while, due wanting to cut down on the amount of trash I generate, and because I got tired of excessive advertising.  Blah, blah, blah .... now that I'm getting NYT as a wake up each morning, I'm remembering what I was missing.I'm spending 20 minutes per morning reading through the parts I find interesting.  It's good stuff.  I'll probably continue after the trial is over.That said, I agree that that price is a tad high.  I'd be much more comfortable with less than $20 per month, considering how much is stripped out.Also... someone at NYT should read these before they go out.  The Bridge column last week made numerous references to the missing diagram.  I can understand leaving out some pictures, but vital pictures should never be left out.  If you're going to leave out pictures, I think all the static Op-ed pictures can be left out.  The bridge column without diagrams is pointless, so it should be added to items to strip out -- or to include diagrams with.Good science section so far.  I miss the crossword.  Even if the crossword wasn't interactive, I'd love to see it.  I have some grid paper.NYT is really close here, I think, so with a little more care, they could have something less frustrating to send out.----------------------I've decided to continue subscribing.  I've been reading NYT in bed before getting up for awhile now, and it's a great way to start the day.  I'd still like for it to be better, but reading the newspaper in bed in the early morning is a new joy I don't want to give up.", "overall": 5.0, "summary": "Very improvable, but I'm warming to it", "unixReviewTime": 1291334400, "reviewTime": "12 3, 2010"}
{"reviewerID": "A39N0BN4B2Q7F", "asin": "B000GFK7L6", "reviewerName": "Amazoner \"reader, thinker, doer\"", "helpful": [1, 60], "reviewText": "The NYT is way over-rated. Just a few examples. On their first page, they talked about saving the nation's energy by painting roofs white. Any white paint? No, special white paint from government labs! It turns out any old white paint will do, that a government program is not necesaary, but the NYT did not say so. Irresponsible. In the area of health reporting, Pope wrote a silly article about a Dr. Kesler's book about food. She did not mention that, as head of the FDA, he was engaged in running battles with vitamin and food manufacturers for years. Many of these battles he lost in the courts, which is now why we can use aspirin for heart treatment, which is just as good as the expensive biotech drugs the FDA was touting. Uncritical and irresponsible reporting. A dereliction of the journalist's duty.And what about the economists like Krugman who don't have a clue about how to save the nation's economy. Yet they pontificate in those pages.If you are a times reader, i encourage you to find better sources.Later...To continue this rant, I posted a comment on the NYT website in response to an article. My tone was reserved and systematic. The subject was the blocking of medical innovation by the medical bureaucracy and government. (FDA) GUESS WHAT? tHE COMMENT WAS ERASED. They evidently censor comments they don't agree with, or that may offend their advertisers. Is this the kind of society you want? You may not agree with me, but do you want to shut up those you  disagree with? Hint: You could be next.So my objections to the NYT are ethical and moral. Unfortunately, they have become government hacks rather than responsible journalists.", "overall": 1.0, "summary": "Irresponsible jornalism and stale ideas", "unixReviewTime": 1253059200, "reviewTime": "09 16, 2009"}
{"reviewerID": "A3GXR6CHHPX0JS", "asin": "B000GFK7L6", "reviewerName": "Barry Owens", "helpful": [0, 0], "reviewText": "There is so much information packed into each daily issue that I just don't have time to read it all and read my other books and kindle magazines too. All the news that makes the New York Times such a great newspaper is included in the Kindle edition minus the ads. If you have time to read it daily it is well worth the $19.99 monthly subscription price.", "overall": 5.0, "summary": "I wish I had time to read it.", "unixReviewTime": 1393804800, "reviewTime": "03 3, 2014"}
{"reviewerID": "A2R0DBIL3M14HS", "asin": "B000GFK7L6", "reviewerName": "Bruce J. Blanchard \"Darkenwulf\"", "helpful": [7, 10], "reviewText": "I am a big fan of the NY Times and see it as one of the top newspapers in the U.S.  One: $19.99 for the Kindle download covers every edition for the month.  Okay, say you miss looking at it for a day or two, that is still an excellent price.  You don't have time to read it all, no problem.  The fact is this is an everyday download.  Well worth the price.  Two, and listen up, you also get access to the NY Times on their homepage giving you the articles and the opportunity of email letters sent to your box which outline the major stories of the day, just in case your life has been particularly busy.  Like I said, downloading the NY Times through Amazon is a Double Plus.  Pass this on.", "overall": 5.0, "summary": "Download a Double Plus", "unixReviewTime": 1309996800, "reviewTime": "07 7, 2011"}
{"reviewerID": "A1U7LS93I03MFW", "asin": "B000GFK7L6", "reviewerName": "Christopher K. Koenigsberg", "helpful": [5, 5], "reviewText": "I do enjoy reading the Times on my Kindle.It is a little expensive but it's my one major indulgence, Kindle-wise.I can carry my Kindle around and snatch quick reads of a page or 2, all day and night. (ever since I was a kid in the 1960's, my grandpa, and then my dad, and then I, would always read the Times every morning, on paper)The content is usually fairly well formatted for the Kindle, with occasional exceptions. The graphics are rendered in greyscale and usually you can see basically what's going on there. I always go by the \"Articles List\", and I appreciate having summaries of each article there.I wish that some more of the online-only content would be included (but I guess they sell their blogs separately, for Kindle subscriptions). And a few sections are uninteresting to me (Sports, etc.) so I wish I could \"skip this section\" while still in the \"Articles List\" (you can skip a section but only in the \"Sections List\", except then you lose your place in the \"Articles list\").", "overall": 4.0, "summary": "pretty good for Kindle, not perfect", "unixReviewTime": 1233878400, "reviewTime": "02 6, 2009"}
{"reviewerID": "A3AKG73AM4OKSI", "asin": "B000GFK7L6", "reviewerName": "Dave W", "helpful": [0, 0], "reviewText": "The NY times is great to read.  It's a little expensive, in my opinion for an e-reader version so I don't buy it often.  But when I do, I enjoy reading this news paper.", "overall": 4.0, "summary": "good newspaper", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A3BBW3E3I1QWU1", "asin": "B000GFK7L6", "reviewerName": "Douglas Banks", "helpful": [0, 1], "reviewText": "I have not received one of my fourteen free copy of the NYT so please end my non subscription at this time, meaning I'm not agreeable to any charges being placed against my account for NYT.  Thank you.  Douglas", "overall": 1.0, "summary": "NONE RECEIVED", "unixReviewTime": 1391904000, "reviewTime": "02 9, 2014"}
{"reviewerID": "ABXANRX4GPYRZ", "asin": "B000GFK7L6", "reviewerName": "hdtravel", "helpful": [7, 22], "reviewText": "This is it, the big kahuna of newspapers delivered right to your Kindle. You do not even need to get out of bed or off the throne to retrieve a soggy paper version from your snowed in yard.Just read it right there on your beloved Kindle.The problem is the high price for what you get and the pesky DRM content that you have to put up with.All the Kindle content is like this. This is the evil DRM inherent in the Kindle. It only lets you view the content on the Kindle. No printing articles, no emailing articles to a friend, no using it in presentations. You are stuck. Very evil is it not !So, if you can live with the price and restrictions of DRM then go for it my friend.", "overall": 2.0, "summary": "Too Expensive and Pesky DRM", "unixReviewTime": 1203811200, "reviewTime": "02 24, 2008"}
{"reviewerID": "A2YQHT0W72J4HT", "asin": "B000GFK7L6", "reviewerName": "Jim D.", "helpful": [0, 0], "reviewText": "I periodically buy a paper copy to enjoy over a cup of coffee.  The E-book edition is convenient whenever I have a few minutes to spare and no available coffee shop.  My only other comment; when buying a hard copy one day, the E-book edition the next day may include some duplicate stories.", "overall": 4.0, "summary": "A good summary of current events", "unixReviewTime": 1358035200, "reviewTime": "01 13, 2013"}
{"reviewerID": "A1JQPKTE1Z7P0U", "asin": "B000GFK7L6", "reviewerName": "Jo-Ann Carson", "helpful": [0, 0], "reviewText": "There are many ways to get the news these days. In fact it barrages you through all the media all day long. But I choose to read the New York Times on my Kindle to get the facts and opinions. It's like an anchor in a storm.", "overall": 4.0, "summary": "Comprehensive, Well Written News", "unixReviewTime": 1356048000, "reviewTime": "12 21, 2012"}
{"reviewerID": "AJNIKU4GSIWHY", "asin": "B000GFK7L6", "reviewerName": "J. Wallace", "helpful": [3, 3], "reviewText": "The NY Times in Kindle format is great!  The majority of the paper is there each day and it's easy to navigate and read.  The print portion of articles is good, but the quality of the limited number of pictures or other rare graphics could be better.  Sometimes there's an article missing one day; then it pops up in the next day's issue.  That's acceptable to me because I know at some point the day's edition has to be closed and distributed.  What I really like is not having the annoying distraction of ads.  Considering the excellent content, the cost isn't that bad at ~$0.67/day.12/26/2010 update: After two months I've canceled the subscription.  I would subscribe again if the cost was $10/month but at $20/month it is too expensive for a digital edition of the paper.", "overall": 4.0, "summary": "NY Times in Kindle format is great!", "unixReviewTime": 1288915200, "reviewTime": "11 5, 2010"}
{"reviewerID": "A13OGC4WSU6SJ2", "asin": "B000GFK7L6", "reviewerName": "Laurie the librarian", "helpful": [0, 0], "reviewText": "I am particularly partial to the &#34;Book Review&#34; section.  I read the KINDLEedition so I'm not awash in newspaper advertising etc.  It gets me up tospeed on the news... at least what they want to tell us... on a weekly basis.", "overall": 4.0, "summary": "Sunday edition only...", "unixReviewTime": 1373328000, "reviewTime": "07 9, 2013"}
{"reviewerID": "AZAVNEYNBJWXJ", "asin": "B000GFK7L6", "reviewerName": "Manaus", "helpful": [0, 1], "reviewText": "With a life of one day it is very difficult to rate a newspaper  - they are read for news and other items and serve an extremely practical purpose.  The New York Times has a good reputation and that stands  and whilst in the USA it is a good daily read with interesting articles, news items etc.  If it wasn't up to standard, it would fade away very quickly so &#34;reviewing it&#34; is a little unnecessary.  Enjoy the paper, read it for leisure and information and be thankful you don't live in a nation without such information readily available and virtually free.", "overall": 3.0, "summary": "How and Why does one Rate a Newspaper!", "unixReviewTime": 1393891200, "reviewTime": "03 4, 2014"}
{"reviewerID": "A30YCQ4MOZAI6Y", "asin": "B000GFK7L6", "reviewerName": "Michelle R", "helpful": [7, 8], "reviewText": "When I first got my Kindle, one of the first things I did was take advantage of the 30 trial and subscribe to the NYT. At that time I think the monthly rate was either 11 something or 13 something. The novelty of it was great at first. Seriously, the only thing that makes a person feel spoiled about waking is a newspaper delivered right to your bedside is a butler and breakfast in bed, or so I imagine. It didn't particularly bother me about the features missing because the price was good and the convenience was amazing. In the middle of nowhere, it was feasible to get most, if not all, of the news that's fit to print. Good deal.The paper is usually a delight, but here's where the practical came in. I ended up falling into a pattern of not reading it every day, and what was initially perfectly fine. The subscription was a bargain. The paper was there on the days I wanted it. When they announced the subscription hike, I knew it wasn't for me, because it made it feel wasteful, it made me feel guilty to think of not reading it daily. Once something I read in my leisure time feels like an obligation... In my case, and your needs might be quite different, the folks at the paper priced it right off my Kindle -- except by invitation.There are still periodicals I do subscribe to, like Time and Newsweek, blogs like Slate, and  a few others where the prices are in a range that I don't feel horrible if I skip an issue. With newspapers, however, I prefer to buy a single issue when I feel like it or if there's an event I see as historical. Sunday usually has me buying 3-4 papers to read over breakfast and throughout the day. (NYT, of course,  The Sunday NYT is heaven; my hometown paper, The Detroit Free Press; The San Francisco Chronicle; and often the Boston Globe. I feel more spoiled than ever now, because I'm taking advantage of having the papers *I* want, when I want them, without getting the editions I don't want, and it takes 2 minutes to select and receive them. When I hear of a good article on a day when I haven't purchased, it's usually found online.My recommendation is to get the trial and see what you think. See if you read it daily. See if it feels like a bargain. The beauty of the Kindle format is the convenience and so it only matters what method works for you -- subscription or my method of buying as needed.The NYT is 4 or 5 stars on the days I read it, but too expensive for me to maintain a subscription and allow issues to remain unread, so I'm giving it 3 stars overall since most people are probably reading this with subscribing in mind and strongly suggesting potential subscribers take advantage of the trial period.", "overall": 3.0, "summary": "I love the NYT -- sometimes. (Personalizing my experience.)", "unixReviewTime": 1291766400, "reviewTime": "12 8, 2010"}
{"reviewerID": "A12HFPBGK2T6XV", "asin": "B000GFK7L6", "reviewerName": "Mike P", "helpful": [5, 5], "reviewText": "Just an awesome kilndle paper. The content cannot be beaten. Great writing and all around coverage of the news. Just way too costly at $20.00 per month. $5 more than the next costliest paper. I wanted to continue my subscription but there are way too many other papers out there from $6 to $10 per month. Would give it 5 stars but for the cost.", "overall": 4.0, "summary": "Fantastic BUT way too costly", "unixReviewTime": 1295481600, "reviewTime": "01 20, 2011"}
{"reviewerID": "A3VBZDYGHF4NK8", "asin": "B000GFK7L6", "reviewerName": "Movie Maker \"Rik\"", "helpful": [1, 1], "reviewText": "I admit I am biased, as I already loved the content of NYT.I love reading about finance, entertainment, style, and of course current events. The Kindle edition is easy to navigate, filled with pictures and is a pleasure to read.The Kindle edition does exactly what it supposed to do - making it a great reading experience.  On occasion, I might supplement this by looking at the online edition (if I MUST see a color picture, or something).  The online editions can be hard to read, and are best for a glance - I have it on an iPod Touch - nice to have, but not exactly my idea of a desired reading experience like Kindle.Like clockwork, the paper arrives early each morning (no more missed papers), easy to search headlines and a nice compliment to the online edition, in a great reading format.Well done!", "overall": 4.0, "summary": "An iconic paper, well done on Kindle, worth a try.", "unixReviewTime": 1256688000, "reviewTime": "10 28, 2009"}
{"reviewerID": "AJLPS4A9HGOQK", "asin": "B000GFK7L6", "reviewerName": "Patricia", "helpful": [0, 0], "reviewText": "I LOVE the NY TIMES and have been a at-home subscriber for 10-12 years, but that method is not cheap.  Two people in our household have iPads and starting reading it there.  I liked what I saw and when I got a Kindle Fire HD I switched over.  I still love the Times but the iPad app is nicer - it looks like the paper's front page - whereas the Kindle app is not as nice.  I still believe all the content is there and I read it daily and I love the fact that it costs only a third of home delivery but I do miss seeing the front page view.  On the Kindle it comes up as a series of stories.  Once you click on a story, then you do get the pictures and it looks even better than the newsprint because of color but believe it or not I miss all those gorgeous full page adds in the Times!  There are no ads on my Kindle version but the iPads do get some kind of ads but not the ones in the hardcopy paper.  I give the Kindle App 3 or 4 stars but the Times itself always gets 5 stars from me.  You can't get that news anywhere else.  I hope Amazon improves the app so that my iPad family members can stop snickering!", "overall": 4.0, "summary": "The Times is Great but the Kindle app lacks a little", "unixReviewTime": 1356652800, "reviewTime": "12 28, 2012"}
{"reviewerID": "A188PSUW6HG2AK", "asin": "B000GFK7L6", "reviewerName": "R. Tilton \"rstde\"", "helpful": [6, 6], "reviewText": "Below you will see my review for the old Kindle app which I rated one star.  I am now upping it to three stars.  I canceled the paper with the old app because it was too incomplete.  This version has more of what is in the paper.  Sadly you can no longer buy a single addition proving yet again that the Times does not have much respect for the consumer, but I will subscribe to this when I am away from the paper version and cancel when I am in an area with access to the real paper.ORIGINAL REVIEW:  I have had the Kindle version of the paper for a year or so and have enjoyed having it on the road.  However, it is an extremely abridged version of the paper.  So if you need some information like theater schedules, you need to use the online version.  The Kindle version is particularly bad since it has very little of the actual paper information.  It also is far inferior to the online version.  I finally had to give it up since it really is inadequate and woefully overpriced at nearly double other papers.  I suggest getting the free BBC app and USA today free version (not that I particularly like USA today).  But the combination of these two free services is far superior to the NYT Kindle version.  Or subscribe to just the NYT online version which has a full news experience though it is very cluttered compared to some of the cleaner more modern news apps.", "overall": 3.0, "summary": "The New App is better", "unixReviewTime": 1270425600, "reviewTime": "04 5, 2010"}
{"reviewerID": "A18FT4SOVZ4CCW", "asin": "B000GFK7L6", "reviewerName": "SunbowSue", "helpful": [0, 0], "reviewText": "I downloaded to read while on vacation!  It's a good paper, covered just about everything I was interested in reading about!", "overall": 4.0, "summary": "A Good Paper", "unixReviewTime": 1368057600, "reviewTime": "05 9, 2013"}
{"reviewerID": "A1W5C4LPCVTPXE", "asin": "B000GFK7L6", "reviewerName": "sunmoon", "helpful": [0, 0], "reviewText": "Love the paper. Great writers but cancelled my subscription due to the price. If the price comes down to like $12/mo I might buy it them. I do buy an occasional single issue for $.99 which I really like. Gave 5 stars for the papers content. I can't rate low due to the cost since I was aware of the cost when subscribing.", "overall": 5.0, "summary": "Great Paper but would like a lower price", "unixReviewTime": 1296345600, "reviewTime": "01 30, 2011"}
{"reviewerID": "AFG1HBKPFAG5S", "asin": "B000GFK7L6", "reviewerName": "Tyme4abook", "helpful": [0, 0], "reviewText": "Forget this..My iPad version of the Times is the real paper--photos, ads and all.  The Kindle edition is not that.  Yes, you get the stories, but if you're looking for a &#34;newspaper&#34; experience, this is not it.", "overall": 1.0, "summary": "Just an abbreviated version", "unixReviewTime": 1387497600, "reviewTime": "12 20, 2013"}
{"reviewerID": "A3AKG73AM4OKSI", "asin": "B000HA4FKY", "reviewerName": "Dave W", "helpful": [0, 0], "reviewText": "I purchased this issue of the Boston Globe because other newspapers were more expensive.  I found that the writing and coverage were of high quality and at a good price.  I will buy future issues of this newspaper, for sure.", "overall": 4.0, "summary": "good, quality newspaper - Boston Globe", "unixReviewTime": 1346889600, "reviewTime": "09 6, 2012"}
{"reviewerID": "A1WSRZATV3MLXQ", "asin": "B000HA4FKY", "reviewerName": "Denny Jackson \"The Racer\"", "helpful": [1, 2], "reviewText": "Out of all the newspapers I've looked into, The Boston Globe is the most jam packed of any that I've seen. If you are from New England, this paper is for you on a kindle.", "overall": 5.0, "summary": "Jam Packed", "unixReviewTime": 1332460800, "reviewTime": "03 23, 2012"}
{"reviewerID": "ABXANRX4GPYRZ", "asin": "B000HA4FKY", "reviewerName": "hdtravel", "helpful": [11, 20], "reviewText": "Here it is the premier newspaper of New England sent automatically to your beloved Kindle while you sleep.No more trudging out in the snow only to find a wet, soggy, glop of dead trees !Nice !", "overall": 4.0, "summary": "Finally at last a new newspaper for Kindle", "unixReviewTime": 1203984000, "reviewTime": "02 26, 2008"}
{"reviewerID": "A13OGC4WSU6SJ2", "asin": "B000HA4FKY", "reviewerName": "Laurie the librarian", "helpful": [0, 0], "reviewText": "I live in a town adjacent a 'medium' sized city in Massachusetts.  The local newspapers leave a lot to be desired.When I REALLY want to know what is going on... I read &#34;The Globe&#34; ... It gives me what I want to know in a timelymanner.", "overall": 5.0, "summary": "when I REALLY want to know!", "unixReviewTime": 1402531200, "reviewTime": "06 12, 2014"}
{"reviewerID": "A32Q5HN7RQN6GL", "asin": "B000HA4FKY", "reviewerName": "PHL1111", "helpful": [55, 62], "reviewText": "I live in Boston and had been waiting for the Boston Globe to become available for the Kindle since mine arrived on December 4, 2007. I subscribed the first day I found out about it and have not been disappointed. I am not a big print newspaper fan, I find them environmentally unfriendly, dirty (think blank ink on hand), and they contain a lot of information I usually have no interest in (ads, sports, stock lists, etc.) so they are thicker than I need them to be and messy. I won't even take the two free papers offered at the subway on most days (the excellent Metro and the whiny bloggy Boston Now). On the other hand I find the web version of newspapers hard to drill down to find the articles that apply only to today - if you know the topic you can do a search but there's really no way to tell if I at least skimmed all the articles for the day.Enter the Kindle edition which solves most of my complaints about the print and web edition of the Boston Globe, while all the material I am not interested in is still there it is easy to bypass and doesn't really cause any clutter or eat up resources (a few kb of disc space I guess). Some pictures are now beginning to appear too. The ads are gone (so unless you only buy the paper for the ads - some people do - you will be pleased). The Contents, Sections and Next Article layout is great. From the main page you can just skim all the headlines by hitting the next page button until you get to the end - and then you'll know you haven't missed any of today's headlines. If you want more detail you can select the headline link. You can then once finished reading the article (or deciding only to read some of it or none of it) easily hit the back button to return to the list, or if you've finished the article you can go forward directly to the next story (comes in handy in your favorite section if you know you want to read most articles there). The only thing that's missing is the comics and the death notices but you can read those on-line at the comic sites in the first case and the Globe's site in the case of death notices - if you really, really want to.Good job.", "overall": 5.0, "summary": "Finally! Easy to Read; Easy to Skim", "unixReviewTime": 1205539200, "reviewTime": "03 15, 2008"}
{"reviewerID": "A10E0V7PQY9ERD", "asin": "B000HA4FKY", "reviewerName": "Ravi Ramaswami", "helpful": [1, 1], "reviewText": "For an e-newspaper that has primarily local interest news, little international coverage,sub optimal national coverage and insipid editorials, the price of the Boston Globe's Kindle edition is disproportionately high.It seems that the newspaper is limping- trying to find its way into the world of e-papers but its limp is very noticeable.", "overall": 1.0, "summary": "Overpriced and sub par", "unixReviewTime": 1330560000, "reviewTime": "03 1, 2012"}
{"reviewerID": "A31EF21IMGXE7F", "asin": "B000HC48T0", "reviewerName": "Amazon Customer \"Questions Authority\"", "helpful": [0, 1], "reviewText": "Cool, forgot I had this until the request to rate it came in ... this makes mine an unreliable rating ... doubt that will change the rotation of the planet enough to measure.", "overall": 5.0, "summary": "Washington Post ... All the news thats fit.", "unixReviewTime": 1371772800, "reviewTime": "06 21, 2013"}
{"reviewerID": "A3775OP5VTX5ON", "asin": "B000HC48T0", "reviewerName": "Coolkayaker \"ck1\"", "helpful": [3, 24], "reviewText": "I am not from Washington, but enjoy good media.  Unfortuntely, the Washington Post is mostly about politics, or the Redskins and other local stories pertient only to Washington DC.  Whereas the NY Times is more international, and the Wall Street Journal is very business oriented but at least national, the Wash. Post is very narrow.  I unsubscribed.", "overall": 2.0, "summary": "Too provincial.", "unixReviewTime": 1203120000, "reviewTime": "02 16, 2008"}
{"reviewerID": "A3AKG73AM4OKSI", "asin": "B000HC48T0", "reviewerName": "Dave W", "helpful": [0, 0], "reviewText": "The reporting is good - this is just higher priced than some other good newspapers so I tend to get the other newspapers which have basically the same news.", "overall": 4.0, "summary": "good reporting", "unixReviewTime": 1380672000, "reviewTime": "10 2, 2013"}
{"reviewerID": "A3DKP8M0GSP8UK", "asin": "B000HC48T0", "reviewerName": "Justice for Trayvon", "helpful": [3, 4], "reviewText": "I enjoy getting the Washington Post (wp) every morning on my new k2 device.  K2 allows me to view every headline within the paper and to view the break down of the number of articles that are within each section and to view items in that section only if I choose to do so. Included in the wp k2 edition is front page, metro (for every county), style, editorials, classifies, obituaries, world, politics, health, sports, metro, home, etc. Some sections, are not published daily; therefore, are not included on my k2 daily, such as, health, food, etc.I really enjoy reading the wp on my k2 while doing cardio at the gym. I've always used that time to read the paper, but now I no longer have to struggle with keeping the pages together or worry about the paper falling and having to get off my cardio machine to pick it up.The daily rate is $.75 or $9.99 a month. Now, I can smile that paper is not being wasted when I read the wp on my k2 each morning.", "overall": 5.0, "summary": "Kindle Washington Post Edition", "unixReviewTime": 1235606400, "reviewTime": "02 26, 2009"}
{"reviewerID": "A13OGC4WSU6SJ2", "asin": "B000HC48T0", "reviewerName": "Laurie the librarian", "helpful": [1, 4], "reviewText": "This was a one-time cursory look.  If one is interested only in what is going onin Washington and what is dished to the regular press, this is good to read.", "overall": 3.0, "summary": "GOOD FOR WHAT IS DOING IN WASHINGTON", "unixReviewTime": 1374624000, "reviewTime": "07 24, 2013"}
{"reviewerID": "A1LXBSTVRMWX2K", "asin": "B000HC48T0", "reviewerName": "LUIS GUSTAVO DE OLIVEIRA PONTES", "helpful": [0, 0], "reviewText": "I love read the Whashington Post in my Kindle Reader because it's very good and important for everyone. I recommend it!", "overall": 5.0, "summary": "I love read The Washington Post in my Kindle Reader!", "unixReviewTime": 1396742400, "reviewTime": "04 6, 2014"}
{"reviewerID": "A188PSUW6HG2AK", "asin": "B000HC48T0", "reviewerName": "R. Tilton \"rstde\"", "helpful": [1, 1], "reviewText": "Why is it that these great newspapers cannot figure out the digital format?  The kindle versions frequently are stripped down versions without photos and charts and in many cases without some of the sections.  Do they really think that people want to pay for that.  There are too many free news sources that can accomplish this level of news.  If they really want to get subscribers to pay, they need to provide a newspaper experience (some people even like the ads!!)  The new Kindle version of the New York Times is an example of an improved newspaper experience where the kindle version has even more pictures than the paper in some cases (this is what digital can excel at).  The times still has its weaknesses but its an improvement.  The Post is still not worth buying digitally.", "overall": 3.0, "summary": "Another Blah digital newspaper", "unixReviewTime": 1376524800, "reviewTime": "08 15, 2013"}
{"reviewerID": "A3SZMGJMV0G16C", "asin": "B000JMKNQ0", "reviewerName": "Andrew Pruette \"Rancors Love to Read\"", "helpful": [4, 4], "reviewText": "Karen Traviss was noted during her time as a Star Wars author for her fascination with the Mandalorian culture along with her disdain for the Jedi. These traits fueled several exceptional stories in the Republic Commando novels but also started to become a bit of a distraction over time, especially as her stories became increasingly drenched in Mandalorian worship. It's an interesting choice to have her author a short story (originally an e-book) for the New Jedi Order, as beyond a nod in the final volume, Mandalorians are conspicuously absent. This story is very much like her full length Star Wars novels: Mandalorian focused, chapters starting with intriguing italicized quotes from various in-universe sources, and a very cinematic way of staging scenes and cutting between them.So it turns out the choice was a good one: having Ms. Traviss bring her sensibilities to the New Jedi Order provides a sorely-needed shift from the overall tone of the nineteen novels. It's fascinating how she juxtaposes Boba Fett and his allies against the Yuuzhan Vong, two cultures both comfortable with violence as a means to an end but diametrically opposed as to the means. This story is set chronologically before Vector Prime, meaning it could be a reader's first introduction to the Yuuzhan Vong culture, and overall I would say that's neither worse nor better than first encountering them via Vector Prime. It's just different, as Vector Prime shows the Vong through the lens of the Jedi and here we meet them through the alternate viewpoint of Mandalorian mercenaries.This story brings us up-to-date on an older Boba Fett, one still living the mercenary life while also having responsibilities as the Mandalore, the leader of his people. It's an interesting dynamic how Fett feels a sense of duty to this role while simultaneously keeping it at arm's length. The sequences where Fett and a companion walk through a Vong vessel and encounter the extra-galactic invaders for the first time is superb, as we see their disgusted reactions to the bloody Vong culture firsthand. The ending of the story leaves the Mandalorians as true anti-heroes, secretly doing the right thing while being openly despised for their seemingly traitorous actions. I would have liked to see this thread interwoven throughout the New Jedi Order, but alas, A Practical Man was penned late in the game.Despite any misgivings I developed over time with Ms. Traviss' tendency to elevate the Mandalorians and demonize the Jedi in her writing, there is no denying that she was an exceptional Star Wars author. Her stories are distinct, hard-edged, and propel along much like the films themselves, even when they get heavy on dialogue vs. action. Boba Fett: A Practical Man is a distinct entity in the New Jedi Order and well worth a read: even better, it could be read by someone interested in Fett and his people without having to go further in the nineteen books that follow.", "overall": 4.0, "summary": "Worthwhile addition to the New Jedi Order", "unixReviewTime": 1331769600, "reviewTime": "03 15, 2012"}
{"reviewerID": "A2EN84QHDRZLP2", "asin": "B000JMKNQ0", "reviewerName": "Carl craft", "helpful": [0, 0], "reviewText": "Good read. I enjoyed the look into another side of Boba fett. I suggest is as a gate way to the next set", "overall": 5.0, "summary": "Another reader", "unixReviewTime": 1388620800, "reviewTime": "01 2, 2014"}
{"reviewerID": "A1UG4Q4D3OAH3A", "asin": "B000JMKNQ0", "reviewerName": "dsa", "helpful": [0, 0], "reviewText": "Boba Fett sort of gets screwed, but turns it around when he starts screwing over the Yuzahn Vong.  Very Cool.", "overall": 5.0, "summary": "Fetts the man", "unixReviewTime": 1381449600, "reviewTime": "10 11, 2013"}
{"reviewerID": "AQZH7YTWQPOBE", "asin": "B000JMKNQ0", "reviewerName": "Enjolras", "helpful": [1, 1], "reviewText": "It's nice to see an author go back and visit the New Jedi Order era. This time, Karen Traviss combines fan favorite Boba Fett and NJO favorite Nom Anor to show the Mandalorians' role in the Yuuzhan Vong war. Traviss does a pretty good job fitting both into their characters. Boba Fett is appropriately cynical, but at the same time also concerned about the Mandalorians. Traviss doesn't yet go so far as to make Boba Fett one of the good guys. It's an interesting character transformation. We also get to see Nom Anor's private thoughts and a bit more insight into his time as infiltrator.Even for a short story, it seemed a bit too short and ends rather abruptly. I would have liked to have seen  bit more, or at least learn what the Mandalorians did after the first few weeks of the invasion. It's tough to be satisfied with this after reading Unifying Force, where Han sees Boba Fett fighting alongside Alliance troops. Hopefully that story will be written one day.", "overall": 4.0, "summary": "A fun story", "unixReviewTime": 1307145600, "reviewTime": "06 4, 2011"}
{"reviewerID": "A38Z3Q6DTDIH9J", "asin": "B000JMKNQ0", "reviewerName": "Jimmy J. Shaw \"oldbent1\"", "helpful": [1, 3], "reviewText": "This is an ebook and is a good read, but why not just include with one of the new Jedi Order books as a supplement??? It is fun to read it on my Kindle, but still the same it could have been added to several of the New Jedi Order series.............", "overall": 4.0, "summary": "Star Wars: Bobba Fett: A Practical Man", "unixReviewTime": 1239840000, "reviewTime": "04 16, 2009"}
{"reviewerID": "A2TYXDDR7U35HO", "asin": "B000JMKNQ0", "reviewerName": "Kurt Joseph Pankau", "helpful": [1, 4], "reviewText": "I got about two pages into this before giving up. The style is clunky, the internal monolog doesn't gel with the character we know, and the story starts at the end of a chase scene that probably would have been really interesting if the author had bothered to write it.", "overall": 1.0, "summary": "Overwhelmed by Stupidness", "unixReviewTime": 1326844800, "reviewTime": "01 18, 2012"}
{"reviewerID": "A3ANJVTVKPRIKM", "asin": "B000JMKNQ0", "reviewerName": "Michael W. Gray", "helpful": [0, 0], "reviewText": "Tis is a good short story but I was hoping for more I'm not a big fan of the yuzan vong war series but this was good anyway more would have been better", "overall": 4.0, "summary": "good but to short", "unixReviewTime": 1370908800, "reviewTime": "06 11, 2013"}
{"reviewerID": "A1ZT7WV0ZUA0OJ", "asin": "B000JMKNQ0", "reviewerName": "Mike", "helpful": [0, 0], "reviewText": "I haven't gotten time to read this one yet. I intend to read it soon though. Looks like a good book.", "overall": 5.0, "summary": "my collection", "unixReviewTime": 1390780800, "reviewTime": "01 27, 2014"}
{"reviewerID": "A1J75JJ0Q2OEJN", "asin": "B000JMKNQ0", "reviewerName": "Raven A. Wind", "helpful": [10, 30], "reviewText": "Sigh... What can I say? This is more of Karen Traviss' mary-sue adventures of Boba Fett and the almighty, infallible, infinitely over-detailed and completely boring Mandalorians, who bear a strong resemblance to Scottish Highlanders in an average B-grade romance novel.It's stuff like this that makes me glad she has decided to stop writing Star Wars.As usual, Traviss throws out established canon to match her ideas and fit her story. This book is pointless, as the whole premise is flawed, based on a non-canon idea, and will be zapped out of existence once the T-Canon episodes of Clone Wars (which trump the C-Canon (soon to be S-Canon or N-Canon) ideas in Traviss' books.)Traviss has managed to take one of the coolest characters in the Star Wars universe and turn him into one of the most annoying, uninteresting, boring, obnoxious, mary-sue characters ever written. She took the quiet cool of Boba Fett, and turned him into a character who just Wouldn't Shut Up. She took Mandalorians and turned them from an elusive, lost, dying race of people who were cooler for having been scattered across the galaxy, into a clan of dancing, singing, Mando'a speaking, boastful morons whose place in canon is now a convoluted mess.And don't get me started on how plodding and over-detailed her writing is. If you want to know every tiny, minuscule, stupid thing about a character, just turn to Traviss' books. You're lucky if she doesn't tell you how, when, and where Boba acquired his underwear, and what they're made of.Suffice it to say, I'm not a fan of Traviss' work. I consider her Star Wars books to be a notch below Barbara Hambly's disastrous efforts. Read this only if you're a huge fan of Traviss, or a huge fan of Non-Canon Star Wars books... Because this one can't stand up to scrutiny.", "overall": 1.0, "summary": "A Good Reason Not to Miss Traviss' Star Wars Books", "unixReviewTime": 1250121600, "reviewTime": "08 13, 2009"}
{"reviewerID": "A12LKEM543ILBK", "asin": "B000JMKNQ0", "reviewerName": "zombie phreak", "helpful": [0, 0], "reviewText": "Let me start this review off by saying that no one, and I mean NO ONE can write for Boba Fett as well as Karen Traviss can.  When I saw this book on Amazon I was delighted and I was even more excited when I found out that she wrote it!***SPOILERS***  ***SPOILERS***  ***SPOILERS***I knew from the Star Wars comics that the Mandalorians were involved in the Vong War during their invasion and that they fought alongside them against the New Republic.  But this e-book really helped fill in the gaps that the comics and the novels left.  I knew they weren't just in it for the credits!The visuals that Karen Travis paints with her story were just amazing!  Having Boba Fett walking through the depths of one of the Vong's ships was great!  I could almost smell the slime oozing from the walls and hear the squishing of his boots as he walked across the pulsing floor.  Also, having him compare being in the ship to being back inside the Sarlaac pit was very cool as well.During the book, the Mandalorians are faced with a moral dilemma.  They have signed up with the Vong, thinking they are just an army that wants to wreck a few worlds and they'll get some quick cash off of it.  But it turns out it's an entire invasion armada and they want to destroy the entire galaxy!  Boba Fett and the Mandalorians have already taken the job so they are honor bound to stand by their word and fight alongside the Vong against the New Republic.  However in doing so, Fett adds on that the Vong have to leave his home planet of Mandalore alone.  They agree and of course they are lying to him.  But this gives Boba Fett the time he needs to mobilize his people for war.  And when you have the entire population of the Mandalorian home world gunning for you, you might just want to reconsider your course of action!While fighting alongside the Vong, Boba Fett manages to sneak information to the New Republic about the Vong, their plans, their technology and their biology.  Eventually the New Republic wises up and realizes that the Mandos are double agents and they send a Jedi Master to parley with Boba Fett.  He tells the Jedi to keep this under wraps and to keep fighting against the Mandalorians as if they are the true enemy in order to keep up the ruse so they can continue to slip the New Republic information about the invaders.  The Jedi Master asks what Fett wants in return.  He only asks for one thing, that the Republic knows that a Mandalorian warrior died to save a Jedi Master.***END SPOILERS***  ***END SPOILERS***  ***END SPOILERS***This book was awesome!  Karen Traviss continued to do what she did best in the Star Wars universe, writing for Boba Fett and the Mandalorians.  It really is too bad that she and the rest of the Star Wars writers had a falling out due to creative differences and that she is no longer writing for Star Wars.  I would have loved to read more of her work in a Star Wars setting.", "overall": 5.0, "summary": "Terrific!!!", "unixReviewTime": 1368835200, "reviewTime": "05 18, 2013"}
{"reviewerID": "A35QOI4L7CILPW", "asin": "B000JMKU0Y", "reviewerName": "Aleksandra Branka", "helpful": [0, 0], "reviewText": "There isn't one aspect of the book that I don't like. Fast paced action, the one that good action movies are made of; characters that are captivating and of course love that conquers all. Written well, paced well and, simply put, page turner. Thumbs up in my book.", "overall": 5.0, "summary": "Action and romance", "unixReviewTime": 1399939200, "reviewTime": "05 13, 2014"}
{"reviewerID": "A3GD7YSUW39DRI", "asin": "B000JMKU0Y", "reviewerName": "BBent", "helpful": [0, 0], "reviewText": "I have read several Shannon Stacey books and the Devlin Group series is by far my favorites!  This book is the 1ST of the 3 book series (in order:  72 hours, On the Edge, No Surrender).  I never read books twice, but I will definitely be revisiting this series and I saw on the authors website that a 4th one is in the works!  I can't say enough about this series and can definitely not pick a favorite!  I have read some other reviews on this 1st book and can't say I agree with the 3 and 4 star ratings, but for those of you who would be willing to read more, finish the series before you write a complete review.", "overall": 5.0, "summary": "AN AWESOME SERIES....COULD NOT PUT IT DOWN", "unixReviewTime": 1311292800, "reviewTime": "07 22, 2011"}
{"reviewerID": "A71W7G4TCTH3T", "asin": "B000JMKU0Y", "reviewerName": "BBMoreB \"Heather Coulter\"", "helpful": [0, 0], "reviewText": "This was a free kindle book that I got a couple of months ago. When I read the product description it seemed like an interesting concept - it gives you a descent overview.The heroine, Grace Nolan, is an ex-agent trying to raise her son.  The hero, Alex Rossi, is her ex-partner and the man she once loved.This book was a quick read - nothing really unexpected.  This was the first book I read by Shannon Stacy.  I wasn't overly impressed.  The fact that I saw the ending coming from page one was very disappointing - I wish that the characters were more interesting - I found I was speeding through reading it so that I could (1) get to the end, (2) check it off the TBR list, and (3) move on.  I am not going to continue the series but I have listed them here - in case anyone is interested.The second book is available - The hero is Tony Casavetti.  The Heroine is Charlotte Rhames.On the EdgeThe third book in the series is coming out June 2010:The hero is John Gallagher.  The Heroine is Carmen Olivera.  - These are characters from book one.No Surrender: The Devlin Group, Book 3", "overall": 2.0, "summary": "Missing Something~~", "unixReviewTime": 1269907200, "reviewTime": "03 30, 2010"}
{"reviewerID": "A109E01LB4H38F", "asin": "B000JMKU0Y", "reviewerName": "Carol Donaho \"Carol Donaho\"", "helpful": [2, 3], "reviewText": "I hate to be the almost lone dissenter here, but 72 hours is a story told at break neck speed losing what could have been a very good story and turning it into just ok.  I kept wanting to say, \"Whoa, slow down.  Let's learn about the characters before they go running off to be super heroes.\"The Devlin Group is a group who stops Big Bad things from happening - like spreading poison all over Gitmo.Alex Rossi is the Super Hero leader who, at one time, worked with Grace, the Super Heroine. They were a great team with both of them equally able to get to the bad guys.  Alex also doubles as Sean Devlin, the founder of the Group.  He named the group Devlin to flush out the man who killed his Mother 11 years ago.  Grace was not aware of this story.  Alex and Grace had a baby but Alex was never told about him because Grace wanted to keep the baby, Danny, safe from the Super Hero's enemies.  All of this is for naught as Danny is kidnapped.  While this sounds somewhat complicated, Stacey does a good job of keeping things clear and the reader is never confused as to the story line.There are two other major characters, Carmen and Gallagher, who also help with the Devlin Group.The downside is that this adventure/romance is told so fast that there is little character development.  I know about as much about Carmen and Gallagher as you do right now. There was a whole story there left on the cutting room floor, so to speak, and the book would have been much better if Stacey had taken the time to allow the reader an insight into these two characters.Alex and Grace are somewhat better developed but still leave a bit to be desired.  Grace comes off somewhat naive in the ways of motherhood, to put it nicely.  For some reason we never know, she thinks being able to make cookies is more important in the raising of a child than allowing said child to get to know his father.  Go figure.  I still want to know what makes Grace tick.Stacey has talent but needs to learn a little about character development.  If the reader knows the characters, they care what happens to them.  While this is an exciting story, I never really cared if the characters lived or died except for what would happen to the child.", "overall": 3.0, "summary": "Way too fast!", "unixReviewTime": 1255737600, "reviewTime": "10 17, 2009"}
{"reviewerID": "A3I88L0CTVLT4S", "asin": "B000JMKU0Y", "reviewerName": "CC", "helpful": [0, 0], "reviewText": "I wouldn't tell anyone that this is a book they should read, but I wouldn't tell them not to waste their time either because it is a quick read.  I liked the characters.  It had a lot of action, but not enough suspense for my taste.  Bottomline is that it is a quick read and not too bad, but not too great either.", "overall": 3.0, "summary": "Quick Read - Not Too Bad", "unixReviewTime": 1259539200, "reviewTime": "11 30, 2009"}
{"reviewerID": "A10AVFDDU87KJ4", "asin": "B000JMKU0Y", "reviewerName": "D. Baddorf \"avid bookworm\"", "helpful": [3, 4], "reviewText": "Great book!  It's short, so you can pick it up and finish it in one night.It's also constant action!  And has a strong female lead (nice to find).  I thoroughly enjoyed this book, and recommend it!", "overall": 5.0, "summary": "Great adventure!", "unixReviewTime": 1255478400, "reviewTime": "10 14, 2009"}
{"reviewerID": "A3CXAZI75P116U", "asin": "B000JMKU0Y", "reviewerName": "Deanna L. Fisher", "helpful": [2, 2], "reviewText": "I picked this book up for free from Amazon and it didn't disappoint.  It was action-filled and full of tension.  My only disappointment was with how long it was - it took me less than an hour to read...would liked to have seen the characters a bit more fleshed out and the interaction between the secondary characters could make a good follow-up.", "overall": 3.0, "summary": "Quick but good read", "unixReviewTime": 1256256000, "reviewTime": "10 23, 2009"}
{"reviewerID": "A3R9X003XW0LNR", "asin": "B000JMKU0Y", "reviewerName": "Deborah Verlen \"Deborah\"", "helpful": [0, 0], "reviewText": "Grace is not your typical mother to a nine year old son. She burns cookies, sucks at housework, and generally has to make a huge effort to be domestic. What is she good at? Being a super agent of course. Nine years before, pregnant, shot by her lover Alex, the child's father; she makes a career change. Alex in the meantime has put together the Devlin agency and maintains two personages--that of Sean Devlin whom Grace thinks of as a best friend and confident as well as Alex Rossi, super agent! Grace has no idea that they are the same person. For some reason she never asks Sean why Alex shot her. She just assumes he put the job before her life and in order to achieve his objective to bring the bad guy down that is holding her hostage--he shoots her in order to get him.The story has so many unbelievable scenarios that in order to enjoy it for what it is--romantic suspense--you kind of have to suspend your belief in logic.This is a fast easy read. Don't expect it to make sense in terms of logic, plot etc. Stacey is weak on plot, but her dialogue and characters are fairly strong.", "overall": 3.0, "summary": "Fast, simple read.", "unixReviewTime": 1258761600, "reviewTime": "11 21, 2009"}
{"reviewerID": "A8QL1W8JWGZWH", "asin": "B000JMKU0Y", "reviewerName": "Faith Freewoman \"free woman\"", "helpful": [0, 0], "reviewText": "I'm a real fan of romantic suspense, but rarely enjoy the series-length novels. this one was terrific, credible details, great speed and tension, smokin' hot chemistry and reasonable character development. gonna go buy more Stacey books!", "overall": 5.0, "summary": "LOVED it!!!", "unixReviewTime": 1299369600, "reviewTime": "03 6, 2011"}
{"reviewerID": "A3PCSFLUDCINFJ", "asin": "B000JMKU0Y", "reviewerName": "Fred Henninger", "helpful": [0, 0], "reviewText": "An interesting adventure story leading into a suspension story to hold your attention for the duration! I enjoyed this book VERY much and look forward to more to follow.u", "overall": 5.0, "summary": "72 Hours", "unixReviewTime": 1398211200, "reviewTime": "04 23, 2014"}
{"reviewerID": "A2YLHICVCWNNCC", "asin": "B000JMKU0Y", "reviewerName": "Jwb52z", "helpful": [0, 0], "reviewText": "I was able to get this book several years ago free for my Kindle and I'm just now getting to it in my \"to be read\" list.  I'm not quite sure why, but it doesn't recognize that I got it on Amazon anymore as it usually does at the top of the product page.  I wish this book had been longer.  The only real problem I had with it is that, even being short, I would have preferred that it have chapter demarcations.  That would make it so much easier to find a stopping place or see how close to the end of a chapter you are when you need/want to do so.  That's not so much of a big problem when the book is short or you're reading a novella, but it's still nice.  I really felt for the characters in this book and they seem mostly real to me, but there was a bit of irrationality mixed in that I don't think would have completely been that way in real life.  I won't bore you with a plot summary as I know other reviewers are fond of doing that.  If you like light adventure stories with a smattering of intrigue and suspense, I think you'll enjoy this story, especially if you like a tad of sexual tension and titillation.  Have at it!  I can't wait to read the next one.", "overall": 5.0, "summary": "Cute adventure story", "unixReviewTime": 1378080000, "reviewTime": "09 2, 2013"}
{"reviewerID": "A23U4O4NX29LP", "asin": "B000JMKU0Y", "reviewerName": "Linda Langford \"romance reader\"", "helpful": [0, 0], "reviewText": "Alex Rossi aka Sean Devlin is leading a double life--he's the founder of Devlin Group as Sean Devlin; and he's Alex Rossi (his real name), one of Devlin Groups senior agents. His lifetime goal has been to find & kill the man who murdered his mother.Grace Nolan is an ex- agent, and considers Sean Devlin a friend. When her young son, Danny, is kidnapped, she's forced to ask Devlin Group to help her find & rescue him. The kidnapper just happens to be the killer Alex is seeking, and the killer knows the secret connection between Grace & Alex---Danny is Alex's son---although Alex just found that out. He's furious Grace never told him about Danny. She was furious Alex shot her just before she found out she was pregnant!!This romantic suspense book has plenty of action scenes; tense moments; great one-liners; and great secondary characters who more than likely will have their own stories; I.e., Gallagher & Carmen.", "overall": 4.0, "summary": "GREAT ACTION READ!!!", "unixReviewTime": 1377129600, "reviewTime": "08 22, 2013"}
{"reviewerID": "AUMLTK5TBJT9O", "asin": "B000JMKU0Y", "reviewerName": "Nadine Russo", "helpful": [0, 0], "reviewText": "It was a romantic suspense novel , quick read with predictable events. Well written and well balanced. I enjoyed it while I was sick with the flue and it kept me interested. I read it in one day. It isn't the best I have ever read but in general  I would give it 4 stars out of 5.", "overall": 4.0, "summary": "72 hours , my thoughts", "unixReviewTime": 1315267200, "reviewTime": "09 6, 2011"}
{"reviewerID": "A281X1JBJMB2GS", "asin": "B000JMKU0Y", "reviewerName": "Tanya Paranormal Smut Nut", "helpful": [1, 2], "reviewText": "a fast paced spy romance. reminds me a little of 'the long kiss goodnight'. the sex scenes were quite steamy. A good read, but kinda short.", "overall": 3.0, "summary": "fast paced", "unixReviewTime": 1257033600, "reviewTime": "11 1, 2009"}
{"reviewerID": "A3L37OKQ8YTJQ5", "asin": "B000JMKX4W", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I guess his diary was just like anybodies. It gets better with time. The Nobody does have a good sense of humor though.", "overall": 4.0, "summary": "Diary of a Nobody", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A1SD8Y9Q1KESLB", "asin": "B000JMKX4W", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "It's funny. Definitely worth the price (free). Had me laughing. Not as good as P.G. Wodehouse, but in the same vein. Great for reading on your phone while waiting for anything.", "overall": 3.0, "summary": "Fun read", "unixReviewTime": 1386460800, "reviewTime": "12 8, 2013"}
{"reviewerID": "A2P99LRDXBF8NF", "asin": "B000JMKX4W", "reviewerName": "Celeste Thayer", "helpful": [1, 1], "reviewText": "I enjoyed this book a great deal - very witty and a pleasant read. I actually did laugh out loud a couple of times. Thanks, free classics!", "overall": 4.0, "summary": "Very funny", "unixReviewTime": 1358467200, "reviewTime": "01 18, 2013"}
{"reviewerID": "AV4VME0NQTIH3", "asin": "B000JMKX4W", "reviewerName": "debrakib", "helpful": [0, 1], "reviewText": "This may not be a fair review of the book, as I did not finish.  I read perhaps a quarter and finally gave it up, thinking of all the other books I had waiting.  It simply did not capture my attention.", "overall": 2.0, "summary": "Could not finish", "unixReviewTime": 1357862400, "reviewTime": "01 11, 2013"}
{"reviewerID": "A9L0KCZBVZDJB", "asin": "B000JMKX4W", "reviewerName": "KLP \"Hooked on books\"", "helpful": [0, 1], "reviewText": "This was a mildly interesting, slightly humorous, day-to-day chronicle of a very boring guy's life. I found the historical insights engaging, and some of the daily activities of people in those days interesting. I wish that there had been a little more about the wider events that were happening beyond just the writer's activities. But, then, that would not have been in concert with the title of the book. The author certainly believed in truth in advertising. The title of the book says it all. It's a quick read and never complex.", "overall": 3.0, "summary": "Geez, I hope my life is more interesting!", "unixReviewTime": 1357689600, "reviewTime": "01 9, 2013"}
{"reviewerID": "A32HH93JPN3TVV", "asin": "B000JMKX4W", "reviewerName": "Miss Ivonne", "helpful": [0, 0], "reviewText": "Thirty years before Sinclair Lewis publishedBabbittand set the standard for smug, self-important middle-class conformity, there was The Diary of a Nobody and Charles Pooter. Pooter, a senior bank clerk in the City renting a home in a London suburb of Holloway, encapsulates Victorian respectability, snobbery, and pretensions. Pooter nearly invariably gets the short end of the stick in his interactions with his two neighbors, Cummings and Gowings; his spendthrift, reckless son Lupin; and the various tradesmen and servants he attempts to bully. Slavishly devoted to his employer, Mr. Perkupp, Pooter tries without much luck to cut his son into the same mold. Instead, Lupin slacks at work and spends his nights engaged in amateur theatrics or carousing with his chums till all hours. What's a father to do?First serialized in Punch in 1888 and 1889, The Diary of a Nobody was published in book form in 1892 and hasn't been out of print since. If you give this slim volume a chance (available for free in the Kindle format), you'll see why. Despite being a century old, The Diary of a Nobody remains quite amusing and is laugh-out-loud funny in parts -- particularly in sections dealing with tradesmen or with Lupin's impetuous business dealings or love affairs. As long as there are self-satisfied petit bourgeois snobs, The Diary of a Nobody will continue to entertain.", "overall": 4.0, "summary": "a century later, still quite amusing", "unixReviewTime": 1366502400, "reviewTime": "04 21, 2013"}
{"reviewerID": "A1EJXJUPY08MJL", "asin": "B000JMKX4W", "reviewerName": "miss_scarlett", "helpful": [0, 0], "reviewText": "This is one of those entertaining little British/English humor books.  If you are not accustomed to that style of conversation, you will find this light read very boring.  I think its light and passes the time well.", "overall": 3.0, "summary": "This is english humor, okay if you understand.", "unixReviewTime": 1349481600, "reviewTime": "10 6, 2012"}
{"reviewerID": "A12V4ITKRZFOYK", "asin": "B000JMKX4W", "reviewerName": "Petrichor", "helpful": [1, 1], "reviewText": "I have seen this title around for many years in the back of other books and have been intrigued by it. I had little luck in finding it until I got my Kindle and a whole world of classics that are no longer in print has been opened up to me.This is an enjoyable read. If you love Wodehouse, Wilde or other British social satirists, it is likely you will enjoy this one as well.", "overall": 4.0, "summary": "Finally got my hands on a classic!", "unixReviewTime": 1286323200, "reviewTime": "10 6, 2010"}
{"reviewerID": "A3L3BHR05F00B4", "asin": "B000JMKX4W", "reviewerName": "Rusty Bell", "helpful": [0, 1], "reviewText": "I give this 2 stars because I have read worse books. This book is very boring. Very &#34;yadda, yadda&#34; type. I don't recommend it.", "overall": 2.0, "summary": "Boring", "unixReviewTime": 1377820800, "reviewTime": "08 30, 2013"}
{"reviewerID": "A19ZW40FBYWUBU", "asin": "B000JMKX4W", "reviewerName": "Ryan", "helpful": [2, 2], "reviewText": "This book really did it for me. The humor was usually dry, but kept me laughing just the same. I have no doubt that this book is not for everyone. That being said, I will offer some sound advice for you, the prospective reader:Download this book. It's free, after all. If the premise and first few entries don't have you laughing (or at the very least, smiling), stop reading. Also, check your pulse.", "overall": 5.0, "summary": "Probably one of my favorite books, and I read a lot!", "unixReviewTime": 1318809600, "reviewTime": "10 17, 2011"}
{"reviewerID": "A2XU0JKWBZ1ECC", "asin": "B000JMKX4W", "reviewerName": "VK", "helpful": [0, 0], "reviewText": "For me, this is truly a hilarious book, a small masterpiece. Bizzare, unusual, witty, good language, well written - absolutely great, a classic.", "overall": 5.0, "summary": "a classic!!", "unixReviewTime": 1385078400, "reviewTime": "11 22, 2013"}
{"reviewerID": "A3LZMSQ4IU3N4R", "asin": "B000JMKXYW", "reviewerName": "A Customer", "helpful": [0, 0], "reviewText": "According to Twain, Heaven is years from earth, even when you are transported at .1 speed of light. It is huge, containing souls from multiple worlds, creatures only imagined by later SciFy authors. Multiple gates, minimal entry conditions. There is a caste system, and receptions for those who never received reward during life.I wish that wings were more than decoration, but according to Sandy, an elderly resident, you travel by WISHING yourself around to greet new arrivals, or return to earth with divine messages. Most inhabitants only dress up for formal occasions- halo, harp and wings being a sort of uniform.Sandy tells Stormfield: Heaven is a libertarian place- plenty of room, do as you please, appear any age- but it is not paradise as imagined on earth. Idleness does get old, and please do not irritate the patriarchs. Sandy is a keen observer of people in Heaven.The rest of the tale is similarly imaginative. Twain enlivens things by speaking in the argot of a 19th century sailing master, sprinkling dialogue with phrases like:' An ordinary comet don't make more than about 200,000 miles a minute.  Of course when I came across one of that sort--like Encke's and Halley's comets, for instance--it warn't anything but just a flash and a vanish, you see.  You couldn't rightly call it a race.  It was as if the comet was a gravel-train and I was a telegraph despatch.  But after I got outside of our astronomical system, I used to flush a comet occasionally that was something like.  We haven't got any such comets--ours don't begin.  One night I was swinging along at a good round gait, everything taut and trim, and the wind in my favor--I judged I was going about a million miles a minute--it might have been more, it couldn't have been less--when I flushed a most uncommonly big one about three points off my starboard bow. 'Now, this was published 1907, and an early manuscript exists from 1868!", "overall": 5.0, "summary": "Is Twain Still Wearing his Wings?", "unixReviewTime": 1383264000, "reviewTime": "11 1, 2013"}
{"reviewerID": "A3L37OKQ8YTJQ5", "asin": "B000JMKXYW", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "It was an OK read although at sixty seven I found it a bit juvenile, but i was pleased with the way it stretched my mind.", "overall": 3.0, "summary": "Captain Stormfield's Visit to Heaven", "unixReviewTime": 1379462400, "reviewTime": "09 18, 2013"}
{"reviewerID": "A27M1QT078AGZ2", "asin": "B000JMKXYW", "reviewerName": "Andrew Van Cleave \"Drew\"", "helpful": [0, 0], "reviewText": "Twain questions the common understanding of heaven with a satirical account of one man's trip to and experience in the afterlife.", "overall": 5.0, "summary": "A humorous piece of humble pie", "unixReviewTime": 1375488000, "reviewTime": "08 3, 2013"}
{"reviewerID": "A3E64M6F1NZDA6", "asin": "B000JMKXYW", "reviewerName": "Bres Grace", "helpful": [0, 0], "reviewText": "Mark Twain is one of my favorite authors and as his other works put a smile on my face so did this one.  This tale gives us food for thought.  As always, a great classic!", "overall": 5.0, "summary": "A Most Enjoyable Tale", "unixReviewTime": 1368489600, "reviewTime": "05 14, 2013"}
{"reviewerID": "A3JH1L2JTX27EX", "asin": "B000JMKXYW", "reviewerName": "C. A. Isbell \"bassistann57\"", "helpful": [0, 0], "reviewText": "it was just okay.  I didn't dislike it, but I can live without it.  It wasn't a drama or adventure.  I don't know HOW I would classify it, but it wasn't that great.", "overall": 3.0, "summary": "Captain Stormfield's Visit to Heaven", "unixReviewTime": 1357171200, "reviewTime": "01 3, 2013"}
{"reviewerID": "ALRH7EYOMZ5RH", "asin": "B000JMKXYW", "reviewerName": "David_from_Michigan \"Average user\"", "helpful": [0, 0], "reviewText": "Mark Twain can sure turn them out!  As I survey the somewhat forbidding vista of free books for my Kindle, I generally find that his books will actually be read.  This is a fun conceit about a riverboat captain who dies and travels to heaven, only to find that it is not what he expected.  Twain is not impious, but full of wit reminiscent of talk over the cracker barrel in the old general store.  Not long, but good.", "overall": 5.0, "summary": "Quick, enjoyable, if dated", "unixReviewTime": 1378339200, "reviewTime": "09 5, 2013"}
{"reviewerID": "A2G3C7LJGXLEGF", "asin": "B000JMKXYW", "reviewerName": "mcampey \"Music Lover\"", "helpful": [0, 0], "reviewText": "He doesn't need my recommendation but since you asked, unless you are into thorough reprobates, give it a miss.  As the wag once put it, Mark Twain shows promise.", "overall": 1.0, "summary": "Twain will be okay", "unixReviewTime": 1369440000, "reviewTime": "05 25, 2013"}
{"reviewerID": "A2PS5MUXE34QIE", "asin": "B000JMKXYW", "reviewerName": "M. Wabich \"Freespirit715\"", "helpful": [0, 0], "reviewText": "Didn't know if I would like this but it was very interesting and thought provoking, especially when you consider the time it was written. An easy enjoyable read.", "overall": 4.0, "summary": "Good Mark Twain story", "unixReviewTime": 1355443200, "reviewTime": "12 14, 2012"}
{"reviewerID": "A38TASUAQMQOQN", "asin": "B000JMKXYW", "reviewerName": "T. A. Voss", "helpful": [0, 0], "reviewText": "I am re-doing an on stage production of Mark Twain and his writings. This year I was going to bring out some of his more critical views on organized religion. Captain Stormfield was just the beginning of my very convenient Kindle research.", "overall": 5.0, "summary": "Twain is still the best", "unixReviewTime": 1388275200, "reviewTime": "12 29, 2013"}
{"reviewerID": "A1KPDKD7VYRE3B", "asin": "B000JMKXYW", "reviewerName": "T. S.", "helpful": [17, 17], "reviewText": "This is Twain's satire of contemporary religious mores. It was the last fiction he published in his lifetime, and like much of his later work, it's slightly cynical and very sarcastic, although more upbeat than, for example, _Letters from the Earth_ -- mankind comes across as looking fairly silly overall, but on the whole positive.Probably of most interest to Twain fans who want to read everything of his that they can, or to scholars writing on Twain's religious views, more than to casual Twain readers. It's mildly amusing throughout, but no more than that, and Twain certainly wrote many other works that were more entertaining and more insightful.It's a fairly short read, at 630 kindle \"locations\".", "overall": 4.0, "summary": "Not Twain's best work, but not his worst", "unixReviewTime": 1253836800, "reviewTime": "09 25, 2009"}
{"reviewerID": "AM02OPW4RQ33A", "asin": "B000JMKXYW", "reviewerName": "Vicki G. Russell \"V. Russell\"", "helpful": [0, 0], "reviewText": "I have been a fan of Mark Twain ever since I found we share a birthday. I am glad I found this story.", "overall": 5.0, "summary": "Big Fan", "unixReviewTime": 1388361600, "reviewTime": "12 30, 2013"}
{"reviewerID": "AALR6CRH97JG1", "asin": "B000JML1QG", "reviewerName": "Amazon Customer \"NoClue-Really!\"", "helpful": [0, 0], "reviewText": "Great book.  I always like fairy tales.  For some, the tales are a bit morbid and not suitable for children of today.  Guess I am not sure what I have been told that.  I guess the reason is that TV is the primary culture-resources input allowed by parents and society to pickle the minds of today's children since there is no requirement for an education that would allow them to read?I recommend Grimm because the stories allow those that can read the opportunity to exercise their mind in the &#34;original&#34; virtual space (imagination).Get it!  It's free!", "overall": 5.0, "summary": "Stories for use in the \"original\" virtual space!", "unixReviewTime": 1384387200, "reviewTime": "11 14, 2013"}
{"reviewerID": "A2O40ZU0GTO2KA", "asin": "B000JML1QG", "reviewerName": "auntmom", "helpful": [0, 0], "reviewText": "Love this!  This book has several stories I had heard as a child and a few I had never heard or read.  Wonderful book!", "overall": 5.0, "summary": "Grimm's Fairytales", "unixReviewTime": 1364688000, "reviewTime": "03 31, 2013"}
{"reviewerID": "A2PH33CNTK1X6U", "asin": "B000JML1QG", "reviewerName": "BettyBoop", "helpful": [0, 0], "reviewText": "I fell in love with the show and thought I would read the stories themself. Thease stories are so twisted. But a fantastic read.", "overall": 5.0, "summary": "Always good", "unixReviewTime": 1378512000, "reviewTime": "09 7, 2013"}
{"reviewerID": "ARGCDQPW6JWQR", "asin": "B000JML1QG", "reviewerName": "BlueFairy", "helpful": [67, 69], "reviewText": "Note the title.  This is a selection of fairy tales, in fairly poor translation, not the full \"Grimm's Fairy TALES\", or \"Household Stories\" collection.  There are places where the stories seem to drop off or change direction suddenly mid-stream.  \"The Little Brother and Little Sister\", for example, is missing a paragraph that is in other versions, which is needed to follow the plot.A few stories seem to have no point or plot at all, or added endings, although \"Catherine and Frederick\" is only a little worse here than in other versions I have found.  Most of the good stories are repeated in better collections.Only notable bits:\"Bearskin\" is one that isn't in every collection of Grimm's Tales, and I found it enjoyable.  I prefer the stories like this and \"The Six Swans\", in which the day is won through persistence and cleverness. Also, he cheats the devil, which is always a nice touch. Many of these stories are solved through nothing more interesting than dumb luck.This version of \"The Frog Prince\" has a very beautiful beginning, but the rest of the story is disjointed, uninspired, and annoying.Overall it was very uneven, and next time I'll search Project Gutenberg for the full tales.", "overall": 2.0, "summary": "Poor Selection.", "unixReviewTime": 1286755200, "reviewTime": "10 11, 2010"}
{"reviewerID": "A3LH80QTXOUQEN", "asin": "B000JML1QG", "reviewerName": "Charlie", "helpful": [0, 0], "reviewText": "I'm glad I now have a new version of Grimm's stories. I grew up reading Grimm and Andersen and I lost my old storybooks many years ago. It's comforting to reread them now.", "overall": 4.0, "summary": "Old fairy tales", "unixReviewTime": 1336608000, "reviewTime": "05 10, 2012"}
{"reviewerID": "A3BKD3SDJ3YMEH", "asin": "B000JML1QG", "reviewerName": "Damon163", "helpful": [0, 0], "reviewText": "This is a pretty good collection of the Grimm Fairy Tales. It was translated into pretty simple English. This is just a few of the Grimm's stories and there are a lot other books out there with more than just these stories. This was a good quick read of some of the Grimm Fairy Tales, and I would recommend it to someone who is looking for a quick read of a selection of the Grimm Tales.", "overall": 4.0, "summary": "Pretty Good Collection", "unixReviewTime": 1327795200, "reviewTime": "01 29, 2012"}
{"reviewerID": "A1PSYTEX4HIVAC", "asin": "B000JML1QG", "reviewerName": "DimPoint", "helpful": [0, 0], "reviewText": "Though these be the tales of the brothers, the tales are incorrect.  These stories are happy tales while the tales written by the brothers were horrid and without a happy ending.", "overall": 2.0, "summary": "Incorrect", "unixReviewTime": 1366416000, "reviewTime": "04 20, 2013"}
{"reviewerID": "AF703M0D6NSKR", "asin": "B000JML1QG", "reviewerName": "H.C. Heartland", "helpful": [0, 0], "reviewText": "For those who haven't yet read the Grimm's Tales but have only heard about them, please take time to sit down and see what the age of fairy tale telling produced in its early days. From these we have the basis for many modern day tales that are written.", "overall": 5.0, "summary": "Age Old Classic", "unixReviewTime": 1392768000, "reviewTime": "02 19, 2014"}
{"reviewerID": "A3LUQLGVWVH4BZ", "asin": "B000JML1QG", "reviewerName": "john hancock", "helpful": [0, 0], "reviewText": "what can i say ? classic fables at their best from the brothers grimm. great stories, great fantasy..give your mind a workout with these classic tales.", "overall": 5.0, "summary": "what can i say ? classic fables at their best from the brothers grimm. great stories, great fantasy..give your mind a workout wi", "unixReviewTime": 1386288000, "reviewTime": "12 6, 2013"}
{"reviewerID": "A3IXR7QBV0TW1X", "asin": "B000JML1QG", "reviewerName": "Kathy Fleming", "helpful": [0, 0], "reviewText": "Fun stories to read to my children.They are always asking me to read them a favorite from the book. Excellent writer Jacob Grimm. Every child should have someone read to them!", "overall": 5.0, "summary": "Grimm's Fairy Tails", "unixReviewTime": 1384128000, "reviewTime": "11 11, 2013"}
{"reviewerID": "A2UD0N0LPO9YM0", "asin": "B000JML1QG", "reviewerName": "lrm", "helpful": [0, 1], "reviewText": "Never realized the fairy tales we have heard all our life were based on such horrible tales. I thought this was a good book to have on hand for my grandchildren, but I would not read or allow them to read this.", "overall": 1.0, "summary": "Horror!", "unixReviewTime": 1385856000, "reviewTime": "12 1, 2013"}
{"reviewerID": "A2Q27OP8IVKVU3", "asin": "B000JML1QG", "reviewerName": "L. WILLIAMS \"Truth Seeker\"", "helpful": [0, 0], "reviewText": "It had never sunk in to me that these stories were so grim and horrid.  I thought I was getting a book of children's fairy tales that I could read to my grandchildren!  Be forewarned!", "overall": 2.0, "summary": "Bad idea", "unixReviewTime": 1372896000, "reviewTime": "07 4, 2013"}
{"reviewerID": "A2IPZR62RKDSAV", "asin": "B000JML1QG", "reviewerName": "Melody Stanley", "helpful": [0, 0], "reviewText": "I absolutely LOVE THIS BOOK. I turn on the read to me feature and listen to these stories every night. I am so familiar with the stories in this book that I know them by heart. This book gets all stars in my opinion.", "overall": 5.0, "summary": "My fairy story book", "unixReviewTime": 1373241600, "reviewTime": "07 8, 2013"}
{"reviewerID": "A3PMV0LPE6HTLQ", "asin": "B000JML1QG", "reviewerName": "Miss H. Holmes", "helpful": [0, 0], "reviewText": "This is a fascinating collection of collected stories, many different versions of one another. If you are interested in these fairytales, I would advise for you to get various published stories of the Brothers Grimm's tales.", "overall": 5.0, "summary": "GFS", "unixReviewTime": 1365897600, "reviewTime": "04 14, 2013"}
{"reviewerID": "A2DWN2MQYWKGNX", "asin": "B000JML1QG", "reviewerName": "PinkieFairy", "helpful": [0, 0], "reviewText": "Not exactly what I remember the stories to be but this might be a different version then the one I was read.", "overall": 2.0, "summary": "Grimm's Fairy Stories", "unixReviewTime": 1355875200, "reviewTime": "12 19, 2012"}
{"reviewerID": "A36OQ45P8W6IYE", "asin": "B000JML1QG", "reviewerName": "Robert Hall", "helpful": [0, 0], "reviewText": "Many of the tales aparently have been cosmeticly rendered by Disney and that ilk.  These are a gas.  If you have not read them since childhood I recommend them to you.", "overall": 5.0, "summary": "Wern't you a child once", "unixReviewTime": 1294963200, "reviewTime": "01 14, 2011"}
{"reviewerID": "A276RSP2TXV3CX", "asin": "B000JML1QG", "reviewerName": "TechGeek", "helpful": [0, 0], "reviewText": "I am not a real big fan of fairy tales but these fairy tales are always a very good read.", "overall": 5.0, "summary": "Great Stories", "unixReviewTime": 1370390400, "reviewTime": "06 5, 2013"}
{"reviewerID": "A1KPDKD7VYRE3B", "asin": "B000JML1QG", "reviewerName": "T. S.", "helpful": [221, 226], "reviewText": "This is a greatest-hits grab bag of 25 stories from the Grimm's Fairy Tales collection, unillustrated, and apparently taken from the 1884 Margaret Hunt translation. Good collection of the highlights, but there are more complete collections (for example,Household Tales by Brothers Grimm) available for free in the kindle store.List is:The Goose-GirlThe Little Brother and SisterHansel and GrethelOh, if I could but Shiver!Dummling and the Three FeathersLittle Snow-WhiteCatherine and FrederickThe Valiant Little TailorLittle Red-CapThe Golden GooseBearskinCinderellaFaithful JohnThe Water of LifeThumblingBriar RoseThe Six SwansRapunzelMother HolleThe Frog PrinceThe Travels of Tom ThumbSnow White and Rose RedThe Three Little Men in the WoodRumpelstiltskinLittle One-eye, Two-Eye, and Three-Eyes", "overall": 4.0, "summary": "Grimm's Greatest Hits", "unixReviewTime": 1275868800, "reviewTime": "06 7, 2010"}
{"reviewerID": "A2OZNIS9RL7OZV", "asin": "B000JML1QG", "reviewerName": "Vincent Hobbes", "helpful": [0, 0], "reviewText": "I was excited to re-read this. It's been years, and each tale came back as a vivid reminder of my youth. A great book!", "overall": 5.0, "summary": "who doesn't love Grim's Fairy Tales", "unixReviewTime": 1308614400, "reviewTime": "06 21, 2011"}
{"reviewerID": "A38ZV2FL84EUF5", "asin": "B000JML2H4", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I thought it would be sweet to share these with my son but all in all, they left me with a negative impression.  Some of the prayers have a looming undertone.", "overall": 3.0, "summary": "I prefer free form prayer", "unixReviewTime": 1354060800, "reviewTime": "11 28, 2012"}
{"reviewerID": "A2TQE2AF176XE7", "asin": "B000JML2H4", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "lots of prayers, a little to old for my grandchildren. they are 2 and 3.  so we will just keep till they get into school.", "overall": 4.0, "summary": "prayer", "unixReviewTime": 1391299200, "reviewTime": "02 2, 2014"}
{"reviewerID": "A1C55AI5AR9F10", "asin": "B000JML2H4", "reviewerName": "Brandy", "helpful": [0, 0], "reviewText": "I teach my children to pray to the Lord as if they are speaking to their best friend, open, honest, and in modern language. This had too many 'thy's and thou's' for me and my family, but others may find it helpful in their walk with God.", "overall": 3.0, "summary": "Not for me", "unixReviewTime": 1330560000, "reviewTime": "03 1, 2012"}
{"reviewerID": "A1BWH5QZWF2U2G", "asin": "B000JML2H4", "reviewerName": "Sylvie", "helpful": [0, 0], "reviewText": "This book has many prayers that children should know.  With them on my kindle, I can easily teach them to our Sunday school class that we have just started.  I also enjoyed reading the prayers that were new to me.", "overall": 5.0, "summary": "Love it!", "unixReviewTime": 1400457600, "reviewTime": "05 19, 2014"}
{"reviewerID": "A1Q8QKKXDN0E3G", "asin": "B000JML2H4", "reviewerName": "T. Scott \"Paranormal Investigator\"", "helpful": [0, 0], "reviewText": "Great beginning prayer book for children. Excellent way to teach them the habit of prayer. It can be used by all denominations and Christian faiths.", "overall": 4.0, "summary": "Little Folded Hands", "unixReviewTime": 1399593600, "reviewTime": "05 9, 2014"}
{"reviewerID": "A3BF95GP1ZQYFS", "asin": "B000JML5JY", "reviewerName": "Alexander", "helpful": [1, 1], "reviewText": "Written poetically. But the horror of the trenches, he does not come too close.He sees the war from the stage. The wanton destruction of civilian buildings, churches, public buildings is just another step on the road of history. From the destruction of the Alexandrian library-up to the current Coronation Hiroshima. Nothing has changed. It is just waiting for things to come.He could imagine the horror only partially. The book does not fall into the category of war propaganda. It's the surprise, the mourning over the extinction of cities that have grown over the centuries.", "overall": 4.0, "summary": "A poetic observer", "unixReviewTime": 1363651200, "reviewTime": "03 19, 2013"}
{"reviewerID": "A1YRYH5LD5W189", "asin": "B000JML5JY", "reviewerName": "Chileman \"SSandy\"", "helpful": [0, 0], "reviewText": "The book is the authors account of a portion of France after Germany's attempts at occupation during WWI.  The author is quite descriptive as he documents the scenes of death and destruction throughout his stay on the front lines.  I found the book of interest both politically and historically.  If one is seeking a glimpse of history through the eyes of someone that was present at the time, you should not be disappointed.  The book is somewhat short but a good read nevertheless.", "overall": 4.0, "summary": "Over There: War Scenes on the Western Front", "unixReviewTime": 1401062400, "reviewTime": "05 26, 2014"}
{"reviewerID": "A312GV8IURIC5E", "asin": "B000JML5JY", "reviewerName": "Gordon Whiteman", "helpful": [1, 1], "reviewText": "I liked this book.  It gave an insight into the lives and activities of France during thr First World War as it pertained to the civilians and troops without the ususl tumult of actual warfare.-", "overall": 4.0, "summary": "Highly recommended", "unixReviewTime": 1373068800, "reviewTime": "07 6, 2013"}
{"reviewerID": "A39A6B9YR9R0L6", "asin": "B000JML5JY", "reviewerName": "Phil", "helpful": [19, 20], "reviewText": "The title of this book is a phrase used by the British and Americans during World Wars 1 and 2 to indicate continental Europe, where the fighting was taking place. This book was written during World War 1. The Western Front in the subtitle is the line where the westward-moving German army was being met by the armies of the countries they were invading. Arnold Bennett was a novelist who was Director of Propaganda for France at the Ministry of Information during the war. That's the background, on to the book...Bennett tells of the time he spent moving from town to town in France and Belgium along the Front. He is always escorted by a military officer, and they often walk through trenches and have to take cover if an artillery shell explodes nearby. He frequently goes into detail about towns and buildings that have been damaged or destroyed by the Germans. It's not a very personal book- he seldom writes about people he meets or relates conversations. Occasionally he muses on the absurdity of what the Germans are doing, and what it is costing in terms of people's lives and livelihoods. His cynicism shines through at those moments. The book will be best enjoyed by war buffs, but it's short, and an excellent description of a war zone, so I recommend it to people who don't normally read war books as well.", "overall": 5.0, "summary": "Life on the Western Front during World War 1", "unixReviewTime": 1270425600, "reviewTime": "04 5, 2010"}
{"reviewerID": "AMYS6YEEYSNB1", "asin": "B000JML5JY", "reviewerName": "rakkasan3_187 \"rakkasan\"", "helpful": [1, 1], "reviewText": "This was very well-written, in a romantic style.  At times, the author romanticizes war, then vilifies it.  Not that he is confused, I think that's how they related to things in that period.It still amazes me, and angers me, as a Belgian, how Germany managed to survive as a nation.  To call them brutes or barbarians and murderers is not enough.  What they perpetrated on Europe in two world wars is beyond comprehension.  After viewing the wanton, unnecessary, almost childish destruction caused by the retreating Germans, the author actually hopes that one German city will be levelled entirely, as punishment, retribution, and as a lesson to future Germans that wars of expansion in Europe are unwanted and will be avenged.  This did not happen.Author tours the French and British trenches and rear areas, giving amazing insight into the French military psyche at the time.  That part, I enjoyed the most.  People who ridicule French military prowess have no idea of what they speak, and are, certainly, no students of history.", "overall": 5.0, "summary": "Short, But A Great Read", "unixReviewTime": 1359763200, "reviewTime": "02 2, 2013"}
{"reviewerID": "A19V8I1LEHA1YW", "asin": "B000JMLBHU", "reviewerName": "Alexander Hollins \"Author, Reader, Editor, Tired\"", "helpful": [0, 0], "reviewText": "A manual on desert island survival in its own right, this book besides having the old Verne slow build to a climax that I love so much has a LOT of interesting little asides that give a lot of information about attitudes and behaviour of the time, from the treatment of the the castaways towards each other, the land around them, and the animals.  Worth reading.", "overall": 4.0, "summary": "A classic for a reason", "unixReviewTime": 1404000000, "reviewTime": "06 29, 2014"}
{"reviewerID": "A3J5D9XN0QT9AG", "asin": "B000JMLBHU", "reviewerName": "Allrie", "helpful": [0, 0], "reviewText": "I remember going to the movie theatre when about 56/7 yrs old. with my cousin 4 years older.  We enjoyed it so much that we staye through a second showing--and got into huge trouble!  I saw the book's availability and realized that I'd never actually read the book.  It did not disappoint.  At our upcoming family reunion, I'd like to share that movie experience with my grandkids--but am sending them the book to enjoy first.", "overall": 5.0, "summary": "Trouble", "unixReviewTime": 1367366400, "reviewTime": "05 1, 2013"}
{"reviewerID": "A33EX8MZYBV0YI", "asin": "B000JMLBHU", "reviewerName": "alone with books", "helpful": [0, 0], "reviewText": "this was an Ok book, but slow at times, I actually put it down and read something else and then came back, the second part was better, when  other people came into the story", "overall": 3.0, "summary": "the Mysterrous Island", "unixReviewTime": 1374537600, "reviewTime": "07 23, 2013"}
{"reviewerID": "A3HK1FZVP03IIC", "asin": "B000JMLBHU", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "Classic. What else needs to be said. An adventure classic, you must remember when Verne was writing the world was a very different place.", "overall": 4.0, "summary": "Classic", "unixReviewTime": 1358208000, "reviewTime": "01 15, 2013"}
{"reviewerID": "A27EEX3H2CB70G", "asin": "B000JMLBHU", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "I read the who thing on my phone.  Enjoyed it a lot but, not as much as King Salomon's Mine which, is also free", "overall": 4.0, "summary": "Good Story", "unixReviewTime": 1365638400, "reviewTime": "04 11, 2013"}
{"reviewerID": "A1BKERTS8SPHER", "asin": "B000JMLBHU", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "KEEPS YOU INTERESTED.  RECOMMEND TO ANY AGE. GENUINE MASTERPIECE EVERYONE SHOULD READ.  VERY GOOD FOR CHILDREN.  MAKES A WONDERFUL GIFT.", "overall": 5.0, "summary": "THE MYSTERIOUS ISLAND", "unixReviewTime": 1359417600, "reviewTime": "01 29, 2013"}
{"reviewerID": "A9GPEIJ6JS3UE", "asin": "B000JMLBHU", "reviewerName": "Amazon Customer", "helpful": [0, 0], "reviewText": "This classic is a must read, especial for anyone who has read 20,000 Leagues .. Even if you simply watched Walt Disney's early film adaptation your sure to enjoy this story. There are a few place where it drags a bit and some of the language usage is dated, but that some how seems to add to it's charm.", "overall": 4.0, "summary": "Jules Verne is arguably one of the great writters", "unixReviewTime": 1350432000, "reviewTime": "10 17, 2012"}
{"reviewerID": "AB3EF5PVHCBHY", "asin": "B000JMLBHU", "reviewerName": "Amazon Customer \"reader\"", "helpful": [0, 0], "reviewText": "Simply outstanding even though I've read it before.  Verne is an outstanding writer for a n y generation.  Offer this to your children.", "overall": 4.0, "summary": "Mysterious Island", "unixReviewTime": 1383696000, "reviewTime": "11 6, 2013"}
{"reviewerID": "A1OTZWCK1NLDP8", "asin": "B000JMLBHU", "reviewerName": "Amy \"AmyGeb\"", "helpful": [0, 0], "reviewText": "I would highly recommend this classic to everyone from young teens to our most senior adults.  Warning it is a long, involved tale that can't be read in one evening.  Since every character is a man, it is a less than sentimental journey.  Though they are definitely some tearful scenes.  One character is a former slave, but is treated as the others' equal though somewhat condescendedly.  I enjoyed looking back at a culture and customs that are long gone.  And no spoilers, but you may want to read another Verne classic when done with this one...", "overall": 5.0, "summary": "What a fascinating look at life over a century ago.", "unixReviewTime": 1398729600, "reviewTime": "04 29, 2014"}
{"reviewerID": "A27M1QT078AGZ2", "asin": "B000JMLBHU", "reviewerName": "Andrew Van Cleave \"Drew\"", "helpful": [0, 0], "reviewText": "Adventure seekers and literature aficionados alike will be satisfied  with this rich story of a group of castaways who come  together in the name of survival on a remote island in the Pacific.", "overall": 5.0, "summary": "A Must Read For Every Generation", "unixReviewTime": 1376179200, "reviewTime": "08 11, 2013"}
{"reviewerID": "A1239X8WATIZ3K", "asin": "B000JMLBHU", "reviewerName": "Anita M. Nichols", "helpful": [0, 0], "reviewText": "I could not take myself out of the book once I got started.  It had a great amount of mystery, some of which could be figured out  (especially if you are familiar with Jules Verne) however, there were a lot of twists and turns the kept me guessing.  He must have done a tremendous amount of research to be able to describe all the things he had these character had to do in order to survive.  Like I said, Very Educational.", "overall": 5.0, "summary": "Educational Mystery", "unixReviewTime": 1391040000, "reviewTime": "01 30, 2014"}
{"reviewerID": "A3MC71A07AH7S3", "asin": "B000JMLBHU", "reviewerName": "Barbara Porter", "helpful": [0, 0], "reviewText": "The author had a great story line. Brought each character to life and had quite an interesting ending. Didn't see the ending coming. Will recommend book to friends and family.", "overall": 5.0, "summary": "The Mysterious Island", "unixReviewTime": 1402790400, "reviewTime": "06 15, 2014"}
{"reviewerID": "AHCMI8B03QE3B", "asin": "B000JMLBHU", "reviewerName": "Bill L. Stephens \"Book Reviewer\"", "helpful": [0, 0], "reviewText": "Who could not enjoy a Jules Verne story.  This was as entertaining as all the others and very interesting as the men stranded on the island came up with ways to survive being on the island.", "overall": 5.0, "summary": "What can you say--it is a Jules Verne book.", "unixReviewTime": 1386806400, "reviewTime": "12 12, 2013"}
{"reviewerID": "A1BKVWXTMOSN47", "asin": "B000JMLBHU", "reviewerName": "blueridge boy", "helpful": [0, 0], "reviewText": "I enjoyed this book but had trouble following the story.i can recommend it,but I have enjoyed others more.it is a good book if you like this kind of story.", "overall": 3.0, "summary": "the mysterious island", "unixReviewTime": 1368230400, "reviewTime": "05 11, 2013"}
{"reviewerID": "A5CA9579GD7HJ", "asin": "B000JMLBHU", "reviewerName": "Bob Jarvis", "helpful": [4, 6], "reviewText": "I know it's by a classic author & I feel I should join the positive reviewers here, but I'm afraid I can't.The book starts well enough, with a daring prisoner-of-war camp escape, by balloon, followed be a harrowing flight through the storm & a forced landing on a Pacific Island. Then the plot weakens....One of the book's biggest mysteries must be that, whilst huge numbers of indiginent Pacific islanders evolve by scratching out a living fishing off a sand-bar of an island, this extemely large, visible (it has a huge mountain in the middle) island, remains undiscovered. A pity because this surely must be one of the most verdant, farming-friendly, mineral wealthy islands on Earth. It is also extremely well-stocked with all manner of useful, & tasty beasts. Our heroes, in a few short years, manage to become completely self-sufficient & are soon spoilt for choice as to where to abide & what to have for supper.I would estimate that a full eighty percent of the plot is dedicated to the ingenious, almost miraculous, development of the island's bounty. Our five heroes are the most innovative of castaways; nothing is beyond them. During their time on the island they have the know-how & resources to produce bricks, pottery, ironware, gunpowder, nitro-glycerene, etc. etc., even introducing a telegraph system & no detail is spared in the descriptions of each operation. As a consequence the book reads like a cross between Handyman's Journal, Construction Weekly & Farming Monthly.The castaways are a deadly boring bunch. They quickly become firm friends; respectful, tolerant & pass their time in mutual hero-worship & devotion. They are such a 'hail-fellow & well met' group that there is a complete absence of any sort of jealousy, resentment, discontent or moaning; indeed a complete absence of any emotional excitement.There is a mystery involved but I didn't feel it worth the effort of wading through the massive amount of technical details to find out the end result.Look here for blandness & do-it-yourself tips; look elsewhere for adventure.", "overall": 2.0, "summary": "Handyman's Journal", "unixReviewTime": 1311984000, "reviewTime": "07 30, 2011"}
{"reviewerID": "A2M7R6TNMH5YZN", "asin": "B000JMLBHU", "reviewerName": "BrentW", "helpful": [0, 0], "reviewText": "One of the better fiction books I've read in a long time. Jules Verne is a master at subtly building suspense!", "overall": 5.0, "summary": "Great book!", "unixReviewTime": 1354665600, "reviewTime": "12 5, 2012"}